{
  "news": [{"date": "2025-09",
    "entries": [
      "<strong>09-08</strong> - I am in the midst of upgrading the codebase for my site. This will be a long process. I plan on updating different components in the site periodically. This means that some areas will look different, but these changes should not impact the core functionality. This is mostly cosmetic.",
      "If you see a bug, please go to my discord server and post them in the Datafort section. I will work on resolving them as they are posted.",
      "here is what has been updated this release:",
      " - Combat Zone Army Builder - fixed some style issues with programs and added ranges to the programs that should have them.",
      " - Cyberpunk 2020 Character Generator Contact Section - I have updated this component with the new styling for input fields etc. This should also have made the section a bit more stable.",
      " - Cyberpunk 2020 Fixer Calculator - I replace the Hot Stuff and Big League components with the ones from the character sheet to reduce code and keep each area consistent with each other.",
      "CYBER :D"
  ]
  },{"date": "2025-08",
    "entries": [
      "<strong>08-22</strong> - Combat Zone Army builder updates:",
      " - Add book icon to display the product a card was published in. This should help with finding what expansion you need.",
      " - Data updates with the reference data.",
      " - Fixed a few minor bugs.",
      " - Upgraded the version the website is using. Slowing refactoring areas in the site.",
      "CYBER :D"
  ]
  },
    {"date": "2025-05",
    "entries": [
      "<strong>05-31</strong> - Combat Zone Army builder updates:",
      " - Fixed some more data issues and the require functionality to handle them.",
      " - Enhanced the Objective section with two sections: Achieved and Scenario. Achieved is to keep the card your team has completed, and Scenario is to deal 3 cards for the current scenario.",
      " - Enhanced the Objective card selector section. Just showing the titles of the card with the ability to expand them to read the full details.",
      " - Added notification if the team exceeds Gonk limitations from Influence",
      " - Added notification if a Character that is added is not of the same faction nor a merc for validation.",
      " - Added a label for number of mercs in the team and if they exceed the 2 merc limit",
      "<strong>05-17</strong> - Combat Zone Army builder updates:",
      " - Fixed data with updates for Police Sniper, Officer, and some gear.",
      " - Added wild things, Piranha, and 6th Street objective cards.",
      " - Add iconic Leader gear cards. There is no automatic filter for them. they will need to be manually chosen properly.",
      " - Add Luck tokens to individual Characters instead of the shared Team's pool of Luck.",
      " - Fixed gear list not defaulting to the Team's faction but the Characters.",
      "<strong>05-14</strong> - More fixes and enhancemnts to the Combat Zone Army builder:",
      " - Fixed typos and other issues for mobile.",
      " - Change tabs to be icons for a better layout on several sections.",
      " - Fixed layout for mobile for character view. ",
      " - Add Street cred fitlers, show unit already selected, skill filters on the unit list.",
      " - Add filter eb filter on gear selection list. ",
      " - Mobile layout has a better layout to help improve experience using on a phone",
      "<strong>05-04</strong> - Some more fixes and enhancemnts to the Combat Zone Army builder:",
      " - Fixed some typos and other minor display issues.",
      " - Change MOVE to REFLEX skill.",
      " - Change the layout for the faction selector.",
      " - Added keyword searchon Gear list.",
      " - Added street cred filter on Gear list.",
      "CYBER :D"
  ]
  },
    {"date": "2025-04",
    "entries": [
      "<strong>04-25</strong> - A lot of fixes and enhancemnts to the Combat Zone Army builder:",
      " - Fixed gear card faction validations",
      " - Fixed Hacks tracking on the Character card.",
      " - Change the layout of the Character card screen to better fit things.",
      " - Fixed an issue in the PDF export with layout issues.",
      " - Added total gear and program costs to the tabs on the Character form.",
      " - Change the sort order on the army listing to be sorted by Leader > Characters > Gonks.",
      " - Add notes to both the army and to each character form.",
      " - Add the function to add additional Actions and remove then in the Character form.",
      " - Fixed some data issues with the Characters cards.",
      "<strong>04-17</strong> - Fixed some styling issues and bugs in teh Cyberpunk Red: Combat Zone army builder, specifically around Specialist keywords, Adam Smasher, and styled the programs & gear sections.",
      "<strong>04-13</strong> - Updated the Cyberpunk Red: Combat Zone army builder. Add the Edgerunner expansion to it and add the Wild Things, Piranha, and 6th Street gangs to the list.",
      "I also remove the Objective cards and Loot card sections for now as both need a bit of work. I plan on doing some redesign to the army builder as I want to have a better UI/UX to it.",
      "CYBER :D"
  ]
  },
    {"date": "2024-08",
    "entries": [
      "<strong>08-14</strong> - Fixed a bunch of mobile layout issues on the Cyberpunk 2020 character generator. Should look better on the screen. Still needs work for the mobile experience.",
      "NEW* - Combat Tracker now has PDF export of all the characters are Fast & Dirty layout. You can now print it out and bring it to your game or add to your notes.",
      "NEW* - Added a row on the armor table for the character generator and the combat tracker to all you to add cover SP to the calculation to help with figuring out how much protection you have. ",
      "I'm still looking at other improvements and new utilities to add  to the site. Till next time gatos.",
      "CYBER :D",
    "<strong>08-10</strong> - Fixed several bugs with the Cyberpunk 2020 character generator PDF export, weapon data, NR Map (specifically orbitville map), bug with the datafort creator.",
    "The update to the site has been awhile. I am working on a couple of things for the site, new apps. Just need to finish them up.",
    "Till next time gatos.",
    "CYBER :D"
  ]
  },
    {"date": "2024-01",
    "entries": [
    "<strong>01-31</strong> - Fixed some bugs with the combat tracker for weapons and skills. Added an option in the random weapon generator to set the quantity to generate. Options should be sticky now.",
    "Till next time gatos.",
    "CYBER :D",
    "<strong>01-05</strong> - It has been awhile. Real life and my TTRPG has distracted me quite a bit. I'm running 2 games and playing in 2. I think I overburdened myself. But on to this update. I fixed a few bugs throughout the site none more than the ones on the 2020 Combat Tracker. ",
    "I have spent a bit of time refactoring/restyling the combat tracker to help improve it for your Cyberpunk 2020 games. ",
    "I have include icons instead of text for a combatant's wounds and status (stunned or dead). I like it better than the plan text. ",
    "I update the top navigator to tighten it up a bit for better accesibility on mobdile devices. ",
    "Speaking of mobile devices, I specifically tried to make the experience better on them; Less scrolling, flyout combatant details, better layout of the fields in the details.",
    "Those Cyberpunk 2020 netrunners I have include the ports and output ports numbers to each of the decks. So now you can keep track of how many options you should be limited to. There is also some small styling changes",
    "Character generator also had some bug fixes. Filtering on skills with just values now works. Fixed an issuw with gear input boxes.",
    "Till next time gatos.",
    "CYBER :D"]
  },
    {"date": "2023-07",
      "entries": [
        "<strong>07-10</strong> - Quick update. I know it has been awhile since my last one and this isn't anything ground breaking. Just doing some small bug fixes to the character generator this time.",
        "Apologies for the long silence. IRL has been sucking up my friend time as I'm in 5 gaming groups now. I wanted to game more but didn't think I would get this much. I run Cyberpunk 2020 and Call of Cthulhu (Masks campaign). I play in a Traveller game, a IU game, and alternate between Battletech and X Wing now. In addition work has been sucking up a lot of time now as well.",
        "If you want to know about my Cyberpunk 2020 game, head over the <a href='https://www.worldanvil.com/w/cybersmily-s-cyberpunk-2020-world-cybersmily'>my World Anvil world</a>. It's a Highrider campaing to free O'Neil 2 from the tyranny of ESA. This has been a lot of work getting this done and keeping the campaign going.",
        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    {"date": "2023-01",
      "entries": [
        "<strong>01-21</strong> - Another update to the site:",
        "&nbsp;* Character generator for Cyberpunk 2020 now as location sections for cyberware and gear. You can now organization both sections with locations or however else you want to use that field for.",
        "&nbsp;* Location sections coming with drag/drop between the locations to help move them about. ",
        "&nbsp;* Cyberware lookup has changed on the character generator. It is to be more inline with the datalist selectors.",
        "&nbsp;* Fixed a bug with the random cyberware generator to avoid duplicates.",
        "&nbsp;* Fixed a bug with the armor typeahead function not saving the piece of armor.",
        "&nbsp;* improved the vehicle section on the character generator as well with a typeahead lookup and some layout changes.",
        "&nbsp;* improved the cyberdeck/program section on the character generator to have drag and drop programs into the cyberdeck. More work is needed on it.",
        "&nbsp;* Fixed a bug with the combat tracker in which clicking on Is Stunned reset the initiative of the opponent.",
        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    {"date": "2022-12",
      "entries": [
        "<strong>12-28</strong> - Not much done other than a few bug fixes and some udpates to the data sheets.",
        "&nbsp;* Changing lookup lists in the Cyberpunk 2020 character generator.",
        "&nbsp;* Add a Cyberpunk 2020 Referee screens/cheat sheets.",
        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    {"date": "2022-11",
      "entries": [
        "<strong>11-21</strong> - A few things have been added:",
        "&nbsp;* Add haggling calculator to the Character Generator for Cyberpunk 2020 under the Lifestyle Section of the sheet. This will use rules from Wildside supplement.",
        "&nbsp;* A bunch of other updates to the Character Generator, such as type ahead look up on several input fields, fly out menus instead of pop up dialogs, in settings add/remove sections on the character print out, and more.",

        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    {"date": "2022-10",
      "entries": [
        "<strong>10-10</strong> - bug fixes and enhancements to the character generator for 2020:",
        "&nbsp;* Add check box to show just the skills with points in them.",
        "&nbsp;* Armor section allows to either calculate the EV/Cost/Weight of a piece or allow the player to customize the values.",
        "&nbsp;* Bug fix on armor section too, the EV will not count different pieces of armor on different limbs as a different layer for EV. So if you have a left arm piece with SP 20 and a right arm with SP 12, the EV won't see them as differnt layers for stacking purposes.",
        "Again, plugging Wisdom000 and my VOD cast: Tales from the Forlorn Dopes. Check it out live every 1st/3rd Wednesday of the month on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a> at 7PM EST/12AM GMT/4PM PST or watch them on <a href=\"https://www.youtube.com/c/CybernationUncensored\">Cybernation Uncensored's Youtube Channel</a>.",
        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    {"date": "2022-09",
      "entries": [
        "<strong>09-25</strong> - Some bug fixes to end the month off:",
        "&nbsp;* Renaming option of blank Language, Exper, Martial Art skill failing.",
        "&nbsp;* Net Arch for CP Red not loading saved json files.",
        "&nbsp;* Generator for Maximum Metal not calculating Stealth Armor and Damage Control spaces/cost correctly.",
        "&nbsp;* Removed auto sorting of siblings in the Charcter Generator for Cyberpunk 2020.",
        "&nbsp;* Fixed IU RT calculation on the Character Generator for Cyberpunk 2020.",
        "If you have ideas for enhancements to the apps or want to report a bug, head over to my Discord server (link up in right corner) and use the #datafort-bugs or #datafort-enhancements channels. Also, you can chat up on Cyberpunk topics in some of the other channels I have.",
        "<strong>09-17</strong> - Another release this month with the following:",
        "&nbsp;* New Contacts section to the Character Generator for Cyberpunk 2020. This includes the Big League and Hot Stuff areas if you have Streetdeal skill and a place to put generic contacts to the sheet.",
        "&nbsp;* Bug fix on Combat Tracker for Cyberpunk 2020. Issues with Armor. Now you can override the set limits on SP as well as edit armor in the tracker instead having to delete the piece and recreate.",
        "&nbsp;* Bug fix on Data List. Numbers weren't filtering properly. Also renamed More Guns to Edge of Sword Conversion. I also fixed some filtering problems there as well.",
        "That's it for this relase. Right now been fleshing out a highrider campaign for 2020. If you like to see my work head over to <a href='https://www.worldanvil.com/w/cybersmily-s-cyberpunk-2020-world-cybersmily'>my World Anvil site</a>. It contains some things from my previous campaing in Night City as well.",
        "<strong>09-04</strong> - More goodness to the site. Worked on a few things so far:",
        "&nbsp;* ACPA has custom weapon/component option to add to locations on the ACPA.",
        "&nbsp;* ACPA fixed a bug when removing components/weapons from a location.",
        "&nbsp;* ACPA fixed a bug with notes not being retained after typing.",
        "&nbsp;* ACPA has STR 18 chassis to choose. This is NOT cannon, but was requested.",
        "&nbsp;* ACPA now can create WADs (Working Assistant Droi...*Disney edit* Drones) for you robot/drone lovers. This was a major overhaul of the ACPA code base. But I got it working.",
        "&nbsp;* ACPA Generator you can load stock designs using the Search button. These includes most of the designs from the various sourcebooks.",
        "Again, coming join my Discord server. I welcome feedback and chat on Cyberpunk related topics. The link is in the menu above.",
        "Tales from the Forlorn Dopes pod/vod cast is going on. Wisdom 000 and I over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a> channel every 1st and 3rd Wednesday of the month. We start around 19:00 EST/18:00 CST/16:00 PST/00:00 GMT (which actually Thursday for those across the pond). We ramble on about Cyberpunk 2020, Cyberpunk Red, Cyberpunk 2077 and other Cyberpunk genre media like movies, TV servies, comics, anime, etc. Come join us. You can see old episodes on <a href=\"https://www.youtube.com/c/CybernationUncensored\">Cybernation Uncensored's Youtube Channel</a>.",
        "Till next time gatos.",
        "CYBER :D"
      ]
    },
    { "date": "2022-08",
      "entries": [
        "<strong>08-28</strong> - A couple of fixes made to the site this time.",
        "&nbsp;* Fixed a bug with random armor not setting all the locations properly on the combat tracker and character generator for Cyberpunk 2020",
        "&nbsp;* Add program details to the Datafort Designer for Cyberpunk 2020 so that you don't need to fill them out after you randomly generate a fort.",
        "&nbsp;* Add Drag/Drop funcationality to the Datafort Designer, so now you can drag the icons around and place them where you need to. There are still some glitches with it, but I would say it falls within the 90/10 rule of functionality.",
        "<strong>08-17</strong> - Not much going on with the site. Been concentrating on creating a Deep Space campaign centered around the O'Neil Two reovlt during the 4th Corporate war. That is an on going process as I flesh out the fluff in space.",
        "Here's a list of things I've done to the site so far this month:",
        "&nbsp;* Fixed a nasty bug in the NET Architect Generator for Cyberpunk Red. Switching a node type was deleting the parent nodes.",
        "&nbsp;* Fixed issues with editing and adding skills in Character Generator for Cyberpunk 2020. Should be a bit better on creating new skills. ",
        "&nbsp;* Add a new blueprint for a biotech research facility I used in my last campaign. Could still use some work, but quite detailed for a referee's needs.",
        "&nbsp;* Add a revision of the orbital map from Deep Space pg 7. Had some feedback on making a bit more accurate.",
        "&nbsp;* Also I wrote a short story about one of my characters/NPCs, A Night to Remember. You can download under DLow section and take a read. Hope you enjoy it. Special thanks to my wife, the super editor.",
        "Coming join my Discord server. I welcome feedback and chat on Cyberpunk related topics. Please join. The link is in the menu.",
        "Also  check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT (which actually Thursday for those across the pond). Wisdom 000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Cyberpunk Red, Cyberpunk 2077 and other Cyberpunk genre media like movies, TV servies, comics, anime, etc. Please check us out. You can see old episodes on <a href=\"https://www.youtube.com/c/CybernationUncensored\">Cybernation Uncensored's Youtube Channel</a>. Really would appreacite likes and comments to the vids so both Wisdom 000 and I know we have at least some fans out there :)",
        "See ya next month for more cyber goodness.",
        "CYBER :D"
      ]
    },
    {
      "date": "2022-07",
      "entries": [
        "<strong>07-31</strong> - One more for July. Not much this time other than fixing some UI issues on mobile views. There were a few sections and utilities that were rendering poorly on mobile devices. Most, if not all have been resolved.",
        "In other news, I'm making great progress on the Character Generator for Cyberpunk Red. Completed the stat section and skills section. I have also stubbed out a bunch of the sheet's other sections as well. Thanks for the patience on this, there is quite a bit of work to get done on the sheet. I am trying new things this time around, so the UX/UI will have some different looks compared to the CP2020 one.",
        "Again, getting feedback from eveyone on the Cybersmily's Datafort Discord. I have also posted a backlog list of things I have planned for the site if you want to see a sneak preview of things to come. It is still a small server, but slowly growing. I do have some channels to talk Cyberpunk and not just about the site. Please join. The link is in the menu.",
        "Lastly, please check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT (which actually Thursday for those across the pond). Wisdom 000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Cyberpunk Red, Cyberpunk 2077 and other Cyberpunk genre media like movies, TV servies, comics, anime, etc. Please check us out. You can see old episodes on <a href=\"https://www.youtube.com/c/CybernationUncensored\">Cybernation Uncensored's Youtube Channel</a>. Really would appreacite likes and comments to the vids so both Wisdom 000 and I know we have at least some fans out there :)",
        "See ya next month for more cyber goodness.",
        "CYBER :D",
        "<strong>07-24</strong> - More new things and fixes added to the site:",
        "&nbsp;* Gang Generator for Cyberpunk 2020/Cyberpunk Red. This utility will create gangs using Ocelot's gang generation system from back in the day. A shout out to Ocelot for allowing me to get this built. The utlity will also generate a gang name as well. You can save the results as a PDF as well.",
        "&nbsp;* Character Generator Cyberpunk 2020 add the <a href='https://cybersmily.net/mods/nr' alt='Cybersmily Datfort modified netrunning rules on this site.'>Quick Netrunner Rules</a> Program Modifier caculation if you use those rules. To enable this on the sheet you will need to go to the Settings (gear icon) and enable it.",
        "&nbsp;* Character Generator Cyberpunk 2020 fixed a bug with Cyberdeck in which you couldn't update the deck stats.",
        "&nbsp;* Character Generator Cyberpunk 2020 fixed a bug where apply damage to a cyberlimb location wasn't marking off sdp but wounds.",
        "&nbsp;* Character Generator Cyberpunk 2020 fixed a bug with LifeStyle groceries not being cached and getting lost.",
        "&nbsp;* Character Generator Cyberpunk 2020 added the functionality to add more utilities to housing.",
        "&nbsp;* Character Generator Cyberpunk 2020 cleaned up lifestyle housing and added functionality to set custom rent/mortgage cost.",
        "Progress is still being made on the Character Generator for Cyberpunk Red.",
        "I am getting great feedback from eveyone on the Cybersmily's Datafort Discord. I appreciate those of you providing me with bugs and ideas for the site. Please join by clicking the Discord icon in the menu bar. ",
         "Please check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Wisdom000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Red, and other Cyberpunk genre media. Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D",
        "<strong>07-17</strong> - The updates keep coming. This month we have bug fixes and some new stuff",
        "&nbsp;* Master Vehicle List is now live. This contains all the RTG vehicles that are cannon with Cyberpunk 2020. Some of the attributes are blank as per the source. I am still debating on whether to keep them that way or update them to be more inline with Max Metal stats. Thanks to Ikarius over on <a href='https://discord.gg/Jhy9Txx5hP'>Discord</a> for helping with this.",
        "&nbsp;* Character Generator Roles sections has been reworked, specifically on the skills. I remove the hard limit of selectable skills, change it to free for text box but will a hint displaying the skill that should be there as well as a type ahead search for adding skills.",
        "&nbsp;* Speaking of skills, the list has been update to be more inline with some other sources and removed redundancies. Thanks to Tekquest for assisting in the clean up.",
        "&nbsp;* Character Generator for Cyberpunk 2020 also has improved the notes section. There were issues with performance when typing in that section, hopefully you will see some improvements there.",
        "&nbsp;* Updated some of the Max Metal metadata in the Max Metal Calculator. Added Cyberwalk type and updated some of the source pages on equipment.",
        "&nbsp;* Fixed a bug in the ACPA Generator for the PDF where internal slots were duplicated to the external ones.",
        "&nbsp;* Added a few new Peeps that were NPCs in my game.",
        "I am still working on the Character Generator for Cyberpunk Red. I am making progress, slow, but some. It will be coming and just takes time to get things the way I want them. I am enjoying all the feedback I am getting on the Cybersmily's Datafort Discord. There has been some great things coming from the community. It is helping me and this site a lot to hear it all. If you are interested, please click the Discord icon in the menu bar. ",
        "Please check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Wisdom000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Red, and other Cyberpunk genre media. Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2022-06",
      "entries": [
        "<strong>06-19</strong> - Another release with some more goodness to the site!",
        "First I have created both a <a href='https://www.reddit.com/r/cybersmilydatafort/'>subreddit</a> and a <a href='https://discord.gg/Jhy9Txx5hP'>discord server</a> to help support my site's feedback and communication. Stop by either, I will be posting updates in both. The links are on the top right.",
        "Next we have enhancements:",
        "&nbsp;* A new look for the site. Please let me know if you prefer this or should I keep honing my design skills.",
        "&nbsp;* New Club Generator for Cyberpunk Red and 2020. Thanks to MurdocAddams from Reddit on provide some tables to base the utility on. Now randomly generate a bunch of bars, clubs, lounges, what have you for your game.",
        "&nbsp;* Corporation Master Data List. This list I plan on having both Cyberpunk 2020 and Cyberpunk Red corporations. It is a work in progress. If you see one that is missing please email me or contact me through Reddit or Discord. I just ask that you have the reference of what book mentioned it and the page.",
        "&nbsp;* Character Generator for Cyberpunk 2020 Ammo Section now has Casing and Type. So you can now get a brass cased AP rounds.",
        "&nbsp;* Bug fix on Character Generator where Cash wasn't always getting saved in cache.",
        "&nbsp;* Bug fix on Character Generator for Role Skills that are under Other not being marked properly.",
        "&nbsp;* Bug fix on Character Generator for Vehicles in which the Off-Road selection was mapped to Cost field.",
        "&nbsp;* Bug fix on Character Generator for Vehicles in which previous vehicle would remain after loading a new character.",
        "&nbsp;* Improved the nav bar on smaller screens.",
        "In the process of working on a Character Generator for Cyberpunk Red. I don't have an ETA on it yet, but it's coming.",
        "Please check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Wisdom000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Red, and other Cyberpunk genre media. Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2022-05",
      "entries": [
        "<strong>05-30</strong> - Some more enhancements in a few areas!",
        "&nbsp;* CP2020 Character Generator allows character images. You can upload an image to the sheet for a character profile. Recommended to keep it 250x250.",
        "&nbsp;* CP2020 Character Generator Section toggle. On the CP2020 Character Generator settings, you can choose which sections are visible or not. The PDF will include all sections for now.",
        "&nbsp;* More Guns is now in the same searchable lists as the Master Lists.",
        "&nbsp;* Fixer Contact Calc had a tweak to have only one streetdeal input.",
        "&nbsp;* Datafort Designer had some new layouts added to the random generator.",
        "<strong>05-25</strong> - There have been some bug fixes in parts of the site this month. Been a bit slow these past couple of months.",
        "The other update is the Master Gear List, which you can search on. I have also made all the data lists more consistent in appearance.",
        "Please check out The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Wisdom000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself ramble on about Cyberpunk 2020, Red, and other Cyberpunk genre media. Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2022-03",
      "entries": [
        "<strong>03-12</strong> - Did a bunch of bug fixes on the combat tracker and Cyberpunk 2020 character generator.",
        "One new thing is the Dating Generator for Cyberpunk Red. This was taken form R Talsorian's DLC last month; <a href='https://rtalsoriangames.com/wp-content/uploads/2022/02/RTG-CPR-DLC-DigitalDating.pdf' alt='Digital Dating in the Dark Future PDF'>Digital Dating in the Dark Future.</a>",
        "If you see any bugs or other issues please let me know. Either email me using the button above, or ping on Discord or Reddit, I lurk about most of the Cyberpunk boards.",
        "Again, like to remind you all that if you have sometime come check out Wisdom000 from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself where we host The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2022-02",
      "entries": [
        "<strong>02-05</strong> - Took some time off (finally bought Witcher 3 with both expansions :P). I got a few things done with the site.",
        "First up 3 requested enhancement items from the community:",
        "&nbsp;* Added SP/SDP tracker on the ACPA forms. Now you can use to help with combat if needed.",
        "&nbsp;* In the Cyberpunk 2020 character sheet you now have a setting to disable the Armor Layering function, in case my math is bad. Which it can be.",
        "&nbsp;* Added a field on the Cyberpunk 2020 sheet to show the BOD Damage Modifier (BDM).",
        "Here are some small other changes, mostly with the site style/layout, Cyberpunk 2020 Combat Tracker, and the CP2020 character generator:",
        "&nbsp;* Added a button left of top menu to collapse the full navigation to get your more content on the page.",
        "&nbsp;* Added a checkbox to suppress stat and save penalties from wound level. I know there is some cyberware and drugs that are capable of doing, so, there.",
        "&nbsp;* Added better turn management to the Combat Tracker.",
        "&nbsp;* Added Threat Code generations to the Combat Tracker. You can use that instead of using role or template.",
        "&nbsp;* Added collapse oppenent list for mobile devices to impove the UX on them.",
        "&nbsp;* Added more functionality in Combat Tracker opponent armor section.",
        "&nbsp;* Added martial art key attack to combat calculator for Cyberpunk 2020.",
        "&nbsp;* Fixed a bug in the Combat Tracker for random armor generation.",
        "&nbsp;* Changed the style/layout of the Combat Tracker to keep the Cyberpunk 2020 visually with it.",
        "&nbsp;* Fixed assorted bugs in the Combat Tracker.",
        "&nbsp;* Did some changes on the Identity section in the Cyberpunk 2020 Character Generator.",
        "&nbsp;* Changed the top nav bar so when clicking on the link the menu collapses. Really should have fixed that years ago...",
        "&nbsp;* Updated some layout issues and styling issue as part of an code framework I use (Angular/Bootstrap/etc.).",
        "If you see any bugs or other issues please let me know. Either email me using the button above, or ping on Discord or Reddit, I lurk about most of the Cyberpunk boards.",
        "Lastly, if you have sometime come check out Wisdom from <a href='http://datafortess2020.com'>Datafortress 2020</a> and myself where we host The Tales from the Forlorn Dopes over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. The schedule of every 1st and 3rd Wednesday of the month at 19:00 EST/18:00 CST/16:00 PST/00:00 GMT(which actually Thursday for those across the pond). Please check us out. You can see old episodes on Cybernation Uncensored's Youtube Channel",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-12",
      "entries": [
        "<strong>12-12</strong> - Closer and closer to the start of the shadow war, when Arasaka and Militech start to take off the gloves.",
        "Sup Gatos, me again with another installment to the site. There are a few things fixed and some new functionality here and there. There is a bunch of love going out to my Netrunners with 2 new things, a datafort designer and the master list of programs and decks for Cyberpunk 2020. Here's the break down:",
        "&nbsp;* Datafort Designer added. This utility is for creating dataforts for Cyberpunk 2020.",
        "&nbsp;* Master List - Programs and Master List - Cyberdecks for Cyberpunk 2020. Lookup and search for the netrunner goodies you crave.",
        "&nbsp;* Fixed bugs in combat tracker in where cyberware and armor was being replicated between opponent cards.",
        "&nbsp;* Removed the additional skinweave toggle on armor detail modal as well as when you click it, all locations are selected.",
        "&nbsp;* Fixed bug with General IP on the character generator for Cyberpunk 2020",
        "&nbsp;* As always, more WNS news items continue to be posted as my campaign starts to enter the Shadow War.",
        "&nbsp;* Combat zone is now isometric with a dash of color. It has about 27 different block layouts it will randomly select from. But, the height of the buildings is random so no two maps will be exactly alike.",
        "As always, if you have ideas for enhancements, bugs you've seen, or just want to shoot the shit. I love the feedback from the community. I'm on most of the cyberpunk discord servers as well as email me using the link on the nav bar above.",
        "The Tales from the Forlorn Dopes is on vacation this month, but we will return on January 19th over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a>. We will return to our normal schedule of every 1st and 3rd Wednesday of the month at 7PM EST. Please check us out.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-11",
      "entries": [
        "<strong>11-21</strong> - Been a few weeks. Been hammering away at some goodness for the the site.",
        "This release you now have a new app to start create ACPAs for your Cyberpunk games. Keep in mind it isn't perfect. There are a few rules not implement and descriptions and some text from the book wasn't included. Though the page number to find the details is listed. Trying to stay within the RTG homebrew rules.",
        "Another thing added was that you can now click on a location in the Armor table both in the Character Generator and the Combat Tracker for Cyberpunk 2020 and instead of doing armor damage, you can do damage to the character. This will take the damage done, the type of damage/ammo type it is, and the SP damage. Then it will calculate and apply the wounds to the character.",
        "<strong>11-01</strong> - The year is almost over. I was able to get a lot done. Not as much as last year, but how much more can I add ;-).",
        "This month we have a few things. I rewrote most of the armor/fashion stuff to have it integrated with the Character Generator for Cyberpunk 2020. That was massive to get it all done. But you will benefit.",
        "Also added Cyberdeck and Programs to the character generator as well. Now your Netrunner can start going hog wild with it.",
        "The only other thing from my list of enhancements from a poll I did is the Character generator for Cyberpunk Red. Again, not sure if I will be doing that as another team is working with R Talsorian on one already.",
        "That doesn't mean I have more things. Here are a few things I have planned:",
        "&nbsp;* ACPA generator from Maximum Metal was requested and I am start looking into that.",
        "&nbsp;* Data fort generator for Cyberpunk 2020.",
        "&nbsp;* Adding more master lists to the Data section.",
        "&nbsp;* Cyberanimal create from Chromebook 3",
        "&nbsp;* Borg create from Chromebook 2",
        "IF you have another ideas for enhancements, bugs you've come across, or just want to shoot the shit. I love the feedback from the community. I'm on most of the cyberpunk discord servers as well as email me using the link on the nav bar above.",
        "Also check me and Wisdom 000 (from Datafortress2020.com) over on <a href='https://www.twitch.tv/cybernationuncensored'>Cybernation Uncensored twitch</a> every 1st and 3rd Wednesday of the month. We talk Cyberpunk and other ramblings from old men. Please check us out.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-10",
      "entries": [
        "<strong>10-24</strong> - A few updates to various sections.",
        "&nbsp;* CP2020 Deck Manager - Fixed a bunch of bugs with this, mainly the issues around MU for published decks not reflected correctly.",
        "&nbsp;* CP2020 Char generator - magazine capacity can now be manually set if you want to make it unique (Thanks to Mikhail over on discord).",
        "&nbsp;* CP2020 Char generator - Ammo items can now be deleted in the ammo section. Thought I had one there, but apparently not. (Again, one from Mikhail).",
        "&nbsp;* CP2020 Char generator - Life Events can now have more data. Keep in mind too much data might have issues for the sticky data, but if you save the sheet to file, this shouldn't be a problemt (thank Mikhail for that).",
        "&nbsp;* CP2020 Char generator - Life Style housing bugs fixed. Should allow utility toggling and pay properly.",
        "&nbsp;* CP2020 Char generator - Life Style housing added a choice to own property instead of renting, just in case you character is luckly enough to own. (another one of Mikhail's)",
        "&nbsp;* CPRed Weather generator - fixed a bug with cold snap/heat weave durinig winter. Winters won't have 100+ degree days.",
        "<strong>10-11</strong> - Been on a bit of a hiatus. Real life pulled me in a few directions and took me longer to implement some of the changes with this release. Enjoy!",
        "&nbsp;* CP2020 Char generator - Implemented Secondary Roles. Now you can add more roles to the sheet. This section also allows you to select the role skills when there are choices.",
        "&nbsp;* CP2020 Char generator - Implemented IU Roles and Skills. There are still some automation needed, but it is a start. Blame Wisdom 000 for that.",
        "&nbsp;* CP2020 Char generator - Implemented Vehicle section. Now you can keep track of a character's vehicles.",
        "&nbsp;* CPRED Night Markets - Export Night Market results to PDF is available.",
        "&nbsp;* NEW! - Weather Generator for Cyberpunk Red.",
        "&nbsp;* Various bug fixes.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-08",
      "entries": [
        "<strong>08-31</strong> - Tackled some of my backlog with this release.",
        "&nbsp;* CP2020 Char generator - Implemented weapon options to help with modifying your weapon.",
        "&nbsp;* CP2020 Char generator - Implemented ammo section to keep track of what's available.",
        "&nbsp;* CP2020 Char generator - Implemented magazine manager for weapons.",
        "&nbsp;* CP2020 Combat Track - Fixed a bug where the target movement modifier was dupicating (Thanks to Andrey for that).",
        "<strong>08-01</strong> - This month starts off with the following:",
        "&nbsp;* Fixed a bug with the skills not aligning right in the CP2020 character generator.",
        "&nbsp;* Fixed verb tense in Headline generator and added some more terms.",
        "&nbsp;* the Core Lifepath generator for Cyberpunk Red is now available. Yes, it does role lifepaths and prints to PDF.",
        "&nbsp;* Gig WNS News gets update a few times in a month. These are news happening with my ongoing campaign set during the 4th Corporate war. Check them out.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-07",
      "entries": [
        "<strong>07-27</strong> - More stuff is here!",
        "Enhanced the Character Generator for Cyberpunk2020 skills section. Added quite a bit. First off you can add new skills to any of the attribute sections, just click on the + at the bottome of the section. Next you can click on the skill name and it will open a skill dialogue. In that window you'll be able to update the skill, set modifiers for the skill, delete skills, and it shows you how many IP are required for the next level. Did I also mention that Special Ability section has been improved as well? You can now add more special abilities, if you multi-role or gain some Family in your lifepath. Also I removed the hardcoding of the list creation and using the json file from the data section. Does this mean anything to you? If you have a blank sheet and don't see all the special abilities, available language/marital arts/expert options, etc. Just click the reset button for a new sheet. This doesn't impact existing characters I'm afraid.",
        "Fixed a bug with the armor calculations as well on the character generator. You all need to call me out when I do something silly like that :P. Another bug for armor was allowing more than 3 layers to be activated or adding more than 1 hard layer.  Finally, \"what's this below the SP row?\" you say? Well it is a place to capture SDP values now. It will track when the location becomes impaired/disabled and when it is destroyed with color and labels.",
        "Next I continued to work on the Deck Manager with a lookup of programs from Bartmoss' Brainware Blowout. Note that the MU and Costs vary a tad from the RAW for building programs. But don't think too much into it.",
        "Did some tweaks to the Lifepath generator for Cyberpunk Red, specifically added the core book charts.",
        "I know right about now you are asking yourself. \"This is waaaaayyyy too much for my brain to digest!\". Well buckle up buckaroos got some love for my boy Wisdom 000 with the Interlock Unlimited Combat Action system in the weapon section. Yup, I did some IU stuff to the character generator as well. Plan to include a couple more things as well for all you IU players.",
        "Finally (I mean it this time) is on the Character Generator you can expand/collapse each of the sections to allow better navigation/space on the page.",
        "Cyber keeps on rolling.",
        "CYBER :D",
        "<strong>07-15</strong> - Add a few random dice rolling within some of the CP2020 apps. Add a random generator for the Fixer Calculator to help out filling out quickly or give some ideas on what to add to them. Great for NPC fixers. Fashion calculator got some Randomized love as well. Now you can random roll a piece of clothing.",
        "Another app updated was the Deck Manager for Cyberpunk 2020. It now has a lookup for published cyberdecks from Bartmoss Brainware Blowout.",
        "The above were on whim to implement. There is a list that is out there that I still need to work on.",
        "&nbsp;* Weapon Builder for CP2020",
        "&nbsp;* Vehicle section on Character generator for CP2020",
        "&nbsp;* Integrate the fashion calculator with the Character Generator for CP2020",
        "&nbsp;* Character Generator for CP Red",
        "&nbsp;* Cyberdeck Manager inserted into the Character generator",
        "&nbsp;* Finally, create and extending a LifePath generator for CP Red",
        "Quite a few things in the list. I have started on the weapon builder, just thinking through the design of it and how it will interaction with the character sheet. Things like how the modifiers should be applied etc. I will pick it up soon",
        "Oh, and I'm currently working with Octarine5orcerer with his Foundry module for Cyberpunk 2020. Haven't contributed much. Go check it out <a href='https://github.com/OctarineSourcerer/cyberpunk2020'>HERE</a>",
        "<strong>07-08</strong> - This installment I did some bug fixes. The main thing is I have added 2 new generators to the site for CyberPunk Red, Bodegas Generator and Vendit Generator. I add them to the same page that has the Night Market. Go check them out. Also, as usual, I have added some new WNS news items as my Cyberpunk 2020 campaign contines.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-06",
      "entries": [
        "<strong>06-05</strong> - Another release. I know... so soon. This wasn't too much of a biggie. It's a Night Market generator for Cyberpunk Red. Nothing too complex but something I know people are looking for. This was the second item in that Poll I did.",
        "In other news me and Wisdom 000 from <a href='https://datafortress2020.com'>Datafortress 2020</a> are continuing our broadcast over on <a href='https://www.twitch.tv/cyberpunkuncensored'>Cyberpunk Uncensored Twitch</a> channel every other Tuesday. We've complete our assessment of Cyberpunk 2077 and a 2 part review of Cyberpunk Red. Come check us out we air 7PM EDT/6PM CDT/4PM PDT. Also I'm in a game with Reservoir Panda again being hosted on CP Uncensored Twitch Sundays. Though Technical issues have been causing a slow start to that campaign.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-05",
      "entries": [
        "<strong>05-30</strong> - Major update to the Character Generator for CyberPunk 2020, LifeStyle sectoin. This section will allow you to track the character's money, expenses, and identities. This also has a calculator for spending on entertainment and one off services. I want to thank all of the people over on the Datafortress 2020 Facebook group for voting on it and thanks to Wisdom 000 for hosting the poll. That poll I did also gave me clarity on some other new apps/features to add to the site. I will be doing other polls in the coming months as well. My next app to tackle will be a Night Market generator, which was in second place.",
        "Also this release I fixed some bugs in a few areas of the site. One major area was the pdf generation of Character Generator for Cyberpunk 2020. That had a few issues and I cleared up most of them. If you see any bugs, please let me know by clicking on the email icon in the upper right corner.",
        "Lastly, thank you everyone who continues to use this site. I have seen may comments in various social outlets letting me know that my work is appreciated. This site is a work of passion for me and glad to know that others enjoy it. Thank you.",
        "Till next time.",
        "CYBER :D",
        "<strong>05-09</strong> - Fix some major bugs this week with the Red Net Arch generator and the CP2020 character generator.",
        "Speaking of Characer Generator for Cyberpunk 2020, I am/will be doing a major overhaul of it. Posted a poll to hear what people would like to see next on the site. I have prioritize what features and apps will be happeing to the site in the coming months. One at the top of the list is to add some new sections into the CP2020 Character Generator. Fo that I needed to do a pit of redesign. Here's what was done so far:",
        "&nbsp;* Remove the area where an image would be place. Reason I never implemented was I didn't have a place to store images for you and I won't allow an external link onto the site (for reasons).",
        "&nbsp;* Moved the armor/wound sections to where the image use to be.",
        "&nbsp;* Moved Rep out of the skill section and to be under Roles and implemented a dice roller for it.",
        "&nbsp;* Moved Humanity out of the skill sectoin and now resides with the other derived stats.",
        "&nbsp;* Skill Section reworked.",
        "&nbsp;* &nbsp;* Move general IP to section header",
        "&nbsp;* &nbsp;* Removed Rep and Humanity per above",
        "&nbsp;* &nbsp;* Layout of skills is now based on STAT sections and follows a top-down right-left sorting for each section.",
        "&nbsp;* &nbsp;* Increased the font size of skills",
        "&nbsp;* &nbsp;* Removed the Cyberware to its own section.",
        "&nbsp;* Reoganized the LifePath, Gear and Weapon Section to be their own sections.",
        "&nbsp;* Weapon section added Range and Cost columns when viewed on full screen of a desktop/laptop",
        "&nbsp;* Cyberware section other than being moved, nothing much has changed.",
        "&nbsp;* Gear section had a bit of work don",
        "&nbsp;* &nbsp;* Moved to its own section",
        "&nbsp;* &nbsp;* Layout is mutliple columns on large screens",
        "&nbsp;* &nbsp;* Add DELETE button to remove a row if needed",
        "&nbsp;* &nbsp;* Add ADD button to add more rows if needed",
        "&nbsp;* LifePath got a bit of love",
        "&nbsp;* &nbsp;* Moved to its own section",
        "&nbsp;* &nbsp;* Change layout so events are in another column on large screens",
        "&nbsp;* &nbsp;* Change layout move the dice, source selection, always an event option, and input years to section header",
        "&nbsp;* &nbsp;* Add section for Siblings to have some more info about each of them, like are they older/younger, like/hate you, their names, etc.",
        "&nbsp;* &nbsp;* Add an ADD button to the siblings to add more",
        "&nbsp;* &nbsp;* Add a DELETE button to the siblings for in case you added one by mistake",
        "&nbsp;* &nbsp;* Add an ADD button to Life Events section to add more events as needed.",
        "&nbsp;* &nbsp;* Add a DELET button the life events to remove ones you don't need. Note: this won't relabel a year. Need to do that manually for now.",
        "&nbsp;* ",
        "<strong>05-05</strong> - Small update to the Quick Netrunner Rules I have.",
        "After some playtesting recently with the rules (which I wrote 20+years ago), I needed to update them a bit. Significant changes is the calculation of the Program Modifier, which I reworked to allow a super runner to crack into the most secured DataFort. I also update some of the tables as some of the results didn't make sense.",
        "<strong>05-01</strong> - More bug fixes and small tweaks:",
        "&nbsp;* Fixed an issues on NET Architect for Cyberpunk Red. Nodes didn't match the keys.",
        "&nbsp;* Small tweaks to NET Architect to allow you to choose programs to add",
        "&nbsp;* Cosmetic changes to NET Architect",
        "&nbsp;* cosmetic tweaks to the Drug Lab Calc.",
        "&nbsp;* cosmetic tweaks to the Combat Zone Generator.",
        "&nbsp;* cosmetic tweaks to the Fashion Generator.",
        "&nbsp;* cosmetic tweaks to headline generator",
        "&nbsp;* cosmetic tweaks to Fixer Calc",
        "&nbsp;* cosmetic tweaks to deck manager",
        "&nbsp;* cosmetic tweaks to CP Red Jumpstart Kit generator",
        "&nbsp;* cosmetic tweaks to CPJK Lifepath generator",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-04",
      "entries": [
        "<strong>04-25</strong> - A new app and more bug fixes:",
        "&nbsp;* Fixed some issues on CP2020 character generator for skills.",
        "&nbsp;* News Headline Generator app for both CP2020 and CP Red (look under Apps)",
        "&nbsp;* Updated CP 2020 Lifepath Generator with dice icons instead of text buttons",
        "&nbsp;* Integrated Interlock Unlimited stuff into CP2020 Lifepath sources/options (<a href='https://datafortress2020.com' target='_blank'>Datafortress 2020 IU</a>):",
        "&nbsp;&nbsp;&nbsp;- African Sourcebook family background charts ",
        "&nbsp;&nbsp;&nbsp;- Central/South American Sourcebook family background charts ",
        "&nbsp;&nbsp;&nbsp;- Extended clothes, hairstyles, and affectation charts ",
        "<strong>04-17</strong> - Wow April has been productive for ths site. Done some clean up on the site. Here's the list:",
        "&nbsp;* behind the scenes code refactoring to make my life easier.",
        "&nbsp;* updating the CP 2020 Character Generator with more instructions on how to use.",
        "&nbsp;* updating the CP 2020 Character Generator armor section with an icon button instead of text button.",
        "&nbsp;* CP 2020 Character Generator and Combat tracker had some rework on the weapon list. Now there are some settings for random rolls. You can chose the type, subtype, availability and exclusion of names.",
        "&nbsp;* CP 2020 Combat tracker bug fixes (initiative on individual opponents not working, as well as some other minor ones.)",
        "I want to thank Maysatron over on Discord for suggesting the configuring of the weapon random generator as well as some other ideas.",
        "So what's ahead? Looking to get the cyberware list into the combat tracker, add a randomizer for armor on both the character generator and combtat tracker, looking to enhance the Red NET architect tool a bit more, and a few other things (like standardize the menu icons for all apps).",
        "Lastly, I am thinking of creating some tutorial videos for the site in case the interface isn't as intuitive as I think it is. Would love to hear from all of you if this is a good idea or not.",
        "<strong>04-10</strong> - Major update to the NET Arch generator for Cyberpunk Red. Got inspired/motivated by Dante The Badger over on Discord for his tool he created. Here's the list:",
        "&nbsp;* Export to PNG format now.",
        "&nbsp;* Add/Delete floors and branches. NOTE: Adding a new floor will always be a file, but you can change it after it is created. Also when adding floors manually there is no constraint to have multiple bottom levels. That is something that you need to manually keep track of.",
        "&nbsp;* Color configuration for the icons, borders, text, and can be done on individual floors.",
        "&nbsp;* Has the constraints for creating an arch (reroll programs/passwords, max controllers allowed, can't branch on first 2 floors, minimum of 3 floors...).",
        "&nbsp;* Specifies the program names now (doesn't have their all their detes, you need to look in the core book for them.).",
        "&nbsp;* Calculates the total cost (cost per floor and each floor value set).",
        "There is still a bunch of manually work to do done when you create your own, but this tool should help you",
        "There is a infrequent bug with rendering, but it isn't too bad all things considerd.",
        "I still have qutie a bit left to do (adding demons...). Still don't have a PDF button, but you can use Chrome/Edge to do a print as PDF. The page should be formatted to remove the non-related elements on the page.",
        "<strong>04-01</strong> - Updated parts of the site that didn't adhere to the <a href='https://rtalsoriangames.com/homebrew-content-policy/'>R Talsorian Hombrew Policy</a>.",
        "Combat Tracker - remove the stats pulled from the source books for the templates. Added generic gangers and security guards. More will be added in the future.",
        "Combat Zone Generator - summarized the entries a bit more and corrected some mispellings. ",
        "In other News, Wisdom of <a href='https://datafortress2020.com'>Datafortress 2020</a> and I are doing a twitch show. We are aiming to do it every other week on the <a href='https://www.twitch.tv/cyberpunkuncensored'>Cyberpunk Uncensored Twitch channel</a>. We currently are giving our review of Cyberpunk 2077, but more reviews and other topics will be talked about. We would love for you to check it out.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-02",
      "entries": [
        "<strong>02-21</strong> - Another month into 2021 when the 4th Corporate War starts heating up. However seems that everyone is freezing ;). This is another update to the site with 2 new things: Red Net Architect Generator and a bunch of news reports from WNS 7 News Force team over in Gigs.",
        "The Red Net Architect Generator will create a architect for you. This will be a base structure using the rules from Cyberpunk Red main book. I didn't add specific programs into some of the slot and allow you to fill in as needed. You can alter each node, save the architect and load it later.",
        "The WNS 7 News Reports are catching up on events in my campaign, which is gooing great. The team is on the hunt for an AI with the 4th corporate war as a backdrop.",
        "Lastly I just attended TotalCon this year viritually. I was able to get into 2 Red games, both GMed by RTG, one by J Gray and the other was Jay Parker. I had a great time in both. Kudos to them!",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-01",
      "entries": [
        "<strong>01-10</strong> - Hi all. No real updates to the site. Just wanted to post on where I'm at and what's in store. As you may have guest, I've been playing the hell out of Cyberpunk 2077. 2 play throughs with a couple hundred game play hours. By the neon light of the chrome gods have I been having a blast.",
        "I know, I know there has been a lot of flak the game has been gotten. Yes, there are plenty of bugs, but they have not caused me much pain. Luckily, I waited to upgrade my machine specifically for this game. My PC was about 7 years old and way past my usually upgrade period. But I want to make sure that I had the best machine I could for this game.",
        "This game nailed Cyberpunk 2020/Red. The city is brought to life. The neon lights, the scale of the city, and the outlying badlands all gave a vivid reality to Night City and the surrounding area. The city noise and NPCs talking and having conversation add ontop was fantastic.",
        "The stories (main and side missions) are amazing. I never really connect with many RPG computer games, but this one really brought the emersion up tenfold for me. Many say doing it in first person does not bring you into the game. I say fake news on that! For me, the experience of first person brought be deeper into the game to the point I care about the decisions I made and the interactions with the NPCs brough emotion attachment to them and V. If you have not play it yet, beware, there are some dialog choices in the game which can make you miss out of some key moments that made the game. Also, there is a way to play through main quests. On both play I saved some of the main quests for later and then realized that some of those spawn side missions that would not appear until a day or 2 passed in the game. For my netrunner it was a major issue as I had nothing to do while waiting. Just skipped time until the side mission would pop up.",
        "The combat (gun/melee) was good as well as the stealthing around. Hacking was a bit OP'd once you got to a certain level. A lot of missions done as a netrunner were trivial as you can take out almost all the enemies simply through hacking the security system and frying all enemies while hidden away from any retailation. It had some fun moments, but definitely wasn't the best experience compared to my pistol wielding solo",
        "Some of the criticisms about the game aren't wrong. Besides the bugs and clipping issues, driving could be improved. Opponent AI need some tweaking, especially with some of the boss fights (Adam Smasher to me on both play throughs was not much of challenge even on very hard settings, while the beat the brats were ridiculously OP'd). I really think it is bad analysis to compare this state-of-the-art game based on how it runs on machine 5+ years old. 'But they promised it would work...'. Please. I would upgrade my PC every 2 years (swapping out RAM, Video cards, processors, etc) so I could get the best experience from games. And no, I didn’t make good money at the time either.",
        "Also comparing Cyberpunk 2077 to other games that are on higher iteration is naive (really, you are going to compare the 4th installment of a game with CP2077 1? How about compare it to first installement of that game, then let us talk). Some of this criticism really got to me. The gamers send death threats to CDPR for not releasing the game, then they send death threats when it is released. The vocal gaming critics are mostly a bunch of wannabe who have little to no talent or abilities and hide it by bitching and crying about others who do. There are too many privelged people in this world, especially in the gaming community. I think the real culprit is the over hype. If a product gets too much hype it is doomed for failure. Why? Because people will grow an animosity to that thing just because. Seen it with other games, movies, TV series, etc.",
        "Anyways, I completely recommend this game for any Cyberpunk 2020/Red fans. It is a MUST play as Night City becomes a live.",
        "Ok, done with my view on Cyberpunk 2077 onto what is in store this year for the site. I am currently working on ideas for Red. Right now, I am working on a Net Architecutre generator. This will randomly generate a data pool for your game. Since RTG wants to avoid using straight out of the book charts, this will be a bit generic.",
        "Stay safe gatos. The dark future is upon us!",
        "CYBER :D"
      ]
    }
  ]
}
