{
  "news": [
    { "date":"2021-10",
      "entries":[
        "<strong>10-??</strong> - Been on a bit of a hiatus. Real life pulled me in a few directions and took me longer to implement some of the changes with this release. Enjoy!",
        "&nbsp;* CP2020 Char generator - Implemented Secondary Roles. Now you can add more roles to the sheet. This section also allows you to select the role skills when there are choices.",
        "&nbsp;* CP2020 Char generator - Implemented IU Roles and Skills. There are still some automation needed, but it is a start. Blame Wisdom 000 for that.",
        "&nbsp;* CP2020 Char generator - Implemented Vehicle section. Now you can keep track of a character's vehicles.",
        "&nbsp;* CP2020 Char generator - Implemented magazine manager for weapons.",
        "&nbsp;* CPRED Night Markets - Export Night Market results to PDF is available.",
        "&nbsp;* NEW! - Weather Generator for Cyberpunk Red.",
        "&nbsp;* Various bug fixes.",
        "Till next time.",
        "CYBER :D"
    ]},
    { "date":"2021-08",
      "entries":[
        "<strong>08-31</strong> - Tackled some of my backlog with this release.",
        "&nbsp;* CP2020 Char generator - Implemented weapon options to help with modifying your weapon.",
        "&nbsp;* CP2020 Char generator - Implemented ammo section to keep track of what's available.",
        "&nbsp;* CP2020 Char generator - Implemented magazine manager for weapons.",
        "&nbsp;* CP2020 Combat Track - Fixed a bug where the target movement modifier was dupicating (Thanks to Andrey for that).",
        "<strong>08-01</strong> - This month starts off with the following:",
        "&nbsp;* Fixed a bug with the skills not aligning right in the CP2020 character generator.",
        "&nbsp;* Fixed verb tense in Headline generator and added some more terms.",
        "&nbsp;* the Core Lifepath generator for Cyberpunk Red is now available. Yes, it does role lifepaths and prints to PDF.",
        "&nbsp;* Gig WNS News gets update a few times in a month. These are news happening with my ongoing campaign set during the 4th Corporate war. Check them out.",
        "Till next time.",
        "CYBER :D"
    ]},
    { "date":"2021-07",
      "entries":[
        "<strong>07-27</strong> - More stuff is here!",
        "Enhanced the Character Generator for Cyberpunk2020 skills section. Added quite a bit. First off you can add new skills to any of the attribute sections, just click on the + at the bottome of the section. Next you can click on the skill name and it will open a skill dialogue. In that window you'll be able to update the skill, set modifiers for the skill, delete skills, and it shows you how many IP are required for the next level. Did I also mention that Special Ability section has been improved as well? You can now add more special abilities, if you multi-role or gain some Family in your lifepath. Also I removed the hardcoding of the list creation and using the json file from the data section. Does this mean anything to you? If you have a blank sheet and don't see all the special abilities, available language/marital arts/expert options, etc. Just click the reset button for a new sheet. This doesn't impact existing characters I'm afraid.",
        "Fixed a bug with the armor calculations as well on the character generator. You all need to call me out when I do something silly like that :P. Another bug for armor was allowing more than 3 layers to be activated or adding more than 1 hard layer.  Finally, \"what's this below the SP row?\" you say? Well it is a place to capture SDP values now. It will track when the location becomes impaired/disabled and when it is destroyed with color and labels.",
        "Next I continued to work on the Deck Manager with a lookup of programs from Bartmoss' Brainware Blowout. Note that the MU and Costs vary a tad from the RAW for building programs. But don't think too much into it.",
        "Did some tweaks to the Lifepath generator for Cyberpunk Red, specifically added the core book charts.",
        "I know right about now you are asking yourself. \"This is waaaaayyyy too much for my brain to digest!\". Well buckle up buckaroos got some love for my boy Wisdom 000 with the Interlock Unlimited Combat Action system in the weapon section. Yup, I did some IU stuff to the character generator as well. Plan to include a couple more things as well for all you IU players.",
        "Finally (I mean it this time) is on the Character Generator you can expand/collapse each of the sections to allow better navigation/space on the page.",
        "Cyber keeps on rolling.",
        "CYBER :D",
        "<strong>07-15</strong> - Add a few random dice rolling within some of the CP2020 apps. Add a random generator for the Fixer Calculator to help out filling out quickly or give some ideas on what to add to them. Great for NPC fixers. Fashion calculator got some Randomized love as well. Now you can random roll a piece of clothing.",
        "Another app updated was the Deck Manager for Cyberpunk 2020. It now has a lookup for published cyberdecks from Bartmoss Brainware Blowout.",
        "The above were on whim to implement. There is a list that is out there that I still need to work on.",
        "&nbsp;* Weapon Builder for CP2020",
        "&nbsp;* Vehicle section on Character generator for CP2020",
        "&nbsp;* Integrate the fashion calculator with the Character Generator for CP2020",
        "&nbsp;* Character Generator for CP Red",
        "&nbsp;* Cyberdeck Manager inserted into the Character generator",
        "&nbsp;* Finally, create and extending a LifePath generator for CP Red",
        "Quite a few things in the list. I have started on the weapon builder, just thinking through the design of it and how it will interaction with the character sheet. Things like how the modifiers should be applied etc. I will pick it up soon",
        "Oh, and I'm currently working with Octarine5orcerer with his Foundry module for Cyberpunk 2020. Haven't contributed much. Go check it out <a href='https://github.com/OctarineSourcerer/cyberpunk2020'>HERE</a>",
        "<strong>07-08</strong> - This installment I did some bug fixes. The main thing is I have added 2 new generators to the site for CyberPunk Red, Bodegas Generator and Vendit Generator. I add them to the same page that has the Night Market. Go check them out. Also, as usual, I have added some new WNS news items as my Cyberpunk 2020 campaign contines.",
        "Till next time.",
        "CYBER :D"
    ]},
    { "date":"2021-06",
      "entries":[
        "<strong>06-05</strong> - Another release. I know... so soon. This wasn't too much of a biggie. It's a Night Market generator for Cyberpunk Red. Nothing too complex but something I know people are looking for. This was the second item in that Poll I did.",
        "In other news me and Wisdom 000 from <a href='https://datafortress2020.com'>Datafortress 2020</a> are continuing our broadcast over on <a href='https://www.twitch.tv/cyberpunkuncensored'>Cyberpunk Uncensored Twitch</a> channel every other Tuesday. We've complete our assessment of Cyberpunk 2077 and a 2 part review of Cyberpunk Red. Come check us out we air 7PM EDT/6PM CDT/4PM PDT. Also I'm in a game with Reservoir Panda again being hosted on CP Uncensored Twitch Sundays. Though Technical issues have been causing a slow start to that campaign.",
        "Till next time.",
        "CYBER :D"
    ]},
    {
      "date": "2021-05",
      "entries": [
        "<strong>05-30</strong> - Major update to the Character Generator for CyberPunk 2020, LifeStyle sectoin. This section will allow you to track the character's money, expenses, and identities. This also has a calculator for spending on entertainment and one off services. I want to thank all of the people over on the Datafortress 2020 Facebook group for voting on it and thanks to Wisdom 000 for hosting the poll. That poll I did also gave me clarity on some other new apps/features to add to the site. I will be doing other polls in the coming months as well. My next app to tackle will be a Night Market generator, which was in second place.",
        "Also this release I fixed some bugs in a few areas of the site. One major area was the pdf generation of Character Generator for Cyberpunk 2020. That had a few issues and I cleared up most of them. If you see any bugs, please let me know by clicking on the email icon in the upper right corner.",
        "Lastly, thank you everyone who continues to use this site. I have seen may comments in various social outlets letting me know that my work is appreciated. This site is a work of passion for me and glad to know that others enjoy it. Thank you.",
        "Till next time.",
        "CYBER :D",
        "<strong>05-09</strong> - Fix some major bugs this week with the Red Net Arch generator and the CP2020 character generator.",
              "Speaking of Characer Generator for Cyberpunk 2020, I am/will be doing a major overhaul of it. Posted a poll to hear what people would like to see next on the site. I have prioritize what features and apps will be happeing to the site in the coming months. One at the top of the list is to add some new sections into the CP2020 Character Generator. Fo that I needed to do a pit of redesign. Here's what was done so far:",
              "&nbsp;* Remove the area where an image would be place. Reason I never implemented was I didn't have a place to store images for you and I won't allow an external link onto the site (for reasons).",
              "&nbsp;* Moved the armor/wound sections to where the image use to be.",
              "&nbsp;* Moved Rep out of the skill section and to be under Roles and implemented a dice roller for it.",
              "&nbsp;* Moved Humanity out of the skill sectoin and now resides with the other derived stats.",
              "&nbsp;* Skill Section reworked.",
              "&nbsp;* &nbsp;* Move general IP to section header",
              "&nbsp;* &nbsp;* Removed Rep and Humanity per above",
              "&nbsp;* &nbsp;* Layout of skills is now based on STAT sections and follows a top-down right-left sorting for each section.",
              "&nbsp;* &nbsp;* Increased the font size of skills",
              "&nbsp;* &nbsp;* Removed the Cyberware to its own section.",
              "&nbsp;* Reoganized the LifePath, Gear and Weapon Section to be their own sections.",
              "&nbsp;* Weapon section added Range and Cost columns when viewed on full screen of a desktop/laptop",
              "&nbsp;* Cyberware section other than being moved, nothing much has changed.",
              "&nbsp;* Gear section had a bit of work don",
              "&nbsp;* &nbsp;* Moved to its own section",
              "&nbsp;* &nbsp;* Layout is mutliple columns on large screens",
              "&nbsp;* &nbsp;* Add DELETE button to remove a row if needed",
              "&nbsp;* &nbsp;* Add ADD button to add more rows if needed",
              "&nbsp;* LifePath got a bit of love",
              "&nbsp;* &nbsp;* Moved to its own section",
              "&nbsp;* &nbsp;* Change layout so events are in another column on large screens",
              "&nbsp;* &nbsp;* Change layout move the dice, source selection, always an event option, and input years to section header",
              "&nbsp;* &nbsp;* Add section for Siblings to have some more info about each of them, like are they older/younger, like/hate you, their names, etc.",
              "&nbsp;* &nbsp;* Add an ADD button to the siblings to add more",
              "&nbsp;* &nbsp;* Add a DELETE button to the siblings for in case you added one by mistake",
              "&nbsp;* &nbsp;* Add an ADD button to Life Events section to add more events as needed.",
              "&nbsp;* &nbsp;* Add a DELET button the life events to remove ones you don't need. Note: this won't relabel a year. Need to do that manually for now.",
              "&nbsp;* ",
             "<strong>05-05</strong> - Small update to the Quick Netrunner Rules I have.",
        "After some playtesting recently with the rules (which I wrote 20+years ago), I needed to update them a bit. Significant changes is the calculation of the Program Modifier, which I reworked to allow a super runner to crack into the most secured DataFort. I also update some of the tables as some of the results didn't make sense.",
        "<strong>05-01</strong> - More bug fixes and small tweaks:",
        "&nbsp;* Fixed an issues on NET Architect for Cyberpunk Red. Nodes didn't match the keys.",
        "&nbsp;* Small tweaks to NET Architect to allow you to choose programs to add",
        "&nbsp;* Cosmetic changes to NET Architect",
        "&nbsp;* cosmetic tweaks to the Drug Lab Calc.",
        "&nbsp;* cosmetic tweaks to the Combat Zone Generator.",
        "&nbsp;* cosmetic tweaks to the Fashion Generator.",
        "&nbsp;* cosmetic tweaks to headline generator",
        "&nbsp;* cosmetic tweaks to Fixer Calc",
        "&nbsp;* cosmetic tweaks to deck manager",
        "&nbsp;* cosmetic tweaks to CP Red Jumpstart Kit generator",
        "&nbsp;* cosmetic tweaks to CPJK Lifepath generator",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-04",
      "entries": [
        "<strong>04-25</strong> - A new app and more bug fixes:",
        "&nbsp;* Fixed some issues on CP2020 character generator for skills.",
        "&nbsp;* News Headline Generator app for both CP2020 and CP Red (look under Apps)",
        "&nbsp;* Updated CP 2020 Lifepath Generator with dice icons instead of text buttons",
        "&nbsp;* Integrated Interlock Unlimited stuff into CP2020 Lifepath sources/options (<a href='https://datafortress2020.com' target='_blank'>Datafortress 2020 IU</a>):",
        "&nbsp;&nbsp;&nbsp;- African Sourcebook family background charts ",
        "&nbsp;&nbsp;&nbsp;- Central/South American Sourcebook family background charts ",
        "&nbsp;&nbsp;&nbsp;- Extended clothes, hairstyles, and affectation charts ",
        "<strong>04-17</strong> - Wow April has been productive for ths site. Done some clean up on the site. Here's the list:",
        "&nbsp;* behind the scenes code refactoring to make my life easier.",
        "&nbsp;* updating the CP 2020 Character Generator with more instructions on how to use.",
        "&nbsp;* updating the CP 2020 Character Generator armor section with an icon button instead of text button.",
        "&nbsp;* CP 2020 Character Generator and Combat tracker had some rework on the weapon list. Now there are some settings for random rolls. You can chose the type, subtype, availability and exclusion of names.",
        "&nbsp;* CP 2020 Combat tracker bug fixes (initiative on individual opponents not working, as well as some other minor ones.)",
        "I want to thank Maysatron over on Discord for suggesting the configuring of the weapon random generator as well as some other ideas.",
        "So what's ahead? Looking to get the cyberware list into the combat tracker, add a randomizer for armor on both the character generator and combtat tracker, looking to enhance the Red NET architect tool a bit more, and a few other things (like standardize the menu icons for all apps).",
        "Lastly, I am thinking of creating some tutorial videos for the site in case the interface isn't as intuitive as I think it is. Would love to hear from all of you if this is a good idea or not.",
        "<strong>04-10</strong> - Major update to the NET Arch generator for Cyberpunk Red. Got inspired/motivated by Dante The Badger over on Discord for his tool he created. Here's the list:",
        "&nbsp;* Export to PNG format now.",
        "&nbsp;* Add/Delete floors and branches. NOTE: Adding a new floor will always be a file, but you can change it after it is created. Also when adding floors manually there is no constraint to have multiple bottom levels. That is something that you need to manually keep track of.",
        "&nbsp;* Color configuration for the icons, borders, text, and can be done on individual floors.",
        "&nbsp;* Has the constraints for creating an arch (reroll programs/passwords, max controllers allowed, can't branch on first 2 floors, minimum of 3 floors...).",
        "&nbsp;* Specifies the program names now (doesn't have their all their detes, you need to look in the core book for them.).",
        "&nbsp;* Calculates the total cost (cost per floor and each floor value set).",
        "There is still a bunch of manually work to do done when you create your own, but this tool should help you",
        "There is a infrequent bug with rendering, but it isn't too bad all things considerd.",
        "I still have qutie a bit left to do (adding demons...). Still don't have a PDF button, but you can use Chrome/Edge to do a print as PDF. The page should be formatted to remove the non-related elements on the page.",
        "<strong>04-01</strong> - Updated parts of the site that didn't adhere to the <a href='https://rtalsoriangames.com/homebrew-content-policy/'>R Talsorian Hombrew Policy</a>.",
        "Combat Tracker - remove the stats pulled from the source books for the templates. Added generic gangers and security guards. More will be added in the future.",
        "Combat Zone Generator - summarized the entries a bit more and corrected some mispellings. ",
        "In other News, Wisdom of <a href='https://datafortress2020.com'>Datafortress 2020</a> and I are doing a twitch show. We are aiming to do it every other week on the <a href='https://www.twitch.tv/cyberpunkuncensored'>Cyberpunk Uncensored Twitch channel</a>. We currently are giving our review of Cyberpunk 2077, but more reviews and other topics will be talked about. We would love for you to check it out.",
        "Till next time.",
        "CYBER :D"
      ]
    },
    {
      "date": "2021-02",
      "entries": [
        "<strong>02-21</strong> - Another month into 2021 when the 4th Corporate War starts heating up. However seems that everyone is freezing ;). This is another update to the site with 2 new things: Red Net Architect Generator and a bunch of news reports from WNS 7 News Force team over in Gigs.",
        "The Red Net Architect Generator will create a architect for you. This will be a base structure using the rules from Cyberpunk Red main book. I didn't add specific programs into some of the slot and allow you to fill in as needed. You can alter each node, save the architect and load it later.",
        "The WNS 7 News Reports are catching up on events in my campaign, which is gooing great. The team is on the hunt for an AI with the 4th corporate war as a backdrop.",
        "Lastly I just attended TotalCon this year viritually. I was able to get into 2 Red games, both GMed by RTG, one by J Gray and the other was Jay Parker. I had a great time in both. Kudos to them!",
        "Till next time.",
        "CYBER :D"

      ]
    },
    {
      "date": "2021-01",
      "entries": [
        "<strong>01-10</strong> - Hi all. No real updates to the site. Just wanted to post on where I'm at and what's in store. As you may have guest, I've been playing the hell out of Cyberpunk 2077. 2 play throughs with a couple hundred game play hours. By the neon light of the chrome gods have I been having a blast.",
        "I know, I know there has been a lot of flak the game has been gotten. Yes, there are plenty of bugs, but they have not caused me much pain. Luckily, I waited to upgrade my machine specifically for this game. My PC was about 7 years old and way past my usually upgrade period. But I want to make sure that I had the best machine I could for this game.",
        "This game nailed Cyberpunk 2020/Red. The city is brought to life. The neon lights, the scale of the city, and the outlying badlands all gave a vivid reality to Night City and the surrounding area. The city noise and NPCs talking and having conversation add ontop was fantastic.",
        "The stories (main and side missions) are amazing. I never really connect with many RPG computer games, but this one really brought the emersion up tenfold for me. Many say doing it in first person does not bring you into the game. I say fake news on that! For me, the experience of first person brought be deeper into the game to the point I care about the decisions I made and the interactions with the NPCs brough emotion attachment to them and V. If you have not play it yet, beware, there are some dialog choices in the game which can make you miss out of some key moments that made the game. Also, there is a way to play through main quests. On both play I saved some of the main quests for later and then realized that some of those spawn side missions that would not appear until a day or 2 passed in the game. For my netrunner it was a major issue as I had nothing to do while waiting. Just skipped time until the side mission would pop up.",
        "The combat (gun/melee) was good as well as the stealthing around. Hacking was a bit OP'd once you got to a certain level. A lot of missions done as a netrunner were trivial as you can take out almost all the enemies simply through hacking the security system and frying all enemies while hidden away from any retailation. It had some fun moments, but definitely wasn't the best experience compared to my pistol wielding solo",
        "Some of the criticisms about the game aren't wrong. Besides the bugs and clipping issues, driving could be improved. Opponent AI need some tweaking, especially with some of the boss fights (Adam Smasher to me on both play throughs was not much of challenge even on very hard settings, while the beat the brats were ridiculously OP'd). I really think it is bad analysis to compare this state-of-the-art game based on how it runs on machine 5+ years old. 'But they promised it would work...'. Please. I would upgrade my PC every 2 years (swapping out RAM, Video cards, processors, etc) so I could get the best experience from games. And no, I didn’t make good money at the time either.",
        "Also comparing Cyberpunk 2077 to other games that are on higher iteration is naive (really, you are going to compare the 4th installment of a game with CP2077 1? How about compare it to first installement of that game, then let us talk). Some of this criticism really got to me. The gamers send death threats to CDPR for not releasing the game, then they send death threats when it is released. The vocal gaming critics are mostly a bunch of wannabe who have little to no talent or abilities and hide it by bitching and crying about others who do. There are too many privelged people in this world, especially in the gaming community. I think the real culprit is the over hype. If a product gets too much hype it is doomed for failure. Why? Because people will grow an animosity to that thing just because. Seen it with other games, movies, TV series, etc.",
        "Anyways, I completely recommend this game for any Cyberpunk 2020/Red fans. It is a MUST play as Night City becomes a live.",
        "Ok, done with my view on Cyberpunk 2077 onto what is in store this year for the site. I am currently working on ideas for Red. Right now, I am working on a Net Architecutre generator. This will randomly generate a data pool for your game. Since RTG wants to avoid using straight out of the book charts, this will be a bit generic.",
        "Stay safe gatos. The dark future is upon us!",
        "CYBER :D"

      ]
    }
  ]
}
