{
  "news": [
    {
      "date": "2021-04",
      "entries": [
        "<strong>04-17</strong> - Wow April has been productive for ths site. Done some clean up on the site. Here's the list:",
        "&nbsp;* behind the scenes code refactoring to make my life easier.",
        "&nbsp;* updating the CP 2020 Character Generator with more instructions on how to use.",
        "&nbsp;* updating the CP 2020 Character Generator armor section with an icon button instead of text button.",
        "&nbsp;* CP 2020 Character Generator and Combat tracker had some rework on the weapon list. Now there are some settings for random rolls. You can chose the type, subtype, availability and exclusion of names.",
        "&nbsp;* CP 2020 Combat tracker bug fixes (initiative on individual opponents not working, as well as some other minor ones.)",
        "I want to thank Maysatron over on Discord for suggesting the configuring of the weapon random generator as well as some other ideas.",
        "So what's ahead? Looking to get the cyberware list into the combat tracker, add a randomizer for armor on both the character generator and combtat tracker, looking to enhance the Red NET architect tool a bit more, and a few other things (like standardize the menu icons for all apps).",
        "Lastly, I am thinking of creating some tutorial videos for the site in case the interface isn't as intuitive as I think it is. Would love to hear from all of you if this is a good idea or not.",
        "<strong>04-10</strong> - Major update to the NET Arch generator for Cyberpunk Red. Got inspired/motivated by Dante The Badger over on Discord for his tool he created. Here's the list:",
        "&nbsp;* Export to PNG format now.",
        "&nbsp;* Add/Delete floors and branches. NOTE: Adding a new floor will always be a file, but you can change it after it is created. Also when adding floors manually there is no constraint to have multiple bottom levels. That is something that you need to manually keep track of.",
        "&nbsp;* Color configuration for the icons, borders, text, and can be done on individual floors.",
        "&nbsp;* Has the constraints for creating an arch (reroll programs/passwords, max controllers allowed, can't branch on first 2 floors, minimum of 3 floors...).",
        "&nbsp;* Specifies the program names now (doesn't have their all their detes, you need to look in the core book for them.).",
        "&nbsp;* Calculates the total cost (cost per floor and each floor value set).",
        "There is still a bunch of manually work to do done when you create your own, but this tool should help you",
        "There is a infrequent bug with rendering, but it isn't too bad all things considerd.",
        "I still have qutie a bit left to do (adding demons...). Still don't have a PDF button, but you can use Chrome/Edge to do a print as PDF. The page should be formatted to remove the non-related elements on the page.",
        "<strong>04-01</strong> - Updated parts of the site that didn't adhere to the <a href='https://rtalsoriangames.com/homebrew-content-policy/'>R Talsorian Hombrew Policy</a>.",
        "Combat Tracker - remove the stats pulled from the source books for the templates. Added generic gangers and security guards. More will be added in the future.",
        "Combat Zone Generator - summarized the entries a bit more and corrected some mispellings. ",
        "In other News, Wisdom of <a href='https://datafortress2020.com'>Datafortress 2020</a> and I are doing a twitch show. We are aiming to do it every other week on the <a href='https://www.twitch.tv/cyberpunkuncensored'>Cyberpunk Uncensored Twitch channel</a>. We currently are giving our review of Cyberpunk 2077, but more reviews and other topics will be talked about. We would love for you to check it out.",
        "Till next time.",
        "CYBER :D"

      ]
    },
    {
      "date": "2021-02",
      "entries": [
        "<strong>02-21</strong> - Another month into 2021 when the 4th Corporate War starts heating up. However seems that everyone is freezing ;). This is another update to the site with 2 new things: Red Net Architect Generator and a bunch of news reports from WNS 7 News Force team over in Gigs.",
        "The Red Net Architect Generator will create a architect for you. This will be a base structure using the rules from Cyberpunk Red main book. I didn't add specific programs into some of the slot and allow you to fill in as needed. You can alter each node, save the architect and load it later.",
        "The WNS 7 News Reports are catching up on events in my campaign, which is gooing great. The team is on the hunt for an AI with the 4th corporate war as a backdrop.",
        "Lastly I just attended TotalCon this year viritually. I was able to get into 2 Red games, both GMed by RTG, one by J Gray and the other was Jay Parker. I had a great time in both. Kudos to them!",
        "Till next time.",
        "CYBER :D"

      ]
    },
    {
      "date": "2021-01",
      "entries": [
        "<strong>01-10</strong> - Hi all. No real updates to the site. Just wanted to post on where I'm at and what's in store. As you may have guest, I've been playing the hell out of Cyberpunk 2077. 2 play throughs with a couple hundred game play hours. By the neon light of the chrome gods have I been having a blast.",
        "I know, I know there has been a lot of flak the game has been gotten. Yes, there are plenty of bugs, but they have not caused me much pain. Luckily, I waited to upgrade my machine specifically for this game. My PC was about 7 years old and way past my usually upgrade period. But I want to make sure that I had the best machine I could for this game.",
        "This game nailed Cyberpunk 2020/Red. The city is brought to life. The neon lights, the scale of the city, and the outlying badlands all gave a vivid reality to Night City and the surrounding area. The city noise and NPCs talking and having conversation add ontop was fantastic.",
        "The stories (main and side missions) are amazing. I never really connect with many RPG computer games, but this one really brought the emersion up tenfold for me. Many say doing it in first person does not bring you into the game. I say fake news on that! For me, the experience of first person brought be deeper into the game to the point I care about the decisions I made and the interactions with the NPCs brough emotion attachment to them and V. If you have not play it yet, beware, there are some dialog choices in the game which can make you miss out of some key moments that made the game. Also, there is a way to play through main quests. On both play I saved some of the main quests for later and then realized that some of those spawn side missions that would not appear until a day or 2 passed in the game. For my netrunner it was a major issue as I had nothing to do while waiting. Just skipped time until the side mission would pop up.",
        "The combat (gun/melee) was good as well as the stealthing around. Hacking was a bit OP'd once you got to a certain level. A lot of missions done as a netrunner were trivial as you can take out almost all the enemies simply through hacking the security system and frying all enemies while hidden away from any retailation. It had some fun moments, but definitely wasn't the best experience compared to my pistol wielding solo",
        "Some of the criticisms about the game aren't wrong. Besides the bugs and clipping issues, driving could be improved. Opponent AI need some tweaking, especially with some of the boss fights (Adam Smasher to me on both play throughs was not much of challenge even on very hard settings, while the beat the brats were ridiculously OP'd). I really think it is bad analysis to compare this state-of-the-art game based on how it runs on machine 5+ years old. 'But they promised it would work...'. Please. I would upgrade my PC every 2 years (swapping out RAM, Video cards, processors, etc) so I could get the best experience from games. And no, I didn’t make good money at the time either.",
        "Also comparing Cyberpunk 2077 to other games that are on higher iteration is naive (really, you are going to compare the 4th installment of a game with CP2077 1? How about compare it to first installement of that game, then let us talk). Some of this criticism really got to me. The gamers send death threats to CDPR for not releasing the game, then they send death threats when it is released. The vocal gaming critics are mostly a bunch of wannabe who have little to no talent or abilities and hide it by bitching and crying about others who do. There are too many privelged people in this world, especially in the gaming community. I think the real culprit is the over hype. If a product gets too much hype it is doomed for failure. Why? Because people will grow an animosity to that thing just because. Seen it with other games, movies, TV series, etc.",
        "Anyways, I completely recommend this game for any Cyberpunk 2020/Red fans. It is a MUST play as Night City becomes a live.",
        "Ok, done with my view on Cyberpunk 2077 onto what is in store this year for the site. I am currently working on ideas for Red. Right now, I am working on a Net Architecutre generator. This will randomly generate a data pool for your game. Since RTG wants to avoid using straight out of the book charts, this will be a bit generic.",
        "Stay safe gatos. The dark future is upon us!",
        "CYBER :D"

      ]
    }
  ]
}
