{
  "news": [{
    "date": "2020-06",
    "entries": [
      "<strong>06-01</strong> - Fixed a bunch of bugs. Added an armor management contorls for the Cyberpunk 2020 combat tracker and character generator.",
      "Added a function in the Combat Tracker to import a CP 2020 Character file and add it as an opppenent.",
      "Stay safe gatos. The dark future is upon us!",
      "CYBER :D"
    ]
  },
  {
      "date": "2020-05",
      "entries": [
        "<strong>05-09</strong> - Quick update with fixes for some the apps. Been working on creating better unit tests to help with preventing some of the silly bugs I have done in the site.",
        "To help with this I have uploaded the code to Github (github.com/cybersmily/cybersmily_datafort/). This is also in prosperity just in case happens this old chromer ;-) I am also creating a wiki there for instructions on some of the apps. This is a work in progress. You can also log any issues/bugs/enhancements you have with the site.",
        "Bug fixes:",
        "<ul><li>Fixer Calculator - Hot Stuff area rolls weren't loading and message if new area costs too much.</li><li>Combat Tracker - flagging skill rolls if they are a fumble or crit.</li><li>Character Generator - Loading character the saves are set to 0.</li><li>Max Metal Builder - Several issues, for the error popup, to option spaces not being tallied, and several other issues</li></ul>",
        "<strong>05-01</strong> - Day 6,732 since lockdown...",
        "The good news is 2 new apps have been added this month: CP 2020 Combat Tracker and the Fixer Network/Contact Point calculator.",
        "Had to make some changes to the code to streamline it for integration with the combat tracker. Since needs more tweaks and enhancements. But will get to that in coming months. For now you should be able to play around with it",
        "The Fixer Contact Calculator uses the 2 systems (Hot Stuff and Big League) from Wildside supplement. You can save them as text files. Someday may integrate with the character genereator. ",
        "The other HUGE app is the Combat Tracker. This has be really fun to make and it is no where near completed. There is mising functionality I have yet to implement (looking at you Armor section). There is also tons of tweaks I still want to do throughout it.",
        "For now it is done. Not done done. Just done. I hope it is useful. If it is and you have some ideas, by all means email me (uppper right on menu bar).",
        "In the coming months, working master lists for cyberware and weapons. These will not be as thorough as Datafortress 2020, go to his site and look up Ultrachrome. Mine will be from references within my own library of books, which is limited to the main cp2020 books and supllements and Inteface magazine.",
        "I will also be tweaking other parts of the site and apps as my fancy leads me or if there are any bugs reported by ya'll",
        "If you spot a bug, typo, or missing data, please send me an email. Click on the envelope icon in the upper right. Thanks",
        "Stay safe gatos. The dark future is upon us!",
        "CYBER :D"
      ]
    },
    {
      "date": "2020-04",
      "entries": [
        "Crazy times we live in where fiction is reality.",
        "4/11 - Small fixes throughout the site. Nothing major. Continuing to work on a combat tracker which is most of my time.",
        "4/6 - Fixed/added some tweaks to CP2020 Character generator. Add input for number of years in lifepath. Added note field for weapons. Fixed the skill point calculation and the Special Abilty missing a die roll.",
        "4/4 - Did some fixes to the dice roller. Had a bad bug in it. Sorry if you weren't getting any 10s on the roll :(",
        "If you spot a bug, typo, or missing data, please send me an email. Click on the envelope icon in the upper right. Thanks",
        "CYBER :D"
      ]
    },
    {
      "date": "2020-03-28",
      "entries": [
        "More changes have arrived! There has been a few things I have change, from updating the javascript framework I have been using, to 2 new sections under Data, and updates to the CP2020 Character Sheet.",
        "The framework change was a minor, but had to untangle somethings to make it easier for future releases.",
        "The 2 new sections under Data are the Master Roles List  and the Master Skills List. These contain most of the roles and skills I could find in the books I have in my library. I'm sure there are more and some entries I've missed. I also changed some of the Roles and skills to fit in line with others to keep them standardized.",
        "The update to the character genarator/sheet was to include all the roles from the master list and added a couple of skills. I didn't add all the skills, due to formatting issues, but roles that have skills not listed will add them to the Others section of skills.",
        "In additional, I have added click-to-roll on skills and saves.",
        "In the works: Continue adding bits and pieces to other apps in the site and creating a combat tracker to help with game play.",
        "I plan to a Cyberpunk Red character sheet, but am waiting for it to come out first. I have a feeling that the Jumpstart Kit is a simple version and it will be more elaborate with the full version.",
        "If you spot a bug, typo, or missing data, please send me an email. Click on the envelope icon in the upper right. Thanks",
        "CYBER :D"
      ]
    },
    {
      "date": "2020-03",
      "entries": [
        "This month's updates are round character generation. I have add 2 apps:",
        "1) Cyberpunk Red Template Generator",
        "This will generate a random character based on the templates from the CP Red Jumpstart Kit. You can print the sheet straight form the browser. The intent is these are throw away characters, like the pregen from the kit.",
        " ",
        "2) Cyberpunk 2020 Character Generator",
        "This is a character online character sheet. It has more capabilities than the CPRJK generator and is based on the CP 2020 character sheet. The intent is to have a double-sided sheet to print.",
        "You can save the character to your local drive and load it back to the site to continue maintaining your character. There is some sticky data as well, so the data will stay if you come back to the site. But if you clear your cache or some other clearing of data in the browser will lose all that work, so save to a file when you end your session just in case.",
        "The CPRJK is as is. CP2020 I will be continue to work on. I plan to continue to build out the functionality. That will be scheduled for upcoming months. Right now I have another utility for CP 2020 in the works as well as getting ready for Cyberpunk Red and Cyberpunk 2077.",
        "I hope I can keep this pace up with an update per month this year. We will see what real life and what happens with how much CP 2077 takes up my free time. Till next time... Burn that Chrome!",
        "CYBER :D"
      ]
    },
    {
      "date": "2020-02",
      "entries": [
        "Back with another update. Since this is 2020, I am going to try to push out something once a month. This isn't a promise, just a goal.",
        "For this month's installment, I fixed a bug with the Fashion Calculator around some of the modifier would linger when changing the clothes.",
        "There has been a major update with the Max Metal App. I have added weapon/option selection. This is far from finished, so you shoudl audit your work with the book. I will continue to get some more fixes to it. But for now, you can play more with it.",
        "Also, you can save your Max Metal Vehicle to a text file now too!",
        "CYBER :D"
      ]
    },
    {
      "date": "2020-01",
      "entries": [
        "The year is upon us my fellow edgerunners! The prophecy has come true, flying cars, booster gangs, cybernetics.. hmmm. Guess not. Oh well.",
        "I have done a quick update though. I create a quick CyberPunk Red Jumpstart Kit Lifepath generator under Apps section. Enjoy!",
        "CYBER :D"
      ]
    }
  ]
}
