{"news":[{"title":"Nightly Report 2022-01-19","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>SPACE - The Public Warns Travel"},{"img":"htorres","reporter":"Harden Torres","commentary":"Event Missing District"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"NATIONAL - An Individual Requires Territory"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"macv","reporter":"Mac V","commentary":"SPORTS - Nomads Praises Plan"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"glitg","reporter":"Glit G","commentary":"SPORTS - The President Lobbying Territory"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"An Individual Breaks Facts"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-18","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Governor Praises Decision"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Corporate Praises Tragedy\nMil fight terrorist org in LA. Ara send Reinforcement. LAPD Join and atrocities. OTEC/CINO request Mil/Ara to withdraw"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"htorres","reporter":"Harden Torres","commentary":"Slayer Reveals Crime"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"glitg","reporter":"Glit G","commentary":"Gang Requires Incident"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"SPACE - A Hospital Riots Earnings"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"macv","reporter":"Mac V","commentary":"Crime Dies Protests"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-17","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Technology Survives Family"},{"img":"macv","reporter":"Mac V","commentary":"A Nomad Family Traumatizes Funding"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"A Store Disrupts Crime"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"htorres","reporter":"Harden Torres","commentary":"Crime Advances Merger"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Finances Increases Compromise"},{"img":"tphillips","reporter":"Tom Phillips","commentary":""},{"img":"glitg","reporter":"Glit G","commentary":"Rocker/Media star Praises Facts"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-14","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>We start the night with entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"<i>*Knocks on the camera*</i>Heeeelllllooo... I have a name Big Boy. Any whoo. Mr. Grumpy wants the DL on the E. Heres we go. Movie crews have constantly been whining about the low pay. Whelp. The exec of DMS put a kibosh on their numbers that they can't afford a living wage. Da big wigs issued the following, rent for 1 room apt 200eb/month, kibble 200eb/month. Average pay for these goons are 800eb/month. Plenty to live on. So buckle up and git 'er dun for the billions of fans, else the studio will find someone who will do it for less. Back to you Tommy Boy."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>Tom looking perturb.</i><br>Now to business news with Porche Hendricks. Porche?"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br>OTEC and Millitech announced today that the incident on the 2 of OTEC facilities from last month were not due to terrorist attacks but were cause by malfunctions with the equipment. One incident was due to some militech ordinance improperly stored that caused an explosion while the other was a faulty strut that gave way causing a collapse in an OTEC facility. Both companies are looking at their processes and procedures to make sure incidents like these don’t happen in the future. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Porche.<br>Now we go to Isa for more news on the Arasaka Sanctions in Peru. Isa?"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. Today the Peruvian High Court revealed that the sanctions that Arasaka has enforced on the docks within the country only apply to those docks controlled by the corporation. Though the company maintains security at other wharfs, those teams cannot enforce any of the sanctions that Arasaka has imposed. I have learned from some corporation that do business in Peru that they contracted Militech to address any the illegal sanctions imposed on them by Arasaka. Tension seems to be mounting in Peru around this.<br>In other news, since my reporting on the Mad Hatter possible suspect, I have been overwhelmed with tips from various sources. I was able to learn that a surviving member of the 75th Infantry Regiment, one Reuben West, whereabouts are unknown. No known records of his death have been reported. I was contact by some locals in the South Night city that West frequented the bar Forlorn Hope on a few occasions. When I visited the bar and asked around, the patronage wasn’t too keen on talking with me, nor do they remember anyone fitting Reuben’s or the bus driver’s description. The bar is known for the vets that reside there and maybe protecting one of their own. I will continue following the story. Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isa. Great reporting.<br>In other news the EBM's VP of West US Nanite Research, Kirsten Hodge, was abducted last night. Her husband was found dead in their apartment. Luckily her 2 children were not on the premises at the time. EBM has given no comment on the situation. The NCPD was called in but was quickly excused by the EBM security team as it is considered a corporate matter.<br>Now to Mac V. "},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. The North California senate today has merged 2 regulations around corporate authority and corporate security. The new regulation requires all corporations to notify the government what security will be on any of their territories within the NorCal borders. The corporations have until August this year to comply with this these requests and under reporting will have the corporation issued a hefty fine.<br>Also, the Haven Districts are slowly coming under control of the NCPD and Araska task forced. The were able to reclaim 8 blocks yesterday. The press is still unallowed into the areas that have been cleared. No statement about when we will have access to the area or the survivors has been given."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Harden is off tonight.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-13","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips. Isha Tomoda is off tonight.<br>Tragic News tonight as a massive fire swept through the new arcology site. As report little less than a month ago, the site had a gas leak explosion setting the project back by several months. The fire that happened earlier today and is still being put out, has cause a lose of all work and materials. The project sponsors have issued a statement that due to all these set back the project has been canceled. Currently 500 workers have been released from their contract and the project is no longer accepting any further candidates to work on the project. Mayor Ebunike has issued a statement that the NCPD will be investigating the matter thoroughly. It has yet to be determined what caused the fire.<br>Now to Harden Torres for some interesting gang news. Harden?"},{"img":"htorres","reporter":"Harden Torres","commentary":"Hey Tom. Today was a continuation of a summit that the Silver Sash gang started with the NCPD on how to protect the streets of Night City. Many other guardian gangs were in attendance as the Silver Sash outlined a plan in which guardian gangs and the NCPD can work together to provide safer streets. The Sashes have already started campaign with citizens in the local neighbor to create a network of communication to prevent the rise of crime. Other gangs, like the boosters and chromers that have been staining the streets with their filth made no attempts to disrupt the summit. Good for them as the guardian gangs that did show were bearing their right to arms. I’m not one who cares about gangs, any gangs, but the Sashes give me hope that something good may come from them. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Harden. I did a report on the Sashes back earlier in my career. They were founded by some good people who just had enough of the violent gangs.<br>Now to entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Sup Big Boi! Big ol’ nitty news. Apparent the big Net54 lost one of their talent, literally. The star of “Is this real?”, Anna Shaw, has gone completely and utterly MIA. She had left the studio after a table read to go have some grub with her agent and poof! No more Shaw. The studio tried to deep six it, but you know me and my net-fu. Nothing escapes by peripherals.  54 has no comment and Shaw’s agent apparently is mia as well. No doubt he’s being grilled by some producer on keeping tabs on his asset. Let ya know if the goose shows again. Back to you T."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"And now to Business News with Porche Hendricks."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Today Arasaka has put sanctions on all cargo entering their held docks within the country of Peru. There was a contract dispute over their security contracts within the country as well as their government held one. The Peruvian government has given no comment on the situation on how they are to handle these sanctions placed by Arasaka. Several other nations are looking at this situation. The U.S. government, the EU, China, Russian and the Africa Coalition have all commented that Arasaka had better watch their step with any sanctions placed within their or their allies’ territories.<br>In other news concerning Arasaka, There was an incident at the So.Cal. and Mexican border in which all traffic was halted by Militech. Militech reasoning behind this was that there were terrorists attempting to flee the country who have been attacking OTEC facilities within the country. Militech says these are agents sponsored by Arasaka. Arasaka denies the allegation and issued a warning to Militech to cease the slander or else legal ramifications will happen.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Great reporting as usual. Thanks Porcher.<br>Now we turn to Mac V."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. Today the NC Board of Education has killed a plan that would provide school children additional funding for vaccination against the Wasting Plague. The board claims that since there have been no new cases in the Night City area as well as NorCal and SoCal states that the vaccine isn’t required going forward. Parents are up in arms on this decision and the Mayor’s office as issue a no comment on the matter. It is undetermined what impact this has on the health and safety of the students. It will be only a matter of time to see if the decision was right or not. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2022-01-12","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>As we reported yesterday, the introduction of DMS' bd simulators into class rooms has been rolled out to Pablo school district in Rancho Coronado. It is except that the Board of Ed will be progressively implementing this in more and more school districts. Current the Board is using Pablo districts as a pilot to the program. It will be interesting to see how well it works. Now to entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Op-O-loppa Mega Mega star Julien Corriveau has announced all his future cash money will be funneled to all those greenies looking to improve the world. Current Julien is a must have in any TG Movies these days. This cutie is pulling in the 9 digits per vid and seeing as he averages 3 a year, min. Those greenies are about to get  huuugge influx of chop. Maybe gray skies will clear up with that bank roll. Back to you big boy. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Now to Mac V. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. Today saw the city saw violence on the steps of City Hall. 3 unknown assailants pulled up in a stolen Takaya Daimyo. They exited the vehicle and proceeded to open fire on a group of city and corporate officials. Only one of the gunmen was able to escape as the NCPD, private security, and CSWAT converged on the scene. 3 members of the city government were killed. Though some corporate officials were shot, they were quickly rushed off in private emergency vehicles. Councilor Jin-Hee was shot but is in stable conditional at Night City General. This was a bold step and it is believe these terrorists were attempting some disruption of negotiations taking place between Arasaka, the city and other corporations around security within the city. Arasaka has place a 100,000 eb bounty on the whereabouts of the escape terrorist. I will keep the viewers posted on further developments in this story."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Now we turn to Isha Tomoda."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. I was able to join the security force tasked with pacifying the Haven districts again. They were able to complete the re-taking of North Haven and made some progress into West Haven. I was able to find out more details of what has been taking place. The Berganza cartel has been operating in the districts for several years. However the Moya cartel has been slowly encroaching on their territory. It finally boiled over to an all out war between these drug gangs. There are scenes of warlike atrocities through the streets of Haven. Most bodies hung up on power lines and light poles showing examples to the different factions of what would become of each other. The NCPD say that all of the Haven districts will be under control by the end of the week. The clean may take months. Such a tragedy.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha. We go to Porche Hendricks for business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Another item from the current conflict between OTEC and CINO. An OTEC offshore facility near the Florida keys was on fire today and continues to burn. Initial reports claims  it was a bomb, however other investigators on the scene have yet to confirm as it appear there was a broken gas leak that may have cause the explosion. OTEC has also confirm that Head of South East Security division has been terminated and is currently being detained. It was leaked an hour ago that the employee had correspondence with a proxy agent of CINO. It is unknown whether the incident today was caused by him or if it was truly an accident.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-11","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>A follow up from yesterday's report on Reverend Cornealius Keating, he was finally tracked down by authorities in North Dakota. Reportedly there was a severe firefight between Keating’s followers and the authorities. He was eventually taken in a live. No footage is available yet, but there are several offers for it. Keating if facing multiple counts for provoked murder as well as other capital charges.<br>Now to Ishi Tomoda"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom, today a report from the U.S. Department of Education has shown a correlation with improved grades using advance braindance simulators developed by DMS. Children connected to braindance have a 33% increase in learning over children not using bd players. The Department is requiring all public schools to start implementing braindance in the classroom requiring children to log at least 6 hours per week. The education system needs to meet these requirements by 2014.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha. Now to Porche for Business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Horrible news today for IEC. Reports out of Togo is that a chain of stores owned by IEC were selling contaminated food across the country. It is estimate that about 80% of the population was impacted. It is believed this has cause several health issues for this population. Within the past 5 months the cancer rate has increase by 780%, with most case being stage IV. About 20% is have died or are dying. IEC has responded claiming that the contamination was introduced by Togo officials and have documentation proving this allegation. Currently IEC facilities have been destroyed by the populace of Togo and warrants have been issued for all the board members and many executive officers for the corporation. The EU has sent investigators to Togo and have also taken the evidence IEC claims they have. It is unknown when this issue will end, but IEC has taken a 30% lose in their stock. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Tragic. Thanks Porche. Great reporting.<br>Now to Harden for word on the street."},{"img":"htorres","reporter":"Harden Torres","commentary":"Well the street thugs have done it again. During a free clinic day in the district of  Karsten Hills, brought to the citizen  by Trauma Team was a disaster. The Red Chrome Legion raid the makeshift clinic. There was several fatalities on both sides. The Legion is said to have made off with a lot of the medical supplies on site. Trauma Team believes this was the gangs main objective. The scum robbed the unfortunate, honest working, citizens the needed care. The Mayor should call up the Governor and get the national guard to clear out the combat zone once and for all. Disgusting."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Harden. Now to Mac V."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. As reported by Harden last week, a new stalker is on the street named The Headhunter. Last night he attacked again. This time in East Marina. 5 Wild Things gang members were found dead, again decapitated. I have talked with NCPD and they have CSWAT now on the hunt for this vicious criminal. Hopefully for the citizens the Police will be able to take out this monster before more die."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. <br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-10","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today marks the anniversary of Biotechnica bringing to market the Simphone Syndrome vaccine, which prevents the birth defects that come from the exposures to the carbon plague survivors. The Governor presented Biotechnica  with the Governor Award of Humanity. This has been a great success and has seen the carbon plague birth defects drop by 99.3%. Biotechnica  is still working on improvements to the vaccine to eliminate the Simphone Syndrome completely. Nice to have some good news.<br>Now to Business news with Porche.   "},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Since the censoring of CINO and OTEC from the NET, Netwatch has been proposing new regulations for corporation use of the NET and more strict penalties for breaches of these regulations. However, these restrictions are currently on hold as there has been a major surge with online hacking, to the point where even one of Netwatch’s dataforts was breached by a group of anarchists. Most of the terrorists were apprehended with the rest were killed during the confrontation.<br>In other business news, Ether Technologies and Infused Scientifics announced over the weekend their joint project will be to combined IS's nanite therapy with the the ET's genetic expertise to help eliminate hereditary neurological diseases. Their initial analysis and modeling has seen great success at most of these genetic diseases. They expect to start trials within the next 6 months. Expectations are high on both companies to deliver.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche for the updates. Now to Glit G."},{"img":"glitg","reporter":"Glit G","commentary":"Sup T.P. Wowy wow. Talk about a big bang. The great and wise Reverend Cornelius Keating during his daily broadcasted sermon told his followers that the reckoning is here. The ol’ god of brimstone wanted them to cleanse the world of the unclean. Total ape dookie detes. Well, some of his diehards took to the streets and started the purge. Let’s just say it was their reckoning. The old Rev is now wanted by several states and countries. His little streams are now banded on all media outlets. What a gonk. Some of the media corps are offering any live footage of Keating’s apprehension and/or killing. Can’t wait to see the vids. Back to you Tommy."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Another good story today from Mac V."},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. Starting this past month firearm sales has seen a drastic increase of late. This has caused many arms manufacturers to speed up production. Now the various gun stores are trying to keep up with processing all of this demand. There has been a 500% increase in stores hiring, whether it is clerks, guards, and other staff needed to keep up with this growth. I don’t know how long this boom will continue but it is definitely not ending any time soon. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Now to some tragic report by Harden Torres. Harden?"},{"img":"htorres","reporter":"Harden Torres","commentary":"Again the hard streets of Night City claim another victim. The Makarovich family were the innocents claimed this time. The family first suffered the lost of their son, Jasaon, by the Gilligans gang during a robbery gone wrong. 3 days ago, Jason’s father, Kirsanov, was taken by the gang when he sought some justice on his own. Yesterday is half eaten body was found in the park for all to know what animals there are stalking the night. Today, Oleneva Makarovich, the mother and wife of Jason and Kirsanov was found dead, suicide. No justice will be found by them as NCPD still cannot control the maniacs that roam the streets and prey upon the honest workers of society. Viewers, always remember you are in control, and you can bring the justice needed. Don’t become a victim. Arm yourself so these kind of tragedy don’t happen to you.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Harden. Saddening to hear such a lose.<br>Now to Isha Tomoda"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. Over the weekend a joint force of NCPD and Arasaka security forces moved into the Haven districts. I was able to join the teams pushing into the districts. The destruction that this district has suffer for the past week was evident when we first breached the barricades. The teams opened fire immediately as inhabitants began shooting on the team. The security force was able to reclaim 5 blocks. This includes about half of the North Haven district. West and South Haven districts are still in control by the terrorists. The security force however would not allow any of the media to see or talk with any of the residence. They have been quarantined and shipped to another unknown facility.  When I talked with the city official about this, they gave no comment. I feel that there is something they are not telling the media. Mac V is also investigating the situation as well. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-07","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>\nAnother escalation in the OTEC/CINO conflict. OTEC has report major net breaches on many facilities by unknown actors. It is speculated that they were funded by CINO, who flatly denies these accusations. OTEC reports there was no serious data loss done during these raids, though the market seems skeptical as OTEC was down by 3.48%.<br>Now to Porche for business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br>After 5 months of negotiations with the EU for the merger of BMS Surgical and Dornier-Bauer Biotech, Dornier-Bauer's CEO Gustav Rottergaun announced that corporation will be ending the merger with BMS immediately. Mr. Rottergaun says there are some key points that arose during the EU regulatory approval process that brought to light some non-negotiable points which neither corporation would agree upon. This has cause a dramatic lose for BMS stock which dropped 13.5%. Jeff Terlin, CEO of BMS, says he is seeking to work through what these issues. However Mr. Rottergaun has eneded conversations with Mr. Terlin and Dornier-Bauer Biotech has retracted its application to the EU regulatory.<br>In other business news Ether Technologies CEO was attacked today by terrorists for a possible kidnapping/ransom attempt. The 3 assailants were killed during the assault by the chief of security from Ether Technologies. This caused a delay in the press conference that Ether Technologies and Infused Scientifics were holding this afternoon at the Ashcroft. It is believe that a driver was also part of the terrorist group but reportedly fled the seen. NCPD are asking for any citizen with any information to call them. Also Ether Technologies has also posted a reward for any information leading to the apprehension of the escaped terrorist.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche<br>Now I would like to welcome back Harden Torres from his long recovery from an assault by the notorious Bozo gang. How are you doing Harden?"},{"img":"htorres","reporter":"Harden Torres","commentary":"I'm doing fine Tom. It's good to be back. Those scumbags have another thing coming if they think they can take me down. Hear that 2 of the slags had their brains splattered on the pavement soon after. Good riddance to the trash that walk the streets now a days. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Haha..<i>Tom looks at the camera a bit uncomfortable</i>Well it is good to see you back. What do you have for our viewers today?"},{"img":"htorres","reporter":"Harden Torres","commentary":"It's good to be back. Today we see another psycho vigilante hit the streets of Night City. NCPD has dubbed them \"The Headhunter\" as the victims had their heads ripped off there bodies. The heads were not found anywhere on the scene of the crime. The victims were members of the Tiger Claws. 2 males. 1 female. The bodies were found in a back alley down in Japantown. NCPD is cautioning all citizens that this perpatrator is most likely suffering cyberpsychosis and is heavily augmented.<br>I say, good riddance to the filth that crawls in the city's underbelly. If viewers out there are fearful, I suggest heading down to your local Gun O' Rama and picking up an Arno or Stalone. Learn how to handle that handcannon at their in-store range. If you see a hulk of metal approach ya, blast the gonk right in the face. Hell that's what the \"stand your ground\" laws were drafted for. Killing trash like that. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Harden and glad to have you back.<br>Now onto Isha with some orbital news."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"News from Mars is positive as the colony station on the planet is closing to completion. The \"Highriders\" or construction workers on base have been voicing that the facility is coming together quite well and offers better housing than most stellar settlements. NASA and ESA have continued a major campaign to acquire more technicians and scientists. This effort is promoted as a great opportunity for all of humanity to expand into space. The estimated completion date for the facility is to be mid next year. This is exciting news for the progress into the new frontier. <br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha<br>Now to entertainment news"},{"img":"glitg","reporter":"Glit G","commentary":" Turbo time for Tictoe, leader of the prem chromer Viz I Yule O PicA. TT was discovered at his golden palace dripping the red over the flatline input of his. Poh poh found him that way with razor in hand. After a few hours on ice, Tictoe was released. Lawyer spoke that TT was an innocent victim and that some competitors are framing him for the hack'n'slash. Apparently DA agrees and let the rascal go. TT hasn't commented on the whole ordeal, but enquiring gray matters want da scope. Will keep ya posted big man on the low down. TTYL"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Now to Mac V with a local news item. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom.<br>Tragedy struck the med center over in Ackerman District. The barricades of the Haven districts have been loosen and casualties of the riot were allowed to leave. They received medical treatment at the Lord Mercy Medical Center in Ackerman. One of the supposed victims however brought a bomb  into the ER which exploded killing 23 people and injuring dozen more. The Med Center ER is no longer in operation and the barricades have quickly be reinstated. No one in or out of the Haven districts. It is still unknown whether the bomber was willing in the attack or was being used by the radicals still inside the Haven district. This is the eighth day of the quarantine of the districts. Again, NCPD and Arasaka have confirmed they will be moving into soon to quell the unrest.<br>This situation has raised major concerns within City Hall. There are currently talks of implementing stricter security into other districts to help prevent other areas from erupting into riots. In any case, the situation is grim."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Sad to hear that.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report 2022-01-06","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>The body of Rahul Tavade, senior vice president at Infocomp was found today in an alley in North Side. His body was found this morning and believed he was killed at 2AM. NCPD is still investigating but it appears Mr Tavade was a victim of a mugging gone wrong. Tavade was having drinks at O'Flaherty's Tavern in Northside with some coworkers. The coworkers mentioned that Tavade stayed when they left the bar around 11PM last night. They said he had met a female patron and was having a conversation with her when they left. This person of interest has yet to be reach or the NCPD hasn't released this information. Infocomp has issue a statement that it was tragic occurance and they will also be doing their own investigation in the matter. Mr Tavade leaves behind his divorced wife and 4 children.<br>Now to Mac V for developments at CIty Hall. Mac?"},{"img":"macv","reporter":"mac V","commentary":"Thanks Tom. Warning from City Council indicate that the murder rate has been rising over the past month. This has been linked to growing gang violence in the city. NCPD and Arasaka corporation have been in talks to bolster the NCPD street presence with Arasaka security forces. This is against Mayor Ebunike's request for Arasaka to reduce their presence within the city. Assistant Mayor Haakenson stated that the Mayor demands and the city council are in conflict as Arasaka was requested by the council. This situation hasn't escalated yet to where the Mayor has exercised his executive power to override the council's decision. Police Chief Lamia Barr says that the help given from Arasaka is sorely needed by the NCPD to help curb the rise in violence.<br>To bring this forward, again the Red Chrome Legion made the news as NCPD's Max Tac unit raided a known Legion hangout. In addition to confiscation of weapons and  narcotics as well as several arrests, the Legion's leader, Chad Moon aka Blood Moon, was apprehended. He suffered severe wounds during his arrest but is in stable condition at Night City Medial Center. NCPD believe this will stem the recent Legion activity. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. I would also like to mention that Harden Torres will be joining us tomorrow with a report on gang violence in the city. Please viewers make sure to watch his return to the air.<br>Now for business news with Porche Hendricks."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. The Future of Nanotechnology Expo will start tomorrow. The keynote will be present by a local NorCal firm Ether Technologies' CEO Bridger Morse. After which both Ether Tech and Infused Scientifics will be have a press conference about their joint project. There is speculation around what this project could be and none of the insiders have any information on what announcement they have planned. This has quite a buzz among the nano and bio technology industry.<br>Other business news, the Lazarus Group has announced a major increase in their security contracts. Both Militech and Arasaka are not renewing several of their smaller contracts with firms. This gap is Lazarus' gain. This news caused a spike of 6.7% in Lazarus' stock price. Lazarus Group's Chairman, Colonel Emile Lazarus , commented that his corporation will meet these new demands of his corporation and provide the quality security needs for these new customers. Both Militech's and Arasaka's stock prices have continued to fluctuate with the OTEC/CINO conflict. Neither saw any statistical significances with this Lazarus Group gain. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Another great report. Thank you Porche. Now to entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"<i>Trying to sound proper with a deep voice</i> Thank you Thomas.<br>Any who biiiig boooy, just got some latest gosp. Vex-N of the German Techno band Perilous Futur says he's looking for different ops and will be terminating his involvement with PF. Vex-N is looking to setup shop with a new band, Vex Hex. The rest of PF only says he's no longer with the band and don't care what he does. Ouch. DMS, PF's producers, also didn't have kind words. Says they are seeking legal action against Vex for breach of contract. All's fair in love and contracts I suppose. G out!"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Now we turn to Isha Tomoda for more local news."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"I have spent that last two days doing an in-depth investigation on the Mad Hatter case. I have uncovered that the bus driver of the high school students, one Sam Hussain, has gone missing. Mr Hussain was hired 3 months ago by the bus company. This was post the first few victims of the Mad Hatter. Mr Hussain has falsified SIN and background that allowed him to pass all checks by the company. <i>Image of the bus driver is shown on screen.</i><br>I have also done research on who this individual might be. Computer analysis on his face shows he had several surgical alterations done. The computer could not create an accurate image of who this man was prior to the surgeries. There was evidence of bone restructuring which the computer couldn't refactor to an original image of his face.<br>I was able to talk with coworkers at the bus company confidentially. They were able to describe a few tattoos that Mr. Hussain had on his forearm. One tattoo was of the military crest of  75th Infantry Regiment, Rangers with a script of \"The Fighting Savages.\" This was a nickname of the 164th company within the 75th that fought and was disbanded during the second south-am war. Out of of the 4 survivors that now live in the states, none are \n citizens of Night City, NorCal or SoCal. I confirmed that currently reside out of state. I ran the images of all members of the company to see if there was any matches with the  image of the bus driver. I wasn't able to get a match on any of the soldiers. I believe that the bus drivers is involved but is not the Mad Hatter, as there were no members of the team with a background in the technologies used on the victims. The extensive surgery on this man shows that there is funding behind the Mad Hatter. This is further verified with the latest neuralware implanted in the victims. I believe that some organization is behind these murders and its victims. I will continue digging into this. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Great reporting on this Isha and thank you for all the work around this case you've done so far.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2022-01-05","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips. Isha Tomoda is off tonight.<br/>In the news today, Senator Joseph Burke of Virginia threatened CINO and Arasaka with  sanctions as their as the conflict over IHAG assets continued. Senator Burke gave a fiery speech on the senate floor around how these two corporations are running rampant. When asked about the same situation with Militech and OTEC, the senator stated that you do not attack the victims, but the aggressors. When asked about his acceptance of money from Militech during his re-election campaigns, the senator had no comment.<br>Now to more business news with Porche Hendricks. "},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. In more US news, President Kress announced today plans to introduce a bill to limit corporate security outside of their holdings. Currently laws allow specially appointed corporate agents to perform investigations and arrests of terrorists within some states beyond the corporation's property. President Kress says the bill will limit these actions for all states in the union. This is a clear message to corporations that President Kress is limiting their current reach.<br>In other business news, an unknown group of terrorists sunk a Militech sub off the coast of Los Angeles. Militech confirmed that a prototype ACPA was onboard that would help their client, OTEC, with search and rescue operations in deep sea operations. In response to this terrorist attack Militech is performing a security sweep throughout the southwest seaboard. We tried to reach Morgan Blackhand for comment, but he was unavailable.  Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Porche. Great reporting as always.<br>Now we turn to local news with Mac V. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. The Haven districts are still barricade, though some of the fire appear to be dying down, but there is still gunfire heard behind the walls. Drones and other aerial assets are either shot down or hack by the criminals conducting the riots. NCPD this morning has made attempts to allow any civilians through the barricade, but were faced with gangers shooting at them as well as throwing molotov cocktails. The police captain on the scene gave a quick press conference and stated that they will be moving in over the weekend with the assistance of Arasaka security forces if the situation hasn't cleared up by then. I will keep the viewers posted with any new developments till then. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Tragic news for the residents of the Haven districts. Our thoughts and prayers go out to them.<br>Now we turn to entertainment news. "},{"img":"glitg","reporter":"Glit G","commentary":"Woot! Woot! Woot! Trial for Dodalido and his little dirty secret are the sich. If you haven't gotten the detes, this star of the kiddy show Superbrain was nabbed and tagged for his collection of kiddy porn BD. This little star is facing some heavy badness. DA wants real time, no Personality Adjustmentn or BD. Doesn't seem like preem news for Dodalido. My advice to him learn to relax and don't clench. Winky.<br>Other news is the nova band Godziller IEI drop a new chip, <i>Bastards will pay</i>. They are rocking it heavy with this one. All NC should get ready as they will be hitting our city in April with 2 nights available at the dome. Don't have all the detes on ticks, but will keep ya posted. Back to you big boy. <i>Licking her teeth seductively</i>"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"ahh-hem. Yes. Thanks for that entertainment news Georgia. <br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2022-01-04","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips. Isha Tomoda is off tonight.<br>Now to Porche for business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Today Infocomp saw a major breach in their datafort in Night City. What little has been provided from Infocomp, it is believed that a half dozen hackers were involved in the breach. The corporation has yet to divulge what was done, but sources say it was data around the currently Militech operations within Night City. Representative from Militech voiced their concerns and demand that Infocomp reveal what data was actually stolen. Again, no comment from Infocomp on the matter.<br>In other business news, the local firm Ether Technologies has announced a joint project with another local firm, Infused Scientifics. Representatives from both company say that this project will have far reaching benefits to various aspects of gene research and biotech industry. Some are skeptical of the two corporation as both are small corporation with very limited specialties. Ether Technologies has been involved strictly with genetic testing and has recently expand to genetic research. Infused Scientifics has specialize in nanite therapy for patients with severe nerve damage and spinal reconstruction. The representative says they will be unveiling the specifics on this new project this Friday at a press conference in the Ashcroft.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Again, great reporting Porche.<br>We turn now to Glit G with the latest in entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Sup TP. heard a rumor that some little young thang wants to thank you for some pumping to her pipes over the weekend. Got a comment?"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>Very shocked, stares into the camera. After 10 full seconds gives a phony smirk with a bit of a stutter. </i> I..I.. have no idea what you are talking about Glit. Please continue your report..."},{"img":"glitg","reporter":"Glit G","commentary":"Sure thing TP. <i>Winks into the camera.</i> The major item today, Sad face. Actor Kiki Long was found dead today in her mansion. The start of Stellar Privateers OD'd on black lace. Shame. She was preem in her role as Queen. Any who, the studio put out blurb dat they had no intel that Kiki was a dorpher. The police were on the scene after the maid found her bobbing in the pool. According to the blues, no signs of force entry was found and security was light up when the help came onprem. But odd that before new years she confided in me that she was looking to change agencies and studios to expand her career. Funny how that works out. Back to you big boy..."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>Looking very uncomfortable.</i> Now to Mac V. Mac."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. The Red Chrome Legion has struck again. This time in Japan Town. The target was a small sushi place off of 21st street. 8 patrons and 6 staff were slaughter when the Legion members open fired with assault rifles. No witness were left, though one of the gang members was fatally wound by one of the dinners. Among the victims were 6 middle management executive of the Arasaka corporation. It is unknown whether this was a targeted attack by anti-Arasaka Legion members or a coincidence. The NCPD along with an Arasaka investigative team are looking into the matter. They have given no comment as of yet for the motive.<br>In other local news, Haven is still burning. The joint task force that assistant mayor Haakenson announced yesterday have yet to act. It is estimated that 30% of the buildings in the district are most likely destroyed from fires seen over the barricades. The death toll is still unknown. The  innocent men, women and children with the district are with out a doubt suffering. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2022-01-03","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Major news happening today as well as over the weekend. First off the missing high school students have been found. Tragically they were victims of the Mad Hatter. Isha Tomoda will be providing more details.<br>But first up, breaking news on the OTEC/CINO conflict. Porche."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Big news coming from OTEC today Tom. Amanda Russell announces an end to the \"wasteful violence\" that has been going on for the past several weeks. To that end Militech announced that  the legendary mercenary Morgan Blackhand to the position of Acting Director of OTEC Security Operations. This has sent a shockwave through the market as OTEC rose by 12.5% within 2 hours of the announcement. This has major impact to the conflict between OTEC and CINO. Mr. Blackhand wasn't able to be reached for comment, but Mrs. Russell has expressed delight at Militech decision to assign such a skilled and reputable asset like Mr. Blackhand.<br>CINO and Arasaka have given no comment. The market did. CINO's stock lost 4.3% in the same amount of time that OTEC's rose. This is a major milestone in the struggle of what is now a corporate war. The next several weeks will be very interesting. <br>Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche. This is a very interesting development in the OTEC/CINO conflict.<br>Now onto the news of the missing high school students that I reported last week on. They tragically have been found to be victims of the Mad Hatter serial killer. No news about the driver. The NCPD is at a lose on who this killer or killers are. They still have no leads on the whereabout of the drivers. Though now the NCPD believes that the driver could be a suspect in the investigation.<i>Tom holds a finger to his ear and nods</i> But for now we go to Isha Tomoda for the report. Isha<br>"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"<i>Isha looks at the camera stunned with her mouth open. Then composes herself.</i>Thanks Tom for filling in our views of what <u>I</u> have uncovered so far in the case. Tragically the high school students where found in North Oak last night. They were all seated around a make shift table playing cards. Like all Mad Hatter victims they were wearing hats to cover the implants the Hatter had installed. NCPD reported that there is a significant advancement in the technology that the Hatter has used on previous victims, signally a concern that he Hatter has someone investing in their experiments. This is a dire situation that Town hall still has yet to comment on. Citizen I have talked with have voiced concern as well as stating a vigilante agenda to hunt down this killer.<br>Back to you Anchorman!<i>Her voice trails off and barely is heard \"If that f#@$er dares steal one of MY stories again...</i>"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>Tom's eyes open a little wider with the trailing comment form Isha. I tries to hide a slight grin.</i> Thank you Isha.<br>Now to Mac V for furthering developments in what is being call Haven on Fire Riots. Mac<i>Off of mic, Tom is heard yelling \"That c#$%t better be told I'm the star...</i>"},{"img":"macv","reporter":"Mac V","commentary":"Uh, thanks Tom. Yes this is the fourth day that the Haven districts have been quarantine. Still no one is entering or leaving. Various organizations have been protesting at City Hall over the treatment of the innocent residents trapped within. The assistant mayor addressed the concerned group."},{"img":"asstmayor","reporter":"Assistant Mayor Haakenson","commentary":"The City is very concerned for the trapped residents. I have been working with the Chief of Police as well as with Miss Takeshita Okiku, Arasaka security liaison with Night City. A joint task force from Arasaka and some of Max Tac will be performing operations soon. Please be patient."},{"img":"macv","reporter":"Mac V","commentary":"The crowd wasn't appeased by this message. Shouting and throwing of various items ensued. The NCPD that were present dispatched the crowd with teargas. 12 people were arrested. Hopefully this situation will soon be over. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Mac for the professional reporting.<br>Now on to Glit G for entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Thanks AM.<i>She gives a wink to the camera</i>Yes the biz news. Wellllll what a f'ing show K.E. gave am I right? The noize was astro. The scene was preem. 2021 went off with a bang! I know I did, several times<i>Glit sticks her tongue out sarcastically</i>I also got some lowdown on the rumor of JS floating. Apparently Johnny boy wasn't in the mood to deal with Kerry and left him high and dry. Supposedly he was meeting with some interesting characters over the weekend. Not going to spouge the intel, but the boyz in black have a big target on their back. Back to you TP. "},{"img":"tphillips","reporter":"Tom Phillps","commentary":"That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-30","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today saw major delays in the Night City Arcology project. Shipping lanes are slow with cargo as terrorist, pirates, and other paramilitary units have been on the rise since the antagonism between OTEC and CINO over IHAG resources. This isn't just impacting the arcology project, which is expected now to be completed in 2025 and a 8 month projected completion date, but it is impacting all goods through out the world. Though this hasn't caused too much damage to the bottom line of commerce, there is a rising  concern over the current situation. City Council is calling out the mayor for going forward with this project as well as launch of increase the current NCPD funding. Councilor Rivera is quoted to as \"This is a disaster and the mayor needs to go!\" during a phone call with another colleague. What will become of the project as the OTEC/CINO situation continues to escalate. We will find out in the coming year.<br>Speaking of which, we now go to Glit G on the NC New Year celebration."},{"img":"glitg","reporter":"Glit G","commentary":"Arigat TP. Sooooooooo we are get closer to the big one. OMFG dat's tomorrow!! Kerry will be hitting the stage right before the ball drops. Gush. Rumor and fake news is saying JS is in da city. Reunion? Wouldn't that be stellar. Oops, I think I creamed them over the thought. I will be reporting throughout the night on WNS's big News Year blowout. Hope to see you there big man <i>gives a wink</i>. TTYL!"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>Tom is visibly annoyed when the camera returns to him</i>Thanks Glit. I have prior engagement that evening so don't expect me.<br>Now over to Mac V on another gang incident. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. This is the third day in which turmoil and chaos is happening within the Haven districts. The NCPD have still not taken any action to quell the unrest. The barricades are still holding as fires and firefights rage behind them. No estimate on the damage, injured, or killed have been reported within. Surveillance drones have all been destroyed when sent to do any recon in the districts. It is still unknown when the violence will stop. The has been some reports that residents tried escaping, however they were pushed back by NCPD. The officer I talked to said they can't trust whether it is an innocent trying to escape or a terrorist looking to cause more damage to other districts.<br>On a happier note, Harden will be giving a report next Friday and will be returning to the air. He is excite to be back and looks forward to working with all of us again.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. It will be good to have him back. Harden has been missed during his recovery.<br>Now we turn to business news with Porche Hendricks. "},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Biotechnica unveiled plans to start an expansion to their soy fields south of Night City. They have announced a new strain of soy plant that can thrive in the harshest of environments. Rumor on the street is that they have been working the ESA to create these plants for the Mars colony, which is expected to complete next year. This breakthrough has major implications into expansion within the solar system. There isn't nothing confirmed on the viability of the new strain within space and extraterrestrial environments, but Biotechnica seems confident.<br>In other business news, OTEC along with Militech are rumored to have a big announcement on Monday. It is believe that it will change the current struggles with CINO and Arasaka alliance. I will keep you posted this.<br>Back to you Tom.  "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche. The Biotechnica story sounds fascinating. Great job.<br>Now to Isha Tomoda for local news. "},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. The NCPD still have no leads on the missing school bus. As you reported, 2 days ago in Rancho Coronado a school bus containing 5 high school students and the driver went missing. NCPD has report that tragically they have found the bus, but with none of the students or driver. The bus was abandoned and set on fire in the earlier morning, in the Evergreen district of Pacifica. No witness have come forward as of yet. The NCPD is still calling on any and all witness to this tragedy to come forward so the evil terrorist or terrorists behind this abduction are brought to justice as soon as possible.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Sad news to hear. Appreciate the follow up on this story Isha. Please keep us posted on this.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-29","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today Arasaka has announced major news around their security services within the city. Arasaka has taken on several security contracts with various companies across Night City with a start date of January 1st. This is interesting development since Mayor Ebunike's requested that they and Militech reduce their security personnel. The Mayor's office has voiced concerns over this news, however the free market can't be stopped. Arasaka representative voiced excitement on the new contracts. He said how they, Arasaka, look forward to working with local NCPD precincts in the areas to help bolster the security in the neighborhoods. The chief of police, Lamia Barr, expressed misgivings with this announcement, but feels optimistic of the benefits of more security on the streets.<br>Now to Isha Tomoda with a developing. "},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. Tragedy struck today at the City Metro Airport. A cyberpyschotic went on a rampage through the airport ticketing area. Police are unsure what triggered the individual, but he was reported to have the illegal black market cyberware known as Big Rippa. 11 individuals were killed and 12 severely injured. Max Tac was called in and quickly dispatched  the individual.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br>Now to Glit G on the Night CIty New Year Eve event."},{"img":"glitg","reporter":"Glit G","commentary":"Tic-toc to grand ol man dying off and the new baby year hits us with parenthood. Big news is blowout with, gush, Kerry Eurodyne playing at EBMs dropping of the proverbial ball. WNS has a stellar line up to blast off the new year right. I will be there shmoozing and clubbing with all the stars. Peeps be ready for 22 is going to be a prem start.<br>TTYL Tommy"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Glit<br>Next to Mac V on the latest situation in NC. "},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. Gang activity has been on the rise for the past several weeks. NCPD has little resources to address the situation. I was able to talk with Captain Brian MacElwee of the Precinct 2. He voiced a lot of concern at the response from the Mayor's office around the increase and the little budget given. The police union has also raised concern that the City Hall has given little to the beat cop in ensuring they have the proper resources to handle this rise in crime. Union official Al Jaskulski said if this continues into next year, he hinted that the union may need to strike. If that occurs, it would be interesting how the corporation segment of the city responds. Both are outraged at the news of Arasaka increased security forces in Night City. They believe it will lead to confrontations between the NCPD and Arasaka employees.<br>Also to follow on the story from yesterday, the Haven districts are still under quarantine. There continue to be gunfire heard from behind the barricade. Surveillance drones attempting to do fly over were attacked and destroyed. Fire are also seen, uncontrolled ravaging the district.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac.<br>Now to business news with Porche Hendricks."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Today the Antarctican Collective issue a proclamation against OTEC and CINO around their \"war\". An incident of sabotage happened to an OTEC facility offshore. 3 employees where injured during the minor explosion. The Collective proclamation will terminate all activity of both corporation holdings in their area if any more incidents occurred. They threaten with their full military force and will confiscate any and all assets within the Collective territory.<br>Back to you Tom"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-28","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Tragic news today as a community school transport went missing today in Rancho Coronado. The bus had five high school students and one driver. The tracking device, mandatory on all school buses, was cut off at around 3:17PM today. This is when the abduction is believe to have occurred. So far the NCPD isn't commenting on the current investigation. Viewers are advised to notify the NCPD with any information around this. WNS has also contributing a 2,000eb reward as well for any credible information on the whereabouts of the children.<br>Now to Porche Hendricks for business news. Porche?"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br>OTEC stock took a hit today as numerous incidents happen world wide to several of their facilities. Some have been identified as sabotage, some terrorist attacks, while others are still under investigation, The lose in resources as mounted to a drop of 3% of OTEC's stock today. This situation has helped with CINO's own stock with an increase of 2%. Both companies are still battling over control of the now defunct IHAG corporation. Neither have gain an edge with happen today, other than seeing a decrease/increase in their resources.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br>Now to Mac V for a tragic situation occurring in the west side."},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom<br>The city was in chaos on the west side. The districts of West Haven, North Haven, and South Haven saw gang violence erupt over night. Gangs with in the area were in an all out war. NCPD have quarantine all districts with barricades. Residents of the two districts are now trapped until the city lifts the quarantine. The city hasn't given any estimate on when this will occur.<br>Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Scary situation happening there.<br>Now to Glit G for entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Woot, woot, woot! Had a great night chilling at the Rainbow last night and saw a nova band, Too Shade of Satin. This 4 member band rioted the room. Singer An Gul had voice to raise the roof and hypno the peeps. She had a presence of the great, I would go as far as Silverhand level. The rest of the band was on point. Nailing the notes. Beats were stellar. This is an up and comer to keep eyes out.<br>FYI also synced with Sis-X, a great promoer for the westies. She gave up some great privo rumors on some of the hottest acts. Need to do the diggin to validate, but some hot neon data if true.<br>Back to you"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Glit.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-27","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>The Mayor has been requesting Arasaka and Militech to start reducing their presence on the streets of Night City. As reported earlier, both corporations have increased their staff and personal over the past week. Tensions are starting to show as minor altercations have been happening in Heywood as well as Corporate Center. The Mayor will be meeting with representatives from both corporation to discuss this matter further. We will keep you updated on the results of those talks.<br>Now onto Mac V."},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. Last night saw a major incident in South Night City. The gang known as Apostatas De La Muerte were hosting an unground blood sport event  when they were assaulted by two other local area gangs the Neon Brigade and the Omens of Downfall. Both gangs attack the unaware Apostatas. Several deaths were involved among the gangs as well as some other attendies at the event. Tragically, Astrid Bonhomme, wife of EBM Night City VP of Finances, Renaud Bonhomme, was among the dead. It isn't determine why she was there nor why Renaud was laid up at home after having major surgery. EBM official are investigating the incident to determine why such a tragedy happened to one of their own. I was able to catch up with a member of Neon Brigade. He informed me that the Apostatas was working with arms smugglers to gain weapons to expand their territory into the Brigade's and Omen's. He also mentioned it was a matter of love as well. When I asked him to explain, he took a hit of Black Lace and went on a diatribe of a kidnapped girl, held by pirates and a the finance of her was looking to get her back. The Brigade couldn't refuse. I am chalking this up to drug induced delirium. NCPD isn't investigating further into the matter. Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Scary stuff happening in the combat zone. Now we take a look at business news with Porsche Hendricks. Porsche?"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. We start off with the conflict between OTEC and CINO. One of CINO's facility exploded off the coast of Madagascar. Initial reports indicate there was a faulty fuel line that sank the offshore rig killing 38. Luckily the rest of the 370 crew were able to evacuate and make it to safety. CINO and Arasaka have done initial investigation and believe that it may have been the work of saboteurs. Arasaka issued a statement that they will be doing a through internal audit of the security measures in that region. This is a bit of a blow to CINO image as well as Arasaka's security.<br>This was not all the bad news for CINO as one of their partnering banks,  Securite Solide Banque, has been found to be laundering money of Indian Sea pirates for the past few years. European Financial Security Commission has mounting evidence against the bank and believe Eurobank will be taking over its assets. Luckily for CINO their account with the bank have been liquidated and return to the company, however this cuts possible loans with Securite Solide Banque. This may decrease the fluid capital that CINO can borrow against for their continuing struggle with OTEC of IHAG. Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Great reporting Porsche. Now we go to Isha Tomoda. Isha?"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. The Red Chrome Legion has again stirred up trouble on the streets of Night City. This time outside of their usual hangouts. About a dozen members invaded the Night Owl bar on top of Bay Bridge Residential Hotel. At first they showed no signs of malicious intent. However, as the night progressed the Legion members became more rowdy. The bar security was called in. That is when the fighting erupted. The aftermath was 3 security guys critically injured, 4 patrons dead, and 11 injured. The legion lost 2 members in the fight. I spoke to some witnesses on the scene. They reported to me that the Legion was looking for an individual. It is unknown if that they were successful or not. The NCPD are investigating and currently are giving no comments. Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-26","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>In the news today is the daring kidnapping by a team of terrorists. Their target was one Dr. Evangelina Noppachorn from Bionetics Medical Industries. She was a top biotechnology researcher for the firm. She was attending a a holiday party hosted at the Biotechnica offices Friday night and was taken while leaving for the night. Her security detail was overwhelmed and the perpetrators were able to subdue her. The kidnappers were able to suppress and of her location signals. It is still unknown who had taken her or for what reason. No ransom demands have been made.  The CEO of BMI had a statement that these terrorist will be sought after and a substantial reward is being offer. Biotechnica has also made a statement that they will be working with BMI and contributing to the reward money. Please visit either corporations net address if you have any information that may help with the recovery of Dr. Noppachorn.<br>Now to entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Ugh. Brain still rebooting from Eve. What a show! FYI Mountain Joe's ruum of size is hella true and ain't no implant! That was a peak to climb for. Winky. Sorry Heidi but your lose is my o.<br>I was also able to talk with Sarah  O'Connor that night. She'll be performing in Berlin for NYE. Got a lot of hype over there. She also plans on starting her Euro tour that same night. Length with be 6 months before hitting the e coast and making a path to NC by end of next year. I'm out. Need more aspirin and hydrate more to be back to 100. TTYL T"},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Interesting reporting as usual Glit.<br>Now to Mac V for local news. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. <br>A bit of an ecological disaster occurred last night off the shore of Pacifica. An unregistered transport sub hit bottom breaching its hull full of crude oil. Luckily not all compartments were breached and only an estimated  500 gallons contaminated the waters. Residents were required to not approach the beaches and waterfront while clear up crews are currently working around the clock. The vessel belongs to Petrochem.  Billy Joe Brentwood, executive of operations of the Night City offices was reached for comment. He stated that his offices are unaware of any unregistered assets of Petrochem in the area is will be doing an internal inquire into the matter. The mayor's office has issued a statement as well, that they will be performing their own investigation. The submarine has been taken into custody by the Harbormaster and will remain so for the immediate future.<br>Also an update on Harden. He has made a full recovery and will be returning in the new year."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Great news Mac. Harden's colorful commentary has been missed.<br>Now to business news with Porche Hendricks."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Lockheed-Cessna has unveiled its new Sea Rescue AV. The AV has the ability to land and take off in water as well as stay afloat. This innovation will dramastically increase the any water rescue operations performed by government or corporation agencies across the global. OTEC in conjunction with Militech have already place an order for 500 units which will be delivered by the end of January. CINO has also put in for only 200 units. Lockheed-Cessna stock saw a 2.3% increase today and is expected to continually increase throughout 2022. <br>In other business news Orbital Air has announced plans for a new Space Ark line of interplanetary travel. The scheduled completion of the Mars base in Q3 of next year, Oribtal Air expects the race to start colonizing the red planet to be at the forefront of expansion. This line of space craft will at first be for cargo shipment. It is then expect to include travel and leisure lines with the following year. OA hasn't set any firm dates on when these will be available, but sources say it will be most likely in mid 2024. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche. The solar system is about to get a whole lot bigger.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-23","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today marks the 1 year anniversary of the Regal Hotel Massacre. During a business convention, 12 hundred individuals lost their  from a terrorist attack in one of the ballrooms at the hotel. The murderers flooded the room with biotoxin gas while hacked into the hotels computer system to seal the doors. In 2 weeks the convicted members of the terrorist group, called The Amber Assault, will be put to death. Their motive was to that members of Quantum Synthesis corporation killed their friends and family. There was an accidental leak of Dimethyl Cadmium in the neighborhood the terrorist lived at the time. Official ruled in favor of Quantum Synthesis, leaving families of the victims without compensation. The 6 members of Amber Assault will be executed through lethal injection. It is good to see that justice brought to terrorists like this.<br>Now to Porche for business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Today Fantasy Unlimited in partnership with Orbital Air unveiled their new experience, Space Voyages. The company, well known for providing fulfilling its exclusive customer base with making their dreams come true, is now offering outer space fantasies. Alice Forge, CEO of Fantasy Unlimited, expressed her excitement at these new opportunities to her clientele. Orbit Air representative also voiced their optimism with this new venture. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Thanks Porsche. I have yet to use any of FU's service, though I trip to space would be enjoyable.<br>Now to Glit G with the entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"Patch to #HardyGoneNotForgotten. Ice from Blood & Ice has decided to go forward and is looking for a new drummer to replace poor Satellite after his tragic death. Ice give me the detes that auditions will be happening soon. I'm sure the corpos aren't too upset to see B&I silenced for a time with their anti-mega messages. Oh, don't memory wipe! Tomorrow is the big gig. Make sure you tune to 54 my chooms!"},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Now onto to Isha Tomoda for an update on yesterday's New Harbor Mallplex break in. Isha?"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. As you and the viewership are aware, the mallplex was broken into the other day by a group of unknown assailant. Today the NCPD performed a raid against a Valentino hide out and uncovered about a quarter of the stolen merchandise. During the arrest 3 officers died and 4 injured as the Valentinos open fire on the NCPD officiers. The Valentinos suffered 12 deaths and the 2 that were taken into custody are in serious condition at Night City Medical Center. I spoke with detective Pranit Volimiri about this incident. He told me that it is undetermined if the Valentinos were the culprits who performed the heist or purchasers of the stolen merchandise. The investigation is still open. back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br>This news team will be off for the next couple of days enjoying the holiday. The WNS News Force Team wish to thank our viewership and wish them a happy holiday, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-22","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>NCPD has announced they will be increase their presence around the city in preparation from the holiday this weekend. As some of you viewers know, last year the notorious Philharmonic Vampyres caused mayhem throughout the city dressed as various version of Santa Claus. Some incidents where benign, such as handing residents pieces of coal laces with contact hallucinogens. While others were more serious such as the burning of the tree in corporate plaza. Night City residents are strongly recommended to not accept any gifts from Christmas characters and if you see suspicious activity notify the local police or security officer.<br>Now to Glit G for entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"2 days and counting. Heard poor Mountain Joe suffering from a lonely heart. Him and his wife, Icelandic supermodel Heidi Toadottir are split. Sad for her, boom for me. Meeee-yow. Other biz news, Dodalido from the children show Superbrain was cuffed 'n stuff for kiddy BD. Oops. Talk about an addict in the opium den. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Porche is here with business news. Porche?"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"The report on CINO's involvement with child labor has been disprove. The Malaysian facility was acting on its own. Evidence shows that CINO's directors were kept in the dark and was deceived by the head of the facility. Even with this report, CINO did donate over 30 million euros to Malaysian Society for Children, an organization that provides food, education, and medicine to the local children of Malaysia. Eurounion has ended its investigation. The Malaysian government has arrest all the members of the facility that were involved in the matter. However this hasn't helped CINO in the past few days especially with its procurement of IHAG assets. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porsche. Tensions are still high between all the corporations involved. Militech announced today that they have increased their staff in Night City by 30% as well as a 20% across all of OTEC facilities globally. Arasaka has yet to respond to this escalation. I am sure we will see more on this in the coming days.<br>Now to Isha Tomoda for a report at the New Harbor Mallplex. Isha what's the latest?"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. Very earlier in the AM there was a string of robberies among selected shops and boutiques at the New Harbor Mallplex. They start soon after a hacker attack against their system. Within minutes, Mall security was overtaken by a group of thugs. The perpetrators then started ransacking Docs R Us,  Morgan's, Softare Inc., Rachet Computers, and for unknown reasons New World Pets.  and estimated 600,000 euros worth of merchandise was stolen. So far the NCPD have no leads on who this group was and are asking residents to please notify them with any information leading to apprehension of these thieves. Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha. Any updates on the Mad Hatter case?<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"I'm afraid not Tom. The NCPD homicide department still is silent on the current status of that case."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"We will keep our viewers up to date with the latest on  it.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-21","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today in Los Angels an OTEC sub was assaulted by terrorists. A firefight erupted between them and the Militech security. The fight was intense however the sub was lost. The sub was a transport that was carrying an experimental enzyme used to advance genetic research. OTEC stock suffered a minor lose in the market.<br>Now to Mac V."},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. Militech has implemented higher security measures around their Heywood training facilities. Arasaka has also increase security measures around their facility in Heywood as well. Both companies have seen an increase in minor terrorist and criminal activity against them in recent months across the global. Representatives from both corporation claim these are just training exercises as their involvement with in the CINO/OTEC struggle has been growing rapidly. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"I can imagine how things are tense with both corporation especially after the incident in Los Angeles.<br>Now to Porche for business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Today the Japanese corporation Shitoraki had to issue a recall on their latest Domo-Bot model 6, a domestic cleaner bot for the home. This was due to faulty materials used by their manufacturer were prone to battery leaks causing toxic contamination, deadly to small animals and caused burns to skin. Shitoraki has seen a sharp stock decline with a lose of 8.6% in one day. Representation from Shitoraki is accusing the manufacturing company, Elnis Productions, for the issue. However it was determine that Elnis Productions is a subsidiary of Zaccaro Illimitato which is an affilidated company of Shitoraki. Japanese, USA, and European officials have issued fines of $290 million euros for the incident. Shitoraki is working on their PR right now with a campaign across the world replacing the model with their model 5 as well as 500 euros to each owner for any medical bills due to this leakage. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Porche. I believe I had a few of those units at my residence. Shame, they were very useful.<br>Now to Glit G for entertainment news."},{"img":"glitg","reporter":"Glit G","commentary":"New Move biz just hit. Roxanne Murphy will be starring in the new BD slated for Q3 22. Rox will being a nomad looking to trend  in NC. Rom and dram will be da theme. As you remember Rox appear in Moon Ace with Doug Anthony. Heard room that D may be a love interest as the chem with them druing Ace was digital! I wouldn't mind being Rox's joytoy any day. Back  to you T."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Glit.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-20","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today InfoComp's Toy drive charity event was a major success. They were able to raise well over 200,000 eb in donations and several truck loads of toys. I host the event and the crowd was great. From one of the planners I was informed that NCPD had to engage with some members of the Bozo gang. Luckily the incident didn't escalate to jeopardize the event.<br>Now to Porche for tonight's business news."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"In Business news today Williams Management Inc has announced its acquisition of Harmse Reality in South Africa. This allows WMI expansion into the hot reality market of Africa and the OA territory. This has seen a 12.4% increase in WMI's stock. When asked if this was just the start of Williams Management expansion, CEO Marshall Williams replied that he was allowed to say that they are in negotiation with a firm in central Asia as well as Antarctica. The market will show how well this news is received. Back to you Tom. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche. Have to say that I have had experience with living in one of Williams Management's property and glad for their success. <br>We now turn to Isha Tomoda for her report on recent development. Isha?"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom. The streets of Little China erupted in violence as a clash with the Tong and Red Chrome Legion. Witnesses report that the Legion members were on the prowl along Orient street. The gangers started in on some individuals outside of Ling Po Imports. Things escalated as member of the Tong were quick to engage the Legion members. As the confrontation continued more members of both groups joined in. Gunfire and street brawling last about 2 hours with the NC riot police stormed the area. It is estimate that 21 are dead, 7 Tong, 9 Legion, and 5 bystanders. The injured have yet to be estimated. NCPD doesn't know why this quickly got out of control. An investigation into the matter is ongoing. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Very interesting. We will keep the viewers update on this.<br>Now for entertainment news with Glit G. Glit?"},{"img":"glitg","reporter":"Glit G","commentary":"What? OMFG Sad emoji. #HardyGoneNotForgotten. Last night local music scene was gut ripped with Hardy Satellite's death! Drummer of Blood & Ice killed himself when he commanded his roadies to use him as a battle ram to try to break into lead singers Ice's motel room. The door was reinforced and poor Hardy's skull doom took a lethal blow. The band is so dumbed by the emo blow. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Sad to hear that.<br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-19","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>We start off with Mayor Ebunike annual attendance at the Night City Order of Blue Shield charity event. The Mayor was dressed up as Santa, a tradition first started by Richard Night, hand out gifts to children at the Lake Side Bandstand. The crowd was estimated over 5,000. However the event turned sour when event sponsor didn't have enough gifts for the children in line. The crowd turn ugly as the mob start throwing debris at the police and staff. NCPD was required to disperse the the rabble using tear gas and tasers. Luckily there were no deaths though there were 100 of injuries ranging from minor to critical in some cases.  The Mayor's office has issued a statement that this will not prevent from next year's event and that better planning from the event planners will improve so this situation doesn't happen again.<br>We turn now to entertainment news with Glit G. Glit?"},{"img":"glitg","reporter":"Glit G","commentary":"Top Detes is Sarah O'Connor will be live on WNS's Christmas Eve Extravaganza Show airing next week. I will be hosting the event and Sarah will be sing some of her latest songs. There will be a giga amount so of cameos. Also Face Boys and Azakuchi Toranoga will be  performing. Mucho others will be dropping by. I'm looking to corner Dario Ferron, quarter back of the Rangers. Me-yow. "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Glit for the update. Next we turn to Porsche Hendricks for the latest report on the CINO/OTEC acquisition of IHAG. Porsche?"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Bad news for CINO today when it was revealed that one of its facilities in Malaysia was operating with children under the age of 10. Though that nations labor age is 12, this has caused an uproar with the business community around the world, more in CINO's home nation of France. The Euro has started an investigation into the matter to determine if CINO was complicit with their Malaysia facility. This is a blow to CINO image international and especially with its current battle with IHAG acquisition. OTEC, CINO's rival in the acquisition, gain more IHAG assets due to this report. <br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porsche. Great reporting on the current conflict for the two corporation. <br>Up next in Mac V with some local news. Mac?"},{"img":"macv","reporter":"Mac V","commentary":"Hi Tom. Last night the Marco Mula, son of Alan Mula, Microtech's Director of City liaison, had a kidnap attempt. Marco was recover by a rescue team from Orion. Marco is currently attending Night City University as a post graduate. He was abducted from his dorm room by an unknown terrorist group. He was only captured for little over an hour before the Orion team was able to recover him. They found him in the basement of an abandon tenement. NCPD is investigating the incident as well as Orion into the matter. However details from the precinct mentioned that the security footage from the campus was corrupted and no leads are available now. Any eye witnesses are asked to come forward with any details that would help with the investigation.<br>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac<br>Lastly as a personal note, I will be hosting the InfoComp's Charity event at McCartney Stadium tomorrow afternoon. This is a toy drive for the unfortunate of Nicght City. Please bring a non-perishable and non-toxic toy as entry fee. Fun and excite is to be had by all. Several different activities will be going on throughout the stadium. <br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-18","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today we saw riots break out in east South Night City as fans and others reacted to the sentencing of music band Fusion Hydrant and 3 of their groupies. I turn to Glit G for more details on this story."},{"img":"glitg","reporter":"Glit G","commentary":"Sup TP. The scene is blitz! Piggywiggies have sent up barriers in da hood cover 8 blocks. Looting, rioting, fires, and mayhem broke out when the Fusion posse got the big D handed down to them. If you ain't in the know, those chromers 'napped VP of CM for Fantasy Unlimited, Victoria Branco. They demand the CEO to admit on stream their biz was into human trafficking. Blah! I know Alice Forge and it's fake news. So when she's said nada, they executed Branco live! OMFG! Today those dimheads got the judge and the death penalty. Some of their fans took to the street as well as other who've claimed they've had family friends boosted by FU. The rioters are contained by the boyz in blue for now. Back to you Anchorman! "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>*Tom Phillips is noticeably annoyed with Glit G's last remark*</i><br>Thanks Glit. Now we turn to business news with Porche Hendricks.<br>\n<i>*The mic doesn't cut out immediate and you hear Tom yelling in the background. \"I told that @#$% never to call me that on air!...\"*</i>"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Uh, thanks Tom. Today we continue to see terrorist actions against OTEC/Militech and CINO/Arasaka facilities. Minor damage and sabotage have been occurring through out this past month between the four corporations. Neither OTEC or CINO are close to taking over the now defunct IHAG. This is one of the longest fights between megacorporation we've seen in recent history and there are no signs of it ending soon. <br>\nIn other business news, Revolution Genetics has unveil they are finishing up a nanite treatment that could reverse the effects of Alzheimer and other brain diseases. They studies have shown a 95% success rate with little to now side effects. This is a big win for the corporation as their stock have increase by 220% when this news broke. Back to you Tom "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Porche. Before I continue I would like to apologize to the viewers at home and to Glit G for the nasty word I used on air. It was unprofessional, unmanly, and very insensitive.<br>\nMoving on to Isha Tomoda with a report of an incident that occurred in West Haven district today. Isha? "},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. A gang war erupted outside the Neal Stephenson junior high in West Haven district. It all started when representatives from Microtech was visiting the school to provide computers and other equipment to the children of the school. This was interrupted when members of the Blood Razor gang and the Apostatas de la Muerte gang clashed. Both gangs attempt to steal what Microtech had and then fought against each other. Trauma Team was able to extract the Microtech employees. However only 2 of the 7 employees survived. Thoughts and prayers. The street is still chaos and from the reports of witness on the scene the school as set ablaze and none of the NCFD were able to get to it in time. Tragic. Back to you,,, Anchorman."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>*Tom noticeably grimaces*</i><br>\nThanks Isha. Sad news indeed. Viewers should note that currently West Haven is now considered a Red Zone and should be avoided. <br> In final news, there was an explosion on the construction site of the new arcology. There was a gas leak and investigator believe the explosion was cause by negligence of one of the construction crew. 7 people were killed and 12 injured. This has also set back the project completion date by 4 months. Investors are concerned as there has been other set back in the past few months around this project. <br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-12-17","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>In a stunning act of heroic, an extraction failed for a terrorist group on the Bay Bridge this morning. The COO of EBM North America, Marcus Dessauer, was thwarted by an EBM strike team. Mr. Dessauer was riding in a limousine and while crossing the Bay Bridge the limousine was attacked by a group flying an AV. This terrorist group was able to pull Mr. Dessauer from the car and loaded him into the AV. As the AV was attempting to flee the scene, an EBM strike team that was shadowing Mr. Dessauer leapt into action, literally.<br><i>Video of an AV lifting off from the Bay Bridge as the strike team exits from a van that was a few cars back. As the AV takes flight, one of the strike team members leaps into the air, about 30ft and stabs the AV bay door with a katana. This member proceeds to break into the AV.</i><br>Amazing! Mr. Dessauer was safely retrieved from these terrorist and is now in an undisclosed location. EBM was reached for comment and said<br><i>We are grateful Mr. Dessauer is safe and unharmed. The unknown extractor however killed 3 of our security detail during the kidnapping. Through the skill and expertise of our other security colleagues, they were able to prevent the extraction. EBM is proud of its members and their willingness to defend our colleagues from evil doers. EBM will also contribute to any repair efforts that this incident may have caused. Thank you</i><br>We go to Mac V who is live on the scene. Mac?..."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. I'm standing in the upper marina talking with the some of the eye witness and NCPD that are here. All of them were awed by the dramatic rescue. The NCPD have yet to determine who the culprits are. All of them, 5 in total, however were killed during the ensuing fight with the EBM strike team. None of the names of the EBM security detail have been released and they are not within custody. There was some minor damage to the bridge due to small arms fire and caused a major delay in traffic this morning. The bridge is open now and traffic seems to be moving. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Wow. Just wow. Let's go to Porche Hendricks for business news today. "},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Today marks a week since Netwatch placed a 12 hour embargo on Arasaka and Miltech. Netwatch imposed this penalty due to operative from both corporations causing chaos in the NET. This however didn't seem to slow either of their activities from continuing. Arasaka has made its presence known within the Night City data grid. Militech seems be quiet about this currently. Though Militech has up its security details around their facilities within the city. Both company's stock have stabilized as well as CINO and OTECT who both companies have major contracts with. There are still incidents around the world between all 4 corporations and it doesn't look like they will be slowing down anytime soon. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Nice reporting Porche. On to further local news. For that we turn to Isha Tomoda."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. Last night yet another victim of the Mad Hatter was found. This time wandering the New Harbor Mallplex. The victim was found in one of the restrooms on the second floor of the mall. They were found putting on makeup over and over again. At first patrons didn't realize the victim was deceased. NCPD quickly remove the victim from the facility. When questioned about the investigation, detective Sarah Miller replied with \"no comment.\" Citizen are still wary if the NCPD will be able to track down this serial killer. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Very macabre situation with the Mad Hatter. I hope all the viewers at home take precautions and remember. If you see something, say something. <br/>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-09","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Mayor Ebunike had a press conference on the steps of city hall today. He talked about a plan to improve police and security in the city. The law enforcement bill would triple the police force and cost the city and estimated 136 million euros. It will also impose more corporate responsibility in this aid."},{"img":"mayor","reporter":"Mayor Ebunike","commentary":"We are one people. One city. All need to pay our dues to the community at large."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Assistant Mayor Garven Haakenson was interviewed after the conference and here's what he had to say:"},{"img":"asstmayor","reporter":"Assistant Mayor Haakenson","commentary":"I support Mayor Ebunike in his decision, but how the city is going to pay for it and how it's going to be enacted, is unrealistic."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"People are wondering if the Mayor is going to far. Since his re-election he has made several policy changes that contradict his 1st term. Before he supported the corporate rights, some would say, over the well being of the general populace. Now the Mayor has vetoed several bills that would be beneficial to corporatoins doing business in the city. Will the Mayor's plan succeed? We will see.<br/>Now over to Isha Tomoda"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom.<br/>A major robbery yesterday leaves both Mustang Arms company and NCPD upset. An estimated 1,000 small arms, along with ammunition and other ordinance, were stolen from Mustang Arms in the Upper Marina.<br/>Authorities say that the robbers were well organized and maybe an inside job. Mustang Arms security computer was hacked from a back door that wasn't there when the system was installed. With the security offline, the robbers pulled up a truck, engaged and overtook the night secrity at the plant, and then got away.<br/>NCPD says they have some leads but would not discuss any details.<br/>Mustan Arm's representavit had this to say<br/>\"This is a tragedy of our times. Mustang Arms is doing all it can to get those weapons back. I know, I know, NCPD will be doing their job on recovery. However, Mustang Arms has posted a 200,000 euro reward for the location and acquisition of our stolen goods. I know we'll be getting tons of calls, but unless you have concrete proof, don't bother calling the hotline. Our lawyers will come after all false leads with not only charges bought against you but also a hefty lawsuit.\"<br/>Who the culprits are we will learn soon enough with a reward like that. Reporting from the Upper Marina, I'm Isha Tomoda.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha<br/>Now I'm going over to Mackenzie Voret filling in for Harden Torres."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom.<br/>Gang violence continues as Blood and Tears gang clashed with the Wang Fong Tong near the arena yesterday. The skirmish cause a lot of damage to the arena. Not only that, but Boozo activity around NCU has increased. More fights between Wild Things and Game Boyz also occurred with a shoot out in the McCartney Stadium parking garage. With all this violence occurring I wen to the street and ask people their opinions.<br/>\"The streets aren't safe anymore. My niece was killed 4 months ago from a stray bullet in a shoot out. The Mayor needs to do something!\" - Mayne Moore<br/>\"Your telling me. We can't fight this shit without clamping down on everyone, and I mean everyone!\" - Sgt Skaletty NCPD<br/>\"I say the Mayor is an idiot and he needs to stop blabbing and do something!\"- Annoymous municipal worker<br/>\"Violence? Gangs? Hell ya! We all need to jump in the handbasket and start fraggin' each other! Dat's the bit Gato! Chrome out! Shoot out!\" - Skitterboy<br/>Opinions are all over the place as you can see. The Mayor's new planned law enforcement bill may be enough. But is it too late? That's to be seen.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Hey what's the word on Harden? Is he going to be OK?<"},{"img":"macv","reporter":"Mac V","commentary":"Hard to say Tom. He was injured pretty badly with the bozo attack. The ganger used a creampie mixed with acid. From what I was told, Harden needs extensive surgery and some implants. He will be out for a while."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks for the update. Our thoughts and prays go out to all the victims that were there.<br/>Now to Porche Hendricks with the business news."},{"img":"phendricks","reporter":"Porsche Hendricks","commentary":"Thanks Tom.<br/>IEC has announced today their next generation wearable computers. No long do you have strap on the various components. Now it is as easy as putting on your clothes. That's because it is your clothes. Their system interweaves the wiring and hardware into the fabric. Also with holographic technology a keyboard is a thing of the pass. Now you cna look good, be unencumbered, and have all your computing needs at your fingertips.<br/>IEC unveiled this new line at the Lurveire Fashion show in New York City. Several designer outfits were on display. Most critics loved the style and fashion IED brought to the table. Also the market has shown its support with IEC stock gain of 4.6 points today.<br/>In other business news, the decline of CINO, OTEC, Arasaka, and Militech's stock stopped today. All four corporations have suffered for this, now dubbed, Corporate War. They've been having this battle over the bankrupt company IHAG. Their stocks have lost major numbers since the beginning of the hostilities. With Eurobank's decision to halt the sale of IHAG stock, these embattled companies are finally leveling out with their market prices.<br/>What will the future hold for these giants? My guess is two of the companies will go down, while the other will get back their losses and then some.<br/>That's business for today. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br/>Finally in a joint actoin, Militech and OTEC forces attacked an abandoned refinery off the shore of San Diego. A meeting of several pirate bands was taking place at the time. The pirates were taken by surprise according to one of our field reporters. Militech and OTEC took hardly any loses. The pirates were decimated during the assault.<br/>Representatives of Militech said the raid was in response to several attacks against OTEC facilities. The refinery was in international waters, so the US Coast Guard weren't called in. One curious thing was our man said one Tokushi Mamasume was found among the dead. Mr Mamasume had Arasaka credentials on him.<br/>We contacted Arasaka corporation for comment on the matter. They deny any involvement and that Mr Mamasume was being investigated for misappropriations of funds. He was about to have charges brought against him before he disappeared 3 days ago. Of course Arasaka might just be denying this to cover up a possible involvement. No hard evidence was found but I'm sure Arasaka will respond against Militech and OTEC's hostility in conjunction with CINO.<br/>That's it for the news. For WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-08","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.  Top story of the day is the merger of BMS Surgical andn Dornier-Bauer Biotech. For more on that story I hand it off to our business analyst Porsche Hendricks.<br/>Porsche"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br/>BMS Surgical and Dornier-Bauer Biotech have decided to join forces. BMS Surgical, a leading company in surgical equipment and pharmaceuticals, has recently expanded their interests into cybernetics and biotechnology. To help them more in that market they started talks with Dornier-Bauer Biotech, a Germany company already in the field. After negotiation, BMS Surgical CEO and Chairman Jeff Terlin made an offer to DB which was accepted.<br />[Video of a man in a business suit. Caption reads Jorge Sanchez - President of PR for BMS Surgical]<br />\"This merger is a good fit. Both of our corporations realized it's the best move we can make.\"<br />\"CEO of Dornier-Bauer Biotech, Gustav Rottergaun, will remain as CEO to head the new corporation, which will be called Bionetics Medical Industries. We are all very excited about the changes and can't wait to get started.\"<br />Rumor also has it that one of the leading cybernetic company might be joining this merger. If so, the corporation may become the largest medical corporation in the world. Biotechnica will need to start watching their profits in the coming years.<br />Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porsche<br/>Onto further news. Last night the streets erupted again near NCU. Our man Harden Torres is on the scene."},{"img":"htorres","reporter":"Harden Torres","commentary":"So gangs are still at this time the boo...AAAahhhhh!!!!!<br/>[Video show Harden infront of a crowd of gawkers behind police tape. Before Harden can finish his sentence a Boozo comes up behind him with a pie and slams it into Harden's face. Harden starts to scream as he tries to wipe what appears to be cream off himself only to reveal he is wipe flesh and blood as well. The camera cuts out as the boozo advances on the camera.]"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"[A stun and speachless Tom Phillips comes on. He looks off camera and barely audible he says \"Tell me you got that on film? Yes!\" as he smiles. He turns quickly to the camera with a more somber look.] <br/>Well it appears that the Police still have a situation at NCU. Here are some messages from our sponsors...[fade to black]<br/>I just wanted to update our watchers on the incident with Harden. He is currently at Night City General, stablized, but still in critical condition. Also WNS 7 camera man, Bill Stevenson is also admitted and is in critical condition. We will keep you up to date on their condition. Tragic. Now over to Glit G and the entertainment report."},{"img":"glitg","reporter":"Glit G","commentary":"Arigat T. Glit G, your reporta with the forte, here with the last action. Who was caught in a threesome with an underage boy? Tell ya in a bit.<br />I want to turn your attention over to the hot new band, Disciple Digital. Their quasi-techno trance chant has been spread across the airwave like photons in fiber optics. I was able to chat a bit with their lead singer Mal.<br />[Video of Mal]<br />[Glit G off screen]: So Mal, what's up?<br />[Mal]:Our new dlows are netted. Da tour ETA is less than 7 ds. We're really pulsed bout it. Can't wait. GTG Cya.<br />[Camera comes back to Glit G]<br/>Ain't he chipped?<br />In other biz, you gotz 8 days to plug in and get your ticks for da CybVyb rave! Ticks might be sold out, but there is the 2nd market to shop. And speaking of that rave, check out Fallen Mars 3 nights from now at Club Atlantis.<br />G out!<br />Oh, oops, almost wiped on the tease!<br />Well the mega perv O-ki-gray was caught giving it to a minor yesterday.Apparently him and his wife are being sought after.Too bad they hit T-land before the oinks collared him.<br />Whelps GTG. Back to you TP."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks G<br/>Lastly, in international news, Eurobank has exercised its custodial power over all of IHAG stock. This has banned both OTEC and CINO, along with everyone else, in buying IHAG stock. This move has angered both OTEC and CINO investors.<br/>The exact reasons behind Eurobank's ban are unknown. Since last year, after IHAG's bankruptcy, Eurobank took control of IHAG. Both OTEC and CINO have been anxious to acquire the company's assets. OTEC and CINO have been suffering from terrorist attacks and other misfortunes. Each corporation procured security companies to help them deal with these situations. OTEC hired Militech and CINO hired Arasaka. The terrorist actions didn't abate, in fact the number and frequency grew. Not to mention, Militech and Arasaka have also been suffering attacks against all their assets as well.<br />Now with Eurobank's decision, will the situation improve? This reporter's opinion is \"no\". Militech and Arasaka are two military giants. Now that both are in this arena, I have little doubt that both won't leave it alive.<br />For WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report 2021-07","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Good evening, I'm Tom Phillips. Today mark the breaking ground ceremony of the new arcology. Seven representatives were on hand, each from an investor in the new project. Bank Arasaka, EBM, Utopian Corporation, Halicyon Industries, World Bank, Tallan Financial, and the mayor himself were the first to dig into the ground.<br/>[Video of the 7 representives with shovels digging into the ground.]<br/>The project is expect to take 5 years for Phase 1 to complete at a cost of 65 billion euros. The new facility will be modular in nature, easily updated. Initial construction will be able to house 500,000 people. The arcology will be self-sufficient, facilities for food production, water purification, and waste facility will be all contained. The project is to be a tiered structure. Reaching 100 stories within the 2nd year.<br/>Some critics object to the facility, saying the cost to the government is too much, with little benefit to the community in general. They also cite the influx of 'migrant' workers. The increase the Night City population will cause a strain on the city. Not to mention the increase security risks to the city with the possibilty of crime growing due to this unchecked population growth. NCPD is already stretched to its limits and can't deal with such a drastic population increase.<br/>However, all the corporation assured the people with speaches, as well as Arasaka's commitment to the project, to guarantee they will help the Night City law enforcement with anything needed.<br/>Now to Isha Tomoda."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom.<br/>The Mad Hatter struck again yesterday. This is the Hatter's 9th victim to have surfaced. The victim was a Zoe Zero and was found in the parking lot of McCartney Stadium in downtown Night City. Like the previous 8, the victim was found with a hat on, tag still attached. The hat is used to cover up the cranial implants that the Mad Hatter is known for.<br/>This time the victim was found dialing a phone. Though clinically dead, the animated corpse was punching in the numbers to the phone over and over before the authority put an end to it.<br/>[Video of a woman sitting in a parking lot surrounded by cops. Finally one of the officers walks up behind her and raises a machete before the image is cuts out.]<br/>\"This is sick. This guy has no morales or soul. We will find him and put an end to this gonk. A slow, painful end.\" Police Chief McQueen was quoted as saying about the case.<br/>For those viewers not following this story, the serial killer, dubbed The Mad Hatter by the media, takes SIN-less people and installs crude cerebral implants. These implants override the victim's nervous system, post mordem. The victim's body are sent to shocks to various neural paths causing their corpse to become animated. The first victim was found a little over six months ago and his victims are being found more frequently. It has been less than two weeks since the 8th victim was found.<br/>Police believe the killer is a ripperdoc gone over the edge. Authorities claim they have suspects, but no arrests have been made yet.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br/>Tragic events. The News Force 7 team sends our thoughts and prays to the families of the victims.<br/>Now over to Porche Hendricks business report."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br/>Biotechnica has unveiled its new tailored retrovirus to increase a person's reaction time. Safer than speedware and neural processor upgrade. This is bioware, genetic, and less intrusive. First seen in the euromarket, now has come to the United States.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br/>Now to our man on the street Harden Torres."},{"img":"htorres","reporter":"Harden Torres","commentary":"Gang activity has been elevating over the past month. The gang violence is exploding. Maelstrom made a major raid against the Silver Slashes. Authorities say that Maelstrom are expanding their territory and are putting to the slab their old rivals.<br />The raid surprised Law Enforcement with its visciousness and firepower. The Police are investigating, but it was leaked that military hardware was used in the assault. Missile launcher was mentioned during a debrief, but this is just a rumor and NCPD spokesman has no comment.<br />Also, 8 members of the Blood Razors were found killed in a parking lot near the gang neutral club, Slammers. NCPD says it was a case of vigilantes, but as always, still investigating the matter. One eye witness who talked to me claimed it was a deal gone wrong. The witness told this reporter that some corporate suits was giving the chromers equipment, supposedly to help some nefarious business scheme. Things erupted when one of the gangers declined the job. The suits drew guns and laid waste to the chromers, who were unarmed at the time, according to my source.<br />Again, the people need the NCPD to do something about this blatant risk to the public safety. I urge our watchers to contact City Hall and put pressure to get something done about this gang violence. And to persecute the corporation that are backing some of these criminials!<br />Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Always insightful Harden.<br/>Let's go over to Glit G and entertainment news. Glit?"},{"img":"glitg","reporter":"Glit G","commentary":"Bop bop TP. The band CybVyb is schedule to play the Stadium. Fans are anxious for the scene with the lineup including Full Burg, Neon ONe, Stab, and the local band, Fallen Mars. Concert promos are expecting sell out, so get those scalpers to hand over those ticks. BTW a small number of tickets are still floating around at the McCartney from what I hear, so get that NCART pass out and take a trip down.<br />There has been a concern over the recent gang heat, but like the Madman Cooper, concert promo extradonaire says that sec will be locked tight.Madman mentione to this little hottie that Militech's boyz will be the muscle at the show. Their contract is all set and there if full confidence that they will take of any glitches some nob-numb might throw down.<br />This is a surprise as the Madman exclusively used Araska blacks in the past. Will there be a fallout from this?<br />[Video of Madman Cooper]<br />\"Nonsense. Arasaka is chipped, doomo chipped. But Militech pull out the low bid for da op, period. If the boys in black don't like it, all they need to do is blue light the price in the next gig. Suffer the deficit of biz gato! *bark, bark, Hooowoooooo.......*\"<br />This comes during when both Sec Corps are locked in opposing contracts with CINO and OTEC. A major slight to Arasaka with the Camo boyz making a foot hold into their biz. So how they'll react is anyones guess. Suffice to say, the head knocking and ball strutting is spilling over into all aspects of the Market, neh?"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks G.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]}]}