{"news":[{"title":"Nightly Report I","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Good evening, I'm Tom Phillips. Today mark the breaking ground ceremony of the new arcology. Seven representatives were on hand, each from an investor in the new project. Bank Arasaka, EBM, Utopian Corporation, Halicyon Industries, World Bank, Tallan Financial, and the mayor himself were the first to dig into the ground.<br/>[Video of the 7 representives with shovels digging into the ground.]<br/>The project is expect to take 5 years for Phase 1 to complete at a cost of 65 billion euros. The new facility will be modular in nature, easily updated. Initial construction will be able to house 500,000 people. The arcology will be self-sufficient, facilities for food production, water purification, and waste facility will be all contained. The project is to be a tiered structure. Reaching 100 stories within the 2nd year.<br/>Some critics object to the facility, saying the cost to the government is too much, with little benefit to the community in general. They also cite the influx of 'migrant' workers. The increase the Night City population will cause a strain on the city. Not to mention the increase security risks to the city with the possibilty of crime growing due to this unchecked population growth. NCPD is already stretched to its limits and can't deal with such a drastic population increase.<br/>However, all the corporation assured the people with speaches, as well as Arasaka's commitment to the project, to guarantee they will help the Night City law enforcement with anything needed.<br/>Now to Isha Tomoda."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom.<br/>The Mad Hatter struck again yesterday. This is the Hatter's 9th victim to have surfaced. The victim was a Zoe Zero and was found in the parking lot of McCartney Stadium in downtown Night City. Like the previous 8, the victim was found with a hat on, tag still attached. The hat is used to cover up the cranial implants that the Mad Hatter is known for.<br/>This time the victim was found dialing a phone. Though clinically dead, the animated corpse was punching in the numbers to the phone over and over before the authority put an end to it.<br/>[Video of a woman sitting in a parking lot surrounded by cops. Finally one of the officers walks up behind her and raises a machete before the image is cuts out.]<br/>\"This is sick. This guy has no morales or soul. We will find him and put an end to this gonk. A slow, painful end.\" Police Chief McQueen was quoted as saying about the case.<br/>For those viewers not following this story, the serial killer, dubbed The Mad Hatter by the media, takes SIN-less people and installs crude cerebral implants. These implants override the victim's nervous system, post mordem. The victim's body are sent to shocks to various neural paths causing their corpse to become animated. The first victim was found a little over six months ago and his victims are being found more frequently. It has been less than two weeks since the 8th victim was found.<br/>Police believe the killer is a ripperdoc gone over the edge. Authorities claim they have suspects, but no arrests have been made yet.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha.<br/>Tragic events. The News Force 7 team sends our thoughts and prays to the families of the victims.<br/>Now over to Porche Hendricks business report."},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br/>Biotechnica has unveiled its new tailored retrovirus to increase a person's reaction time. Safer than speedware and neural processor upgrade. This is bioware, genetic, and less intrusive. First seen in the euromarket, now has come to the United States.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br/>Now to our man on the street Harden Torres."},{"img":"htorres","reporter":"Harden Torres","commentary":"Gang activity has been elevating over the past month. The gang violence is exploding. Maelstrom made a major raid against the Silver Slashes. Authorities say that Maelstrom are expanding their territory and are putting to the slab their old rivals.<br />The raid surprised Law Enforcement with its visciousness and firepower. The Police are investigating, but it was leaked that military hardware was used in the assault. Missile launcher was mentioned during a debrief, but this is just a rumor and NCPD spokesman has no comment.<br />Also, 8 members of the Blood Razors were found killed in a parking lot near the gang neutral club, Slammers. NCPD says it was a case of vigilantes, but as always, still investigating the matter. One eye witness who talked to me claimed it was a deal gone wrong. The witness told this reporter that some corporate suits was giving the chromers equipment, supposedly to help some nefarious business scheme. Things erupted when one of the gangers declined the job. The suits drew guns and laid waste to the chromers, who were unarmed at the time, according to my source.<br />Again, the people need the NCPD to do something about this blatant risk to the public safety. I urge our watchers to contact City Hall and put pressure to get something done about this gang violence. And to persecute the corporation that are backing some of these criminials!<br />Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Always insightful Harden.<br/>Let's go over to Glit G and entertainment news. Glit?"},{"img":"glitg","reporter":"Glit G","commentary":"Bop bop TP. The band CybVyb is schedule to play the Stadium. Fans are anxious for the scene with the lineup including Full Burg, Neon ONe, Stab, and the local band, Fallen Mars. Concert promos are expecting sell out, so get those scalpers to hand over those ticks. BTW a small number of tickets are still floating around at the McCartney from what I hear, so get that NCART pass out and take a trip down.<br />There has been a concern over the recent gang heat, but like the Madman Cooper, concert promo extradonaire says that sec will be locked tight.Madman mentione to this little hottie that Militech's boyz will be the muscle at the show. Their contract is all set and there if full confidence that they will take of any glitches some nob-numb might throw down.<br />This is a surprise as the Madman exclusively used Araska blacks in the past. Will there be a fallout from this?<br />[Video of Madman Cooper]<br />\"Nonsense. Arasaka is chipped, doomo chipped. But Militech pull out the low bid for da op, period. If the boys in black don't like it, all they need to do is blue light the price in the next gig. Suffer the deficit of biz gato! *bark, bark, Hooowoooooo.......*\"<br />This comes during when both Sec Corps are locked in opposing contracts with CINO and OTEC. A major slight to Arasaka with the Camo boyz making a foot hold into their biz. So how they'll react is anyones guess. Suffice to say, the head knocking and ball strutting is spilling over into all aspects of the Market, neh?"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks G.<br/>For the News Force WNS 7 team and myself, Tom Phillips, until the next episode."}]},{"title":"Nightly Report II","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.  Top story of the day is the merger of BMS Surgical andn Dornier-Bauer Biotech. For more on that story I hand it off to our business analyst Porsche Hendricks.<br/>Porsche"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom.<br/>BMS Surgical and Dornier-Bauer Biotech have decided to join forces. BMS Surgical, a leading company in surgical equipment and pharmeceuticals, has recently expanded their interests into cybernetics and biotechnology. To help them more in that market they started talks with Dornier-Bauer Biotech, a Germany company already in the field. After negotiation, BMS Surgical CEO and Chairman Jeff Terlin made an offer to DB which was accepted.<br />[Video of a man in a business suit. Caption reads Jorge Sanchez - President of PR for BMS Surgical]<br />\"This merger is a good fit. Both of our corporations realized it's the best move we can make.\"<br />\"CEO of Dornier-Bauer Biotech, Gustav Rottergaun, will remain as CEO to head the new corporation, which will be called Bionetics Medical Industries. We are all very excited about the changes and can't wait to get started.\"<br />Rumor also has it that one of the leading cybernetic company might be joining this merger. If so, the corporation may become the largest medical corporation in the world. Biotechnica will need to start watching their profits in the coming years.<br />Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porsche<br/>Onto further news. Last night the streets erupted again near NCU. Our man Harden Torres is on the scene."},{"img":"htorres","reporter":"Harden Torres","commentary":"So gangs are still at this time the boo...AAAahhhhh!!!!!<br/>[Video show Harden infront of a crowd of gawkers behind police tape. Before Harden can finish his sentence a Boozo comes up behind him with a pie and slams it into Harden's face. Harden starts to scream as he tries to wipe what appears to be cream off himself only to reveal he is wipe flesh and blood as well. The camera cuts out as the boozo advances on the camera.]"},{"img":"tphillips","reporter":"Tom Phillips","commentary":"[A stun and speachless Tom Phillips comes on. He looks off camera and barely audible he says \"Tell me you got that on film? Yes!\" as he smiles. He turns quickly to the camera with a more somber look.] <br/>Well it appears that the Police still have a situation at NCU. Here are some messages from our sponsors...[fade to black]<br/>I just wanted to update our watchers on the incident with Harden. He is currently at Night City General, stablized, but still in critical condition. Also WNS 7 camera man, Bill Stevenson is also admitted and is in critical condition. We will keep you up to date on their condition. Tragic. Now over to Glit G and the entertainment report."},{"img":"glitg","reporter":"Glit G","commentary":"Arigat T. Glit G, your reporta with the forte, here with the last action. Who was caught in a threesome with an underage boy? Tell ya in a bit.<br />I want to turn your attention over to the hot new band, Disciple Digital. Their quasi-techno trance chant has been spread across the airwave like photons in fiber optics. I was able to chat a bit with their lead singer Mal.<br />[Video of Mal]<br />[Glit G off screen]: So Mal, what's up?<br />[Mal]:Our new dlows are netted. Da tour ETA is less than 7 ds. We're really pulsed bout it. Can't wait. GTG Cya.<br />[Camera comes back to Glit G]<br/>Ain't he chipped?<br />In other biz, you gotz 8 days to plug in and get your ticks for da CybVyb rave! Ticks might be sold out, but there is the 2nd market to shop. And speaking of that rave, check out Fallen Mars 3 nights from now at Club Atlantis.<br />G out!<br />Oh, oops, almost wiped on the tease!<br />Well the mega perv O-ki-gray was caught giving it to a minor yesterday.Apparently him and his wife are being sought after.Too bad they hit T-land before the oinks collared him.<br />Whelps GTG. Back to you TP."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks G<br/>Lastly, in international news, Eurobank has exercised its custodial power over all of IHAG stock. This has banned both OTEC and CINO, along with everyone else, in buying IHAG stock. This move has angered both OTEC and CINO investors.<br/>The exact reasons behind Eurobank's ban are unknown. Since last year, after IHAG's bankruptcy, Eurobank took control of IHAG. Both OTEC and CINO have been anxious to acquire the company's assets. OTEC and CINO have been suffering from terrorist attacks and other misfortunes. Each corporation procured security companies to help them deal with these situations. OTEC hired Militech and CINO hired Arasaka. The terrorist actions didn't abate, in fact the number and frequency grew. Not to mention, Militech and Arasaka have also been suffering attacks against all their assets as well.<br />Now with Eurobank's decision, will the situation improve? This reporter's opinion is \"no\". Militech and Arasaka are two military giants. Now that both are in this arena, I have little doubt that both won't leave it alive.<br />For WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report III","reports":[{"img":"tphillips","reporter":"Tom Phillips","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Mayor Ebunike had a press conference on the steps of city hall today. He talked about a plan to improve police and security in the city. The law enforcement bill would triple the police force and cost the city and estimated 136 million euros. It will also impose more corporate responsibility in this aid."},{"img":"mayor","reporter":"Mayor Ebunike","commentary":"We are one people. One city. All need to pay our dues to the community at large."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Assistant Mayor Garven Haakenson was interviewed after the conference and here's what he had to say:"},{"img":"asstmayor","reporter":"Assistant Mayor Haakenson","commentary":"I support Mayor Ebunike in his decision, but how the city is going to pay for it and how it's going to be enacted, is unrealistic."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"People are wondering if the Mayor is going to far. Since his re-election he has made several policy changes that contradict his 1st term. Before he supported the corporate rights, some would say, over the well being of the general populace. Now the Mayor has vetoed several bills that would be beneficial to corporatoins doing business in the city. Will the Mayor's plan succeed? We will see.<br/>Now over to Isha Tomoda"},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Thanks Tom.<br/>A major robbery yesterday leaves both Mustang Arms company and NCPD upset. An estimated 1,000 small arms, along with ammunition and other ordinance, were stolen from Mustang Arms in the Upper Marina.<br/>Authorities say that the robbers were well organized and maybe an inside job. Mustang Arms security computer was hacked from a back door that wasn't there when the system was installed. With the security offline, the robbers pulled up a truck, engaged and overtook the night secrity at the plant, and then got away.<br/>NCPD says they have some leads but would not discuss any details.<br/>Mustan Arm's representavit had this to say<br/>\"This is a tragedy of our times. Mustang Arms is doing all it can to get those weapons back. I know, I know, NCPD will be doing their job on recovery. However, Mustang Arms has posted a 200,000 euro reward for the location and acquisition of our stolen goods. I know we'll be getting tons of calls, but unless you have concrete proof, don't bother calling the hotline. Our lawyers will come after all false leads with not only charges bought against you but also a hefty lawsuit.\"<br/>Who the culprits are we will learn soon enough with a reward like that. Reporting from the Upper Marina, I'm Isha Tomoda.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Isha<br/>Now I'm going over to Mackenzie Voret filling in for Harden Torres."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom.<br/>Gang violence continues as Blood and Tears gang clashed with the Wang Fong Tong near the arena yesterday. The skirmish cause a lot of damage to the arena. Not only that, but Boozo activity around NCU has increased. More fights between Wild Things and Game Boyz also occurred with a shoot out in the McCartney Stadium parking garage. With all this violence occurring I wen to the street and ask people their opinions.<br/>\"The streets aren't safe anymore. My niece was killed 4 months ago from a stray bullet in a shoot out. The Mayor needs to do something!\" - Mayne Moore<br/>\"Your telling me. We can't fight this shit without clamping down on everyone, and I mean everyone!\" - Sgt Skaletty NCPD<br/>\"I say the Mayor is an idiot and he needs to stop blabbing and do something!\"- Annoymous municipal worker<br/>\"Violence? Gangs? Hell ya! We all need to jump in the handbasket and start fraggin' each other! Dat's the bit Gato! Chrome out! Shoot out!\" - Skitterboy<br/>Opinions are all over the place as you can see. The Mayor's new planned law enforcement bill may be enough. But is it too late? That's to be seen.<br/>Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Hey what's the word on Harden? Is he going to be OK?<"},{"img":"macv","reporter":"Mac V","commentary":"Hard to say Tom. He was injured pretty badly with the bozo attack. The ganger used a creampie mixed with acid. From what I was told, Harden needs extensive surgery and some implants. He will be out for a while."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks for the update. Our thoughts and prays go out to all the victims that were there.<br/>Now to Porche Hendricks with the business news."},{"img":"phendricks","reporter":"Porsche Hendricks","commentary":"Thanks Tom.<br/>IEC has announced today their next generation wearable computers. No long do you have strap on the various components. Now it is as easy as putting on your clothes. That's because it is your clothes. Their system interweaves the wiring and hardware into the fabric. Also with holographic technology a keyboard is a thing of the pass. Now you cna look good, be unencumbered, and have all your computing needs at your fingertips.<br/>IEC unveiled this new line at the Lurveire Fashion show in New York City. Several designer outfits were on display. Most critics loved the style and fashion IED brought to the table. Also the market has shown its support with IEC stock gain of 4.6 points today.<br/>In other business news, the decline of CINO, OTEC, Arasaka, and Militech's stock stopped today. All four corporations have suffered for this, now dubbed, Corporate War. They've been having this battle over the bankrupt company IHAG. Their stocks have lost major numbers since the beginning of the hostilities. With Eurobank's decision to halt the sale of IHAG stock, these embattled companies are finally leveling out with their market prices.<br/>What will the future hold for these giants? My guess is two of the companies will go down, while the other will get back their losses and then some.<br/>That's business for today. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Porche.<br/>Finally in a joint actoin, Militech and OTEC forces attacked an abandoned refinery off the shore of San Diego. A meeting of several pirate bands was taking place at the time. The pirates were taken by surprise according to one of our field reporters. Militech and OTEC took hardly any loses. The pirates were decimated during the assault.<br/>Representatives of Militech said the raid was in response to several attacks against OTEC facilities. The refinery was in international waters, so the US Coast Guard weren't called in. One curious thing was our man said one Tokushi Mamasume was found among the dead. Mr Mamasume had Arasaka credentials on him.<br/>We contacted Arasaka corporation for comment on the matter. They deny any involvement and that Mr Mamasume was being investigated for misappropriations of funds. He was about to have charges brought against him before he disappeared 3 days ago. Of course Arasaka might just be denying this to cover up a possible involvement. No hard evidence was found but I'm sure Arasaka will respond against Militech and OTEC's hostility in conjunction with CINO.<br/>That's it for the news. For WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report IV (2021-12-17)","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>In a stunning act of heroic, an extraction failed for a terrorist group on the Bay Bridge this morning. The COO of EBM North America, Marcus Dessauer, was thwarted by an EBM strike team. Mr. Dessauer was riding in a limousine and while crossing the Bay Bridge the limousine was attacked by a group flying an AV. This terrorist group was able to pull Mr. Dessauer from the car and loaded him into the AV. As the AV was attempting to flee the scene, an EBM strike team that was shadowing Mr. Dessauer leapt into action, literally.<br><i>Video of an AV lifting off from the Bay Bridge as the strike team exits from a van that was a few cars back. As the AV takes flight, one of the strike team members leaps into the air, about 30ft and stabs the AV bay door with a katana. This member proceeds to break into the AV.</i><br>Amazing! Mr. Dessauer was safely retrieved from these terrorist and is now in an undisclosed location. EBM was reached for comment and said<br><i>We are grateful Mr. Dessauer is safe and unharmed. The unknown extractor however killed 3 of our security detail during the kidnapping. Through the skill and expertise of our other security colleagues, they were able to prevent the extraction. EBM is proud of its members and their willingness to defend our colleagues from evil doers. EBM will also contribute to any repair efforts that this incident may have caused. Thank you</i><br>We go to Mac V who is live on the scene. Mac?..."},{"img":"macv","reporter":"Mac V","commentary":"Thanks Tom. I'm standing in the upper marina talking with the some of the eye witness and NCPD that are here. All of them were awed by the dramatic rescue. The NCPD have yet to determine who the culprits are. All of them, 5 in total, however were killed during the ensuing fight with the EBM strike team. None of the names of the EBM security detail have been released and they are not within custody. There was some minor damage to the bridge due to small arms fire and caused a major delay in traffic this morning. The bridge is open now and traffic seems to be moving. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thanks Mac. Wow. Just wow. Let's go to Porche Hendricks for business news today. "},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Thanks Tom. Today marks a week since Netwatch placed a 12 hour embargo on Arasaka and Miltech. Netwatch imposed this penalty due to operative from both corporations causing chaos in the NET. This however didn't seem to slow either of their activities from continuing. Arasaka has made its presence known within the Night City data grid. Militech seems be quiet about this currently. Though Militech has up its security details around their facilities within the city. Both company's stock have stabilized as well as CINO and OTECT who both companies have major contracts with. There are still incidents around the world between all 4 corporations and it doesn't look like they will be slowing down anytime soon. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillps","commentary":"Nice reporting Porche. On to further local news. For that we turn to Isha Tomoda."},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. Last night yet another victim of the Mad Hatter was found. This time wandering the New Harbor Mallplex. The victim was found in one of the restrooms on the second floor of the mall. They were found putting on makeup over and over again. At first patrons didn't realize the victim was deceased. NCPD quickly remove the victim from the facility. When questioned about the investigation, detective Sarah Miller replied with \"no comment.\" Citizen are still wary if the NCPD will be able to track down this serial killer. Back to you Tom."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Very macabre situation with the Mad Hatter. I hope all the viewers at home take precautions and remember. If you see something, say something. <br/>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]},{"title":"Nightly Report V (2021-12-18)","reports":[{"img":"tphillips","reporter":"Tom Phillps","commentary":"Hello Night City and welcome to WNS 7 News Force team. I'm Tom Phillips.<br/>Today we saw riots break out in east South Night City as fans and others reacted to the sentencing of music band Fusion Hydrant and 3 of their groupies. I turn to Glit G for more details on this story."},{"img":"glitg","reporter":"Glit G","commentary":"Sup TP. The scene is blitz! Piggywiggies have sent up barriers in da hood cover 8 blocks. Looting, rioting, fires, and mayhem broke out when the Fusion posse got the big D handed down to them. If you ain't in the know, those chromers 'napped VP of CM for Fantasy Unlimited, Victoria Branco. They demand the CEO to admit on stream their biz was into human trafficking. Blah! I know Alice Forge and it's fake news. So when she's said nada, they executed Branco live! OMFG! Today those dimheads got the judge and the death penalty. Some of their fans took to the street as well as other who've claimed they've had family friends boosted by FU. The rioters are contained by the boyz in blue for now. Back to you Anchorman! "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>*Tom Phillips is noticeably annoyed with Glit G's last remark*</i><br>Thanks Glit. Now we turn to business news with Porche Hendricks.<br>\n<i>*The mic doesn't cut out immediate and you hear Tom yelling in the background. \"I told that @#$% never to call me that on air!...\"*</i>"},{"img":"phendricks","reporter":"Porche Hendricks","commentary":"Uh, thanks Tom. Today we continue to see terrorist actions against OTEC/Militech and CINO/Arasaka facilities. Minor damage and sabotage have been occurring through out this past month between the four corporations. Neither OTEC or CINO are close to taking over the now defunct IHAG. This is one of the longest fights between megacorporation we've seen in recent history and there are no signs of it ending soon. <br>\nIn other business news, Revolution Genetics has unveil they are finishing up a nanite treatment that could reverse the effects of Alzheimer and other brain diseases. They studies have shown a 95% success rate with little to now side effects. This is a big win for the corporation as their stock have increase by 220% when this news broke. Back to you Tom "},{"img":"tphillips","reporter":"Tom Phillips","commentary":"Thank you Porche. Before I continue I would like to apologize to the viewers at home and to Glit G for the nasty word I used on air. It was unprofessional, unmanly, and very insensitive.<br>\nMoving on to Isha Tomoda with a report of an incident that occurred in West Haven district today. Isha? "},{"img":"itomoda","reporter":"Isha Tomoda","commentary":"Hi Tom. A gang war erupted outside the Neal Stephenson junior high in West Haven district. It all started when representatives from Microtech was visiting the school to provide computers and other equipment to the children of the school. This was interrupted when members of the Blood Razor gang and the Apostatas de la Muerte gang clashed. Both gangs attempt to steal what Microtech had and then fought against each other. Trauma Team was able to extract the Microtech employees. However only 2 of the 7 employees survived. Thoughts and prayers. The street is still chaos and from the reports of witness on the scene the school as set ablaze and none of the NCFD were able to get to it in time. Tragic. Back to you,,, Anchorman."},{"img":"tphillips","reporter":"Tom Phillips","commentary":"<i>*Tom noticeably grimaces*</i><br>\nThanks Isha. Sad news indeed. Viewers should note that currently West Haven is now considered a Red Zone and should be avoided. <br> In final news, there was an explosion on the construction site of the new arcology. There was a gas leak and investigator believe the explosion was cause by negligence of one of the construction crew. 7 people were killed and 12 injured. This has also set back the project completion date by 4 months. Investors are concerned as there has been other set back in the past few months around this project. <br>That's it for the WNS 7 News Force team, I'm Tom Phillips, goodnight."}]}]}