{"mounts":[
  {
    "name": "Jury Rigged",
    "description":"Jury-rigged weapon mounts cost almost nothing. Any weapon so mounted suffers a WA-2, can only be fired one direction, and the weapon is exposed. The weapon can be no larger than one space.",
    "availability":"C",
    "cost": 0,
    "wa": "-2",
    "spaces": 0,
    "spacelimit":"1"
  },
  {"name": "Pintle",
    "description":"Pintle mounts are strengthened posts mounting one weapon, served by a gunner who stands behind the weapon and swivels it to track the target. Any weapon 1 space or smaller can be mounted (small arms-rifles, etc.-count as no space), the mount costs 500eb, counts as no space, Availability C, and gives full WA. The weapon's traverse is limited to space available; for instance, if the mount is fixed to the cab of a pickup and fired from the bed, the weapon couldn't be fired to the rear, because there would be no room for the gunner to crawl out on the cab roof and point it backwards. Both gunner and weapon are exposed. A good example of this mount is machinegun mount in the back of a jeep.",
    "availability":"C",
    "cost": 500,
    "wa": "full",
    "spaces": 0,
    "spacelimit":"1"},
  {"name": "Fixed",
    "description":"Fixed mounts place the weapon firing from behind the vehicle's armor, but they can only fire straight out. They are Availability P, can mount any size weapon, cost 10% of weapon cost, fire in one direction only, WA -1, and the weapons mounted take up their full amount of spaces. a Jet fighters mount their cannons in fixed mounts, in the nose of the jet.",
    "availability":"P",
    "cost": -0.1,
    "wa": "-1",
    "spaces": 1,
    "spacelimit":""},
  {"name": "Articulated",
    "description":"Articulated mounts are like fixed mounts in that they fire out of one side, but they have servos and can swivel (think of the front machinegun mounts on century-old WWII tanks). They are Availability P, cost 25% of the weapon cost, can mount weapons of 2 spaces or less, at full WA, and the weapons take no spaces. These weapons can fire out from one side only, but are more mobile and can track targets that aren't directly in front of the weapon.",
    "availability":"P",
    "cost": -0.25,
    "wa": "full",
    "spaces": 0,
    "spacelimit":"2"},
  {"name": "Open-Fixed",
    "description":"Open mounts place weapons outside of the armor, in the open. They are Availablity P, can mount any size weapon, can fire in one direction (cost 5% of wepon cost) or rotate (cost 50% of weapon cost). Either way, open mount weapons take 1/10 of their normal spaces. Open mount weapons are exposed and vulnerable to targeting like a normal turret, except that the damage goes straight to the weapon (the Penetration of the weapon hitting an exposed weapon is the chance in 10 that the weapon is damaged. If the half the Penetration is rolled, the openly-mounted weapon is destroyed). Normally, large weapons (#Shots 1) on open mounts are crew served; an autoloader allows the weapon to be operated from within the hull.",
    "availability":"P",
    "cost": -0.05,
    "wa": "full",
    "spaces": 0.1,
    "spacelimit":""},
  {"name": "Open-Rotate",
    "description":"Open mounts place weapons outside of the armor, in the open. They are Availablity P, can mount any size weapon, can fire in one direction (cost 5% of wepon cost) or rotate (cost 50% of weapon cost). Either way, open mount weapons take 1/10 of their normal spaces. Open mount weapons are exposed and vulnerable to targeting like a normal turret, except that the damage goes straight to the weapon (the Penetration of the weapon hitting an exposed weapon is the chance in 10 that the weapon is damaged. If the half the Penetration is rolled, the openly-mounted weapon is destroyed). Normally, large weapons (#Shots 1) on open mounts are crew served; an autoloader allows the weapon to be operated from within the hull.",
    "availability":"P",
    "cost": -0.5,
    "wa": "full",
    "spaces":"weapon*0.1",
    "spacelimit":""},
  {"name": "Open-Rotate high angle",
    "description":"Turrets and 360` open mounts can be modified to high-angle traverse, so they can shoot aircraft without penalty. This doubles the cost of the turret/open mount.",
    "availability":"P",
    "cost": -1,
    "wa": "full",
    "spaces": 0.1,
    "spacelimit":""},
  {"name": "Turret",
    "description":"Turrets are 360 armored casements the protect weapons and crew serviing them from damage. Availability P, costs as much as the weapon mounted, and takes up 1/2 the space the weapon mounted, round down (only the turret takes up spaces; the weapon itself takes up 0 spaces once it's in the turret). A turret may mount more than one weapon, but no more spaces of weapons and equipment than 1/3 of the vehicle's spaces.",
    "availability":"P",
    "cost": -1,
    "wa": "full",
    "spaces": 0.5,
    "spacelimit":"vehicle*0.33"},
  {"name": "Turret-high angle",
    "description":"Turrets and 360` open mounts can be modified to high-angle traverse, so they can shoot aircraft without penalty. This doubles the cost of the turret/open mount.",
    "availability":"P",
    "cost": -2,
    "wa": "full",
    "spaces": 0.5,
    "spacelimit":""},
  {"name": "Rocket Pod",
    "description":"Pod Mounts are self-contained weapons mounts that are fitted on the exterior of a vehicle. They are Availability P and come in two types: Rocket Pods, which hold rocket weapons, and Gun Pods, which hold guns. Rocket Pods generally cost 350eb per space of rocket mounted (exceptions are listed in the Rockets section) and provide no armor protection. Gun Pods cost 500eb per space of gun mounted and provide SP 20/Armor Value 1 protection. Pod mounts are always fixed to fire in one direction (usually forward) and are exposed. Their main advantages are flexibility - weapon pods can be changed between missions - and the fact they add extra fire-power to a vehicle without taking up interior space. A vehicle can carry its tons in pod weapon spaces, suffering a 10% drop in Top Speed. Aircraft can carry twice this amount since they have wings to hang them on. Other vehicles can bug pod wings, which cost the same as 2 points of SDP and double the amount of pod weapons spaces that can eb carried. Ground vehicles with pod wings have a -2 to all maneuvering and control rolls (they're unwieldy) and look pretty strange...",
    "availability":"P",
    "cost": "350/space",
    "wa": "full",
    "spaces": 0,
    "spacelimit":"",
    "typelimit":"ROCKET/MISSILE"},
  {"name": "Gun Pod",
    "description":"Pod Mounts are self-contained weapons mounts that are fitted on the exterior of a vehicle. They are Availability P and come in two types: Rocket Pods, which hold rocket weapons, and Gun Pods, which hold guns. Rocket Pods generally cost 350eb per space of rocket mounted (exceptions are listed in the Rockets section) and provide no armor protection. Gun Pods cost 500eb per space of gun mounted and provide SP 20/Armor Value 1 protection. Pod mounts are always fixed to fire in one direction (usually forward) and are exposed. Their main advantages are flexibility - weapon pods can be changed between missions - and the fact they add extra fire-power to a vehicle without taking up interior space. A vehicle can carry its tons in pod weapon spaces, suffering a 10% drop in Top Speed. Aircraft can carry twice this amount since they have wings to hang them on. Other vehicles can buy pod wings, which cost the same as 2 points of SDP and double the amount of pod weapons spaces that can eb carried. Ground vehicles with pod wings have a -2 to all maneuvering and control rolls (they're unwieldy) and look pretty strange...",
    "availability":"P",
    "cost": "500/space",
    "wa": "full",
    "spaces": 0,
    "spacelimit":""}
]}
