{
  "daytime": [
    {
      "weight": 2,
      "title": "City Police",
      "desc": "1 NCPD, with AKR-20 and Kevlar vest(SP20). If PCs are wearing visible weapons/armor, will be stopped and asked for ID. Arguing backup will be called (3) to apprehend."
    },
    {
      "weight": 6,
      "title": "Corporate Guards",
      "desc": "4 Corpo security. Equiped with Vest(SP20), Helmet(SP25), Med SMGs. lf PCs visibly armed, will be toldto move along aggressively."
    },
    {
      "weight": 8,
      "title": "Nomads",
      "desc": "4 Nomads. Equiped with flack vests(SP20) and leather pants(SP4), fighting knives and rifles."
    },
    {
      "weight": 6,
      "title": "Boostergang",
      "desc": "4 street punks. Equiped with scratchers armor jackets (SP12). If PCS outnumber them, they avoid. Else they will rough the PCs up."
    },
    {
      "weight": 3,
      "title": "Petty Criminal",
      "desc": "Pickpocket. REF 8, Pickpocket 6. Armed with knife. If successful, lose wallet. Else PCs catch them in act."
    },
    {
      "weight": 6,
      "title": "Solo Team",
      "desc": "3 Solos. Equipped with flack vest(SP20), pants(SP20), and assault weapons. If PCs display rival Corporate uniform/logos, roll 1d10: 1-5, Solos look them over and move along; 6-10, pick a fight. If wearing same Corporate colors, PCs will be asked to join for a drink."
    },
    {
      "weight": 4,
      "title": "Boostergang",
      "desc": "6 gangers, Equipped with Med Pistols and rippers. They will hassle any attractive PCs, shakedown for money, and itching for a fight."
    },
    {
      "weight": 6,
      "title": "Techies",
      "desc": "2 Techies no arms or armor. If PCs wearing any unusual weapons/cybertech, they will stop you and ask to look. Techies willing to trade for it some Skill chipware."
    },
    {
      "weight": 3,
      "title": "Culties",
      "desc": "6 Inquisitors, armed with hidden nunchaku. They are handing out literature. If PCs have visible cybertech they will be harrassed and followed."
    },
    {
      "weight": 3,
      "title": "Private Investigator",
      "desc": "1 PI is shadowing PCs. Armed with HVY Pistol and armor jacket(SP16). If PCs rough the PI up, discover that he/she has mistaken PCs for someone else."
    },
    {
      "weight": 7,
      "title": "Corporates",
      "desc": "2 corporates, headed for lunch. Armor T-shirt(SP12) under his/her suit. Neither are armed. Roll 1D10.1·4, corpos being followed by thugs, PCs can help and be rewarded. 5-8, corpos are lost and ask directions. 9-10, Corpos know one of the PCs for good or bad."
    },
    {
      "weight": 6,
      "title": "Medias",
      "desc": "Interviewer team, doing random \"man-on·the-street\" interviews. Pick a subject."
    },
    {
      "weight": 7,
      "title": "locals",
      "desc": "2-6 Young adults. Roll lD10: 1-S friendly to PCs,  6-8 corporates to PCs, 9·10 they are abusive. No weapons or armor."
    },
    {
      "weight": 6,
      "title": "Crazy",
      "desc": "Bearded, wild-eyed in torn rags. Roll 1D10: 1-5 rants at PCs, 6-8 decides a PC is a space aliens and follows them screaming, 9-10 starts screaming, passes out, and bystanders thinks PCs did something."
    },
    {
      "weight": 5,
      "title": "Trauma Team",
      "desc": "5 member team on a lunch break. AV parked on corner. Security members on watch."
    },
    {
      "weight": 6,
      "title": "Rockerboys",
      "desc": "3 member band on the way to practice. Carrying instruments and dressed in leathers. Roll 1D10: 1·4 PCs invited to gig that night."
    },
    {
      "weight": 9,
      "title": "Posergang",
      "desc": "Five members of the wellknown Kennedys Posergang. Two male members look like RFK, one looks like JFK, the two females look like Jackie. If your group says anything- anything-about their appearance, their boosted hearing will pick it up and they will immediately take offense. They are wearing armor Ts under their retro-style 60s clothing and carrying Hvy. Handguns. JFK has a cyber-chrome right arm."
    },
    {
      "weight": 6,
      "title": "Securlty Guards",
      "desc": "2-5 guards escorting important Corporate. PCs get too close, they will be warn you off. Equiped with Flack armor(SP20), Sternmeyer35's, and boosted Reflexes."
    },
    {
      "weight": 4,
      "title": "Media Star",
      "desc": "Famous media star. Roll 1D10: 1·6 signs autographs if asked, 7-9 hostile and yells NCPD/bodyguards for help, 10 take a liking to one of PCs and allowed to tag along."
    }
  ],
  "evening": [
    {
      "weight": 5,
      "title": "City Pollce",
      "desc": "2 officers. Equipped with assault rifles, flack vests(SP20), pants(SP20). If PCs have visible weapons/armor, officers stop them and demand IDs.lf PCs argue backup is called (3 officers) to take you in. Reaching for weapons will draw fire."
  },
    {
      "weight": 6,
      "title": "Corporate Guards",
      "desc": "4 guards patrolling. Equipped flack vest(SP20), helmet(SP25), Med SMG. Unless PCs are Corporates, they will be told to leave the area."
  },
    {
      "weight": 6,
      "title": "Nomads",
      "desc": "6 Nomads. Equipped flack vests(SP20), leather pants(SP6), fighting knives and rifles. Moderately drunk and looking for a fight. PCs will be hassled if attractive."
  },
    {
      "weight": 7,
      "title": "Boostergang",
      "desc": "5 street punks. If PCs look soft, gangers will try to rob them. Equipped with Med. Handguns, knives and boosted reflexes."
  },
    {
      "weight": 6,
      "title": "Street Punks",
      "desc": "6 Smash-heads. If PCs not wearing Corporate or booster colors, punks will attack. Equipped with fighting knives and no armor."
  },
    {
      "weight": 6,
      "title": "Solo Team",
      "desc": "4 Solos, Equipped with flackvest(SP20), pants(SP20), smartgun chipped Hvy SMG, Boosted reflexes, boosted hearing, cyberoptics with low light, IR and targeting. If PCs wearing rival Corporate uniform/logo, Solos will: 1-S dodge PCs and move on; 6-10 decide PCs saw something and need to be eliminated."
  },
    {
      "weight": 6,
      "title": "Boostergang",
      "desc": "6 gangers. Equipped with SMGs, rippers, IR cyberoptics, boosted reflexes. They will hassle any attractive PC, shake PCs down and looking for a fight."
  },
    {
      "weight": 2,
      "title": "Techles",
      "desc": "2 Techies, with one Minami 10 submachinegun, wearing flack vests. Roll 1D10: 1-2 they are lugging a crate of tools into an AV-4, 3-5 they are working on a City system in your path. 6-10 they are walking toward you on their way to work."
  },
    {
      "weight": 6,
      "title": "Culties",
      "desc": "6 Inquisitors. Equipped nunchaku. If PC has visible cybertech (Arms, eyes w ith logos, etc.), Inquisitors attack."
  },
    {
      "weight": 4,
      "title": "Private Investigator",
      "desc": "Equipped with a heavy revolver and light armor jacket(SP12).Roll 1D10: 1-3 hassling an informant on the streetcorner, 4-7 shadowing someone ahead of PC, 8-10 stop PC and ask whether they have seen the person they are following."
  },
    {
      "weight": 3,
      "title": "Corporates",
      "desc": "4 corporales headed for the lev train station. Equipped with armor T-shirts(SP10) and polymer one shot. Roll 1D10: 1-4 they are being followed by thugs intent on robbery, 5-8 they think PCs are Boosters and will open fire at any provocation, 9-10 they not only think you're trouble, but will call for Corporate backup (4 guards, equipped flack vest(SP20), helmet(SP25), Med SMG. )."
  },
    {
      "weight": 7,
      "title": "Locals",
      "desc": "Young person. Roll 1D10: 1-5 they are being held up by 2 thugs, 6-10 they are being beaten by the lnquisitors."
  },
    {
      "weight": 6,
      "title": "Fireflght",
      "desc": "2 gangs battling. Both are wearing armor jackets (SP12) and heavy pistols. Also have Rippers, cyberarm weapons and slice-n-dices."
  },
    {
      "weight": 5,
      "title": "Trauma Team",
      "desc": "The AV-4 hits lands. Roll 1D10: 1-S ignores you, 6-10 PCs are viewed as threat, 2 solos equiped with armor(SP20) and medium SMG."
  },
    {
      "weight": 5,
      "title": "Rockerboys",
      "desc": "4 member band on the way to a gig with 2 solo bodyguards and a fixer. Roll 1D10: 1·4 they will invite PCs to join them, 5-8 solos will deal with PCs, 9-10 ignore PCs."
  },
    {
      "weight": 5,
      "title": "Medias",
      "desc": "2 members, camera operator and interviewer. They are on a stake out. Roll 1D10: 1-5 they're spotted by story-subject and a firelight starts. PCs are in the middle of it."
  },
    {
      "weight": 3,
      "title": "Major Criminal",
      "desc": "4 solo-type men armed with Med and Heavy pistols and wearing flack vests(SP20) are unloading a drug cargo out of a truck. Roll 1D10: 1-4 ignore PCs, 5-8 warn off PCs, 9-10 PCs are witnesses and need elimination."
  },
    {
      "weight": 6,
      "title": "Chromers",
      "desc": "4 gangers. Equiped with armored Tees(SP12), leather pants(SP4), and Med Pistol. All have cyberarms with rippers. Roll 1D10: 1-6 attack PCs, 7-8 ignore PCs, 9-10 take a liking to a PC and invite them to tag along."
  },
    {
      "weight": 3,
      "title": "Solo team",
      "desc": "3 solos Equipped with flack vest(SP20), flak pants(SP20), smartgun chipped Med SMG, Boosted reflexes, cyberoptics with low light, targeting. Currenlty on op. Roll 1D10: 1-5 ignore PCs, 6-10 they'll decide PCs are witnesses and must be eliminated."
  },
    {
      "weight": 3,
      "title": "Media Star",
      "desc": "Famous media star. Roll 1D10: 1-6 will sign autographs if asked, 7-9 will be hostile and yell for a policeman/bodyguard, 10 take a liking to a PC and allows them to tag along."
  }
  ],
  "aftermidnight": [
    {
      "weight": 10,
      "title": "City Police",
      "desc": "2 officers, equipped with assault rifle, flack vest(SP20), flak pants(SP20), helmet(SP25). If PCs wearing visible weapons/armor will be stopped and demand IDs. They are looking for a bust. If PCs have visible weapons, will be detained. Any aggression from PCs will be met with gunfire."
    },
    {
      "weight": 12,
      "title": "Corporate Guards",
      "desc": "4 guards patrolling. Equipped with flack vest(SP20), helmet(SP25), and Assault Rifles. Will open fire if PCs approach them or show any hostility."
    },
    {
      "weight": 8,
      "title": "Nomads",
      "desc": "4 Nomads. Equipped with flack vest(SP20), leather pants(SP4), fighting knives and rifles. Will ignore if PCs stay clear, but they are beating those Corporates."
    },
    {
      "weight": 10,
      "title": "Boostergang",
      "desc": "5 street punks. Equipped with hvy pistol, knives and boosted reflexes. Roll 1d10: 7+ attempt to rob PCs."
    },
    {
      "weight": 10,
      "title": "Street Punks",
      "desc": "4 Lace addicts looking for victim to rob, PCs are it. Armed with fighting knives, scratchers."
    },
    {
      "weight": 10,
      "title": "Solo Team",
      "desc": "2 solos. Equipped with flack vest(SP20), flak pants(SP20), smartgun chipped Heavy SMG, Boosted reflexes, boosted hearing, cyberoptics with low light, IR and targeting. If PCs have rival Corporate uniform/patches, roll 1D10: 1-S ignore PCs, 6·10 PCs are a witness and need elimination."
    },
    {
      "weight": 5,
      "title": "Boostergang",
      "desc": "6 gangers. Equipped automatic Med SMG/Assault Rifles, rippers, IR cyberoptics, boosted reflexes. Want to torture and harvest PCs."
    },
    {
      "weight": 5,
      "title": "Culties",
      "desc": "6 Inquisitors. Eqipped with nunchaku, hvy pistols handguns and whips. 'Only a servant of the Metal Demons would be abroad at this hour. Any decent citizen would be ot home, asleep. Hack, slay and maim the heretic'"
    },
    {
      "weight": 2,
      "title": "Private Investigator",
      "desc": "Equipped with heavy pistol and med armor jacket(SP18). Roll 1D10: 1·3 is ahead of PCs, hassling an informant about a suspect, 4-7 shadowing someone ahead of PCs, 8-10 stops PCs and ask them if they've the a person."
    },
    {
      "weight": 4,
      "title": "Chromers",
      "desc": "4 gangers. Equipped with armor Tee(SP10), cyberarms with rippers and Hvy Pistol built in. Roll 1d10: 1-6 attack PCs, 7-8 ignore PCs, 9-10 take a liking to a PC and invites them to tag along."
    },
    {
      "weight": 1,
      "title": "Medias",
      "desc": "2 person crew (camera and interviewer). Roll 1D10: 1-5 they will be spotted by subject and firefight starts, 6-10 they follow PCs for a story."
    },
    {
      "weight": 3,
      "title": "locals",
      "desc": "Young person. Roll 1D10: 1-5 being beaten by 4 thugs, 6-10 being beaten by the Inquisitors."
    },
    {
      "weight": 5,
      "title": "Fireflght",
      "desc": "Major altercation between 2 gangs. Both equipped with med armor jackets(SP16) ,very hvy pistols, Rippers, cyberarm weapons and slice-n-dices."
    },
    {
      "weight": 3,
      "title": "Trauma Team",
      "desc": "AV-4 lands for a recent firefight. Roll 1D10: 1-5 ignores PCs, 6-10 PCs are hostiles. Solos open up with Hvy SMGs."
    },
    {
      "weight": 1,
      "title": "Major Criminal",
      "desc": "4 solo-type men. Equipped with Hvy SMG and flack vests(SP20). Unloading a drug cargo. Roll 1D10: 1·4 don't notice PCs, 5-B warn off PCs, 9-10 witness need elimination."
    },
    {
      "weight": 1,
      "title": "Solo team",
      "desc": "3 Solos black ops team. Equipped with flack vest(SP20),flak pants(SP20), smartgun chipped Med SMG, Boosted reflexes, cyberoptics with low light, targeting. Roll 1D10: 1-5 ignore PCs, 6-10 PCs are a threat and need to be dealt with."
    }
  ]
}
