{
  "sysops": [{
      "name": "Herman Revista",
      "img": "hermanrevista",
      "imgCredit": "Illus. Zak Plucinski Copyrighted by WotC",
      "icon": "A cartoon rendered devil, with pitchfork",
      "stats": {
        "INT": 9,
        "REF": 6,
        "TECH": 8,
        "COOL": 7,
        "ATTR": 6,
        "LUCK": 4,
        "MA": 5,
        "BODY": 7,
        "EMP": 6
      },
      "skills": ["Interface 7",
        "Awareness 8",
        "Basic Tech 2",
        "Education/Gen. Know. 5",
        "Sytem Know. 7",
        "Cybertech 2",
        "Cyberdeck design 4",
        "Expert: Data Structures 7",
        "Composition 7",
        "Electronics 3",
        "Programming 9",
        "Driving 3",
        "Social 4",
        "Library Search 5"
      ],
      "cyber": ["Neural Processeor (PLG, CLNK, chip socket)", "Right Cyberarm (Shielded)"],
      "hc": 3,
      "equip": ["Custom Raven Microcyb Owl (Speed: +2, MU: 20, Datafort: +8)"],
      "progMix": "Runs detection programs until intruders, then launches anti-system programs against the hacker.",
      "flavor": "So you say that only a fool would install the Watchdog and Jack Attack inside the black ice? Why don't you run it anyway, just for kicks.",
      "desc": "Also known as the Red Devil, Herman is a regular wage-slave. He prefers to be hands-on, keeping a watch inside the company datafort waiting for intruders. He is also known for rearranging a datafort layout at a moment’s notice. The management doesn't like the changes, but also see that it helps with security. Any runner going to one of the data forts he supports can expect it to change the next time the hit it again."
    },
    {
      "name": "Lesley Major",
      "img": "lesleymajor",
      "imgCredit": "Illus. Randy Gallegos Copyrighted by WotC",
      "icon": "A sci fi warrior in white battelarmor",
      "stats": {
        "INT": 9,
        "REF": 6,
        "TECH": 8,
        "COOL": 5,
        "ATTR": 3,
        "LUCK": 3,
        "MA": 6,
        "BODY": 5,
        "EMP": 6
      },
      "skills": ["Interface 8",
        "Awareness 6",
        "Basic Tech 4",
        "Education/Gen. Know. 5",
        "Sytem Know. 8",
        "Cybertech 4",
        "Cyberdeck design 6",
        "Composition 6",
        "Electronics 5",
        "Programming 9"
      ],
      "cyber": ["Neural Processeor (PLG, CLNK, chip socket)"],
      "hc": 7,
      "equip": ["Enhanced Pandora's Deck (Speed: +3, MU: 20, Datafort: +7)"],
      "progMix": "Will usually have self-defense programs and as well programs to freeze an intruder.",
      "flavor": "",
      "desc": "Lesley Major is a nerd for all things science fiction. He views the Net as the ultimate playground and often can be overheard talking to himself about defending against the alien invasion to the data forts he montiors. Lesley isn't very social and if not surf the Net, he will be rewatching classic sci-fi vids."
    },
    {
      "name": "Lisa Blight",
      "img": "lisablight",
      "imgCredit": "Illus. Phil Hale Copyrighted by WotC",
      "icon": "Very tall and elongated  pure white woman",
      "stats": {
        "INT": 9,
        "REF": 6,
        "TECH": 7,
        "COOL": 7,
        "ATTR": 7,
        "LUCK": 4,
        "MA": 6,
        "BODY": 6,
        "EMP": 5
      },
      "skills": ["Interface 9",
        "Awareness 6",
        "Basic Tech 2",
        "Education/Gen. Know. 4",
        "Sytem Know. 8",
        "Cybertech 1",
        "Cyberdeck design 4",
        "Expert: Datafort Design 3",
        "Composition 5",
        "Electronics 2",
        "Programming 7",
        "Handgun 3",
        "Persuasion/Fast Talk 6",
        "Social 3",
        "Dance 2",
        "Motorcycle 3"
      ],
      "cyber": ["Neural Process (PLG, CLNK, Chip Socket)",
        "Right Cyber Arm (Cybermodem, cellular, hidden Holster)",
        "Miss Midnight"],
      "hc": 3,
      "equip": [
        "Zetatech Parraline 5800 (Speed: +3, MU: 15, Datafort:+6"
      ],
      "progMix": "Depending on the client she is working for she uses tracing programs to lock onto a target and let the corporation decide what to do. She doesn't use any anti-personnel programs as she learns from her mentor it is better to let ‘em live.",
      "flavor": "What do you mean she dumped secret plans for world domination? Somebody's got to unplug that witch!",
      "desc": "Lisa has a reputation of a loose cannon. Her origins are those of a small-time hacker on the Net. She got a bit of notoriety when she hacked into the SovOil's New York Datafort and transformed it into a large, pink, female pleasure device. A hit was taken out on her by the Russian corporations and she knew her days were numbered, so she did what any sensible netrunner would, turned herself into Netwatch. However, on her way to turning herself in at the Netwatch offices in New York, the SovOil hitter was able to get to her first. SovOil wanted to make her an example so instead of taking her life, they took her right arm. He then dropped her off in front of Netwatch. Since there was no damage to the SovOil's data and nothing stolen, she was given a light sentence. During this time the Netwatch agent, Jason Drow [did what?]. After Lisa's release, Drow took her under his wing and was hoping to make her an agent. She took the lesson that SovOil taught her and decided to be on the other side of the data wall. Lisa did take to heart some of the teaching of Drow, but preferred the more lucrative free-market corporations. She hired on as a consultant to help protect a company's datafort. However, if she encounters too much resistance from an intruder she has been known to dump a file rather than allow it to get into that 'runner's hands. This has caused some friction in the past but her response is 'Well you do have a hardcopy back-up don't you?' Often the shame not to admit they didn't will keep the client quiet [this sentence makes no sense]. Lisa is also known to enjoy herself outside of the Net. She often is at night clubs checking out [what/who] and being in the scene, which is an anomaly compared to other 'runners."
    },
    {
      "name": "Marcel Desoleil",
      "img": "marceldesoleil",
      "imgCredit": "Illus. Phil Hale Copyrighted by WotC",
      "icon": "A laser light blue knight",
      "stats": {
        "INT": 9,
        "REF": 7,
        "TECH": 8,
        "COOL": 8,
        "ATTR": 5,
        "LUCK": 6,
        "MA": 5,
        "BODY": 4,
        "EMP": 7
      },
      "skills": [
        "Interface 8",
        "Awareness 5",
        "Basic Tech 2",
        "Education/Gen. Know. 8",
        "Sytem Know. 8",
        "Cybertech 2",
        "Cyberdeck design 8",
        "Composition 2",
        "Electronics 4",
        "Programming 5",
        "Handgun 3",
        "Streetwise 4"
      ],
      "cyber": ["Neural Processor (PLG, CLNK)", "Right Cyberarm"],
      "hc": 3,
      "equip": ["SGI Tech Elysia (Spd: +3, MU: 20, Datawall: +5)"],
      "progMix": "Uses a lot of Anti-programs and daemons.",
      "flavor": "",
      "desc": "Marcel works out of Brazil. He has worked for Biotechnica for the past several years. The jobs have been assigned with most of the dataforts in the region. Many netrunners often get a surprise when he appears to deny them access. Marcel loves working at Biotechnica and has risen through the ranks. Biotechnica has entrusted him with a high level of access to their system. This has made Marcel a high priority target from other mega corps. Marcel has resist all attempts at extraction. He often will produce false information to extraction team netrunners to have them extract the wrong person or attack a different corporation."
    },
    {
      "name": "Pavit Bharat",
      "img": "pavitbharat",
      "imgCredit": "Illus. Zak Plucinski  Copyrighted by WotC",
      "icon": "A glowing sphere made of chrome",
      "stats": {
        "INT": 9,
        "REF": 7,
        "TECH": 8,
        "COOL": 8,
        "ATTR": 5,
        "LUCK": 6,
        "MA": 5,
        "BODY": 4,
        "EMP": 7
      },
      "skills": ["Interface 10",
        "Awareness 4",
        "Basic Tech 1",
        "Education/Gen. Know. 7",
        "Sytem Know. 8",
        "Cybertech 2",
        "Cyberdeck design 7",
        "Composition 7",
        "Electronics 2",
        "Programming 8",
        "Expert: Yoga 7",
        "Expert: Datafort design 8",
        "Persusaion/Fast Talk 3"
      ],
      "cyber": ["Cyberware: Neural Processor(PLG, CLNK)", "Optishield"],
      "hc": 1,
      "equip": [],
      "progMix": "Tracer programs and anything that freezes a netrunner",
      "flavor": "'Pavit' means 'pious' -but hey, it's not like any parents predict their kid will grow up to be a ruthless security agent.",
      "desc": "Pavit attended the elite Indian Institute of Technology in Bombay in Mumbai. There he excelled at data fort design, programming, and also delve into Yoga. He was a top researcher for the unversity after graduating with 2 doctorates in computer sciences. During his tenture, the coporation DCS (Delhi Consultancy Services) made him an offer that set him on the path of working in the corporate word. He works for the company as a hired gun to redesign and implement better Net security for a corporation on a datafort. He is ruthless in his changes and prefers a more draconian selection of programs to be installed on a datafort (except black ice in a fort he has worked on). He has taken some of his Yoga teaching and Hindu belief to a bit of the extreme when it comes to the Net and his treatment of 'runners. 'This life is but a dream and the net is a dream within a dream. I am here to awake those that need to help realizing it.'"
    },
    {
      "name": "Rasmin Bridger",
      "img": "rasminbridger",
      "imgCredit": "Illus. Brice Parker Copyrighted by WotC",
      "icon": "The Monopoly Man",
      "stats": {
        "INT": 10,
        "REF": 6,
        "TECH": 9,
        "COOL": 7,
        "ATTR": 4,
        "LUCK": 5,
        "MA": 6,
        "BODY": 7,
        "EMP": 4
      },
      "skills": ["Interface",
        "Awareness",
        "Basic Tech",
        "Education/Gen. Know.",
        "Sytem Know.",
        "Cybertech",
        "Cyberdeck design",
        "Composition",
        "Electronics",
        "Programming"
      ],
      "cyber": ["Neural Processor(PLG, CLNK)", "Right cyberoptic"],
      "hc": 1,
      "equip": [],
      "progMix": "Viruses and tracer programs",
      "flavor": "'Fifty for the Shotgun Wire, twenty to get past the Filter-even the Hellhound wanted a cool three hundred! That place is worse than a third-world bureaucracy! We should seriously rethink their merger proposal.'</br> -Erin Devlin, WuTech COO",
      "desc": ""
    },
    {
      "name": "Raymond Ellison",
      "img": "raymondellison",
      "imgCredit": "Illus. Phil Hale Copyrighted by WotC",
      "icon": "A corporate",
      "stats": {
        "INT": 8,
        "REF": 7,
        "TECH": 7,
        "COOL": 8,
        "ATTR": 7,
        "LUCK": 5,
        "MA": 6,
        "BODY": 5,
        "EMP": 6
      },
      "skills": ["Resources 8",
        "Awareness 5",
        "Human Perception 5",
        "Education/Gen. Know. 4",
        "Library Search 4",
        "Social 5",
        "Persuasion/Fast Talk 8",
        "Expert: Datafort Design 4",
        "Stock Market 2",
        "Wardrobe/Style 2",
        "Personal Grooming 2",
        "Accounting 8",
        "Business Sense 7",
        "Programming 2",
        "System Knowledge 3",
        "Handgun 2"
      ],
      "cyber": ["Neural Processor(PLG, CLNK)"],
      "hc": 0,
      "equip": [],
      "progMix": "",
      "flavor": "",
      "desc": "Raymond Ellison is a consultant that works with CIOs on their design and structure of data forts. His skills are more towards dealing with upper management to get the IT/Operation team the funding they need when they need it. Raymond started off as a junior programer at EBM but found his stride managing project for the various teams. He rose through the ranks as a project manager and then to VP of Datafort research. At this point in his life he didn't see himself getting much further. So he decided to quit EBM and become a consultant for hire to help corporations manage their IT teams. Raymond has been quite successful at this and has created his own firm that helps low level corporations with design, implementation, and growth of their Net presence."
    },
    {
      "name": "Simon Francisco",
      "img": "simonfrancisco",
      "imgCredit": "Illus. Randy Gallegos Copyrighted by WotC",
      "icon": "A medival catholic monk with hood and robes.",
      "stats": {
        "INT": 10,
        "REF": 6,
        "TECH": 7,
        "COOL": 7,
        "ATTR": 6,
        "LUCK": 5,
        "MA": 6,
        "BODY": 6,
        "EMP": 5
      },
      "skills": ["Interface",
        "Awareness",
        "Basic Tech",
        "Education/Gen. Know.",
        "Sytem Know.",
        "Cybertech",
        "Cyberdeck design",
        "Composition",
        "Electronics",
        "Programming",
        "Expert:Theology"
      ],
      "cyber": ["Neural Processor(PLG, CLNK)"],
      "hc": 1,
      "equip": [],
      "progMix": "",
      "flavor": "No, no, we don't have enforcers here at Futokora. You must've met one of our customer service reps.",
      "desc": ""
    }
  ]
}
